Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/grub2-render-label.1.po
Languages: de

source: Wed Feb 26 2014
de: Mittwoch, 26. Februar 2014

source: NAME
de: BEZEICHNUNG

source: B<grub-render-label> \(em Render an Apple disk label.
de: B<grub-render-label> \(em eine Apple-Plattenbezeichnung erzeugen

source: SYNOPSIS
de: ÜBERSICHT

source: B<grub-render-label> [-b | --bgcolor=I<COLOR>] [-c | --color=I<COLOR>]
de: B<grub-render-label> [-b | --bgcolor=I<FARBE>] [-c | --color=I<FARBE>]

source: [-f | --font=I<FILE>] [-i | --input=I<FILE>]
de: [-f | --font=I<DATEI>] [-i | --input=I<DATEI>]

source: [-o | --output=I<FILE>] [-t | --text=I<STRING>]
de: [-o | --output=I<DATEI>] [-t | --text=I<ZEICHENKETTE>]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<grub-render-label> renders an Apple disk label (.disk_label) file.
de: B<grub-render-label> Erzeugt eine Apple-Plattenbezeichnungsdatei (.disk_label).

source: OPTIONS
de: OPTIONEN

source: B<--color>=I<COLOR>
de: B<--color>=I<FARBE>

source: Use I<COLOR as the color for generated labels.>
de: verwendet die angegebene I<FARBE> für die erzeugten Bezeichnungen.

source: B<--bgcolor>=I<COLOR>
de: B<--bgcolor>=I<FARBE>

source: Use I<COLOR> as the background color for generated labels.
de: verwendet die angegebene I<FARBE> als Hintergrundfarbe für die erzeugten Bezeichnungen.

source: B<--font>=I<FILE>
de: B<--font>=I<DATEI>

source: Use I<FILE> as the font file for generated labels.
de: verwendet die angegebene I<SCHRIFT> als die Schriftdatei für die erzeugten Bezeichnungen.

source: --input=I<FILE>
de: --input=I<DATEI>

source: Read input text from I<FILE>.
de: liest den Text aus der angegebenen I<DATEI>.

source: --output=I<FILE>
de: --output=I<DATEI>

source: Render output to I<FILE>.
de: schreibt die Ausgabe in die angegebene I<DATEI>.

source: --text=I<STRING>
de: --text=I<ZEICHENKETTE>

source: Use I<STRING> as input text.
de: verwendet die angegebene I<ZEICHENKETTE> als Eingabetext.

source: Print verbose output.
de: gibt ausführliche Meldungen aus.

source: SEE ALSO
de: SIEHE AUCH

source: User Commands
de: Dienstprogramme für Benutzer

source: grub-render-label - generate a .disk_label for Apple Macs.
de: grub-render-label - eine .disk_label-Datei für Apple Macs erzeugen.

source: B<grub-render-label> [I<\,OPTION\/>...] [I<\,OPTIONS\/>]
de: B<grub-render-label> [I<\,OPTION\/>…] [I<\,OPTIONEN\/>]

source: Render Apple .disk_label.
de: Erzeugt Apple-.disk_label.

source: B<-b>, B<--bgcolor>=I<\,COLOR\/>
de: B<-b>, B<--bgcolor>=I<\,FARBE\/>

source: use COLOR for background
de: verwendet die angegebene FARBE für den Hintergrund.

source: B<-c>, B<--color>=I<\,COLOR\/>
de: B<-c>, B<--color>=I<\,FARBE\/>

source: use COLOR for text
de: verwendet die angegebene FARBE für Text.

source: B<-f>, B<--font>=I<\,FILE\/>
de: B<-f>, B<--font>=I<\,DATEI\/>

source: use FILE as font (PF2).
de: verwendet die angegebene DATEI als Schrift (PF2).

source: B<-i>, B<--input>=I<\,FILE\/>
de: B<-i>, B<--input>=I<\,DATEI\/>

source: read text from FILE.
de: liest den Text aus der angegebenen DATEI.

source: B<-o>, B<--output>=I<\,FILE\/>
de: B<-o>, B<--output>=I<\,DATEI\/>

source: set output filename. Default is STDOUT
de: legt den Namen der Ausgabedatei fest. Per Vorgabe wird in die Standardausgabe geschrieben.

source: B<-t>, B<--text>=I<\,STRING\/>
de: B<-t>, B<--text>=I<\,ZEICHENKETTE\/>

source: set the label to render
de: gibt die zu erzeugende Bezeichnung an.

source: print verbose messages.
de: gibt ausführliche Meldungen aus.

source: -?, B<--help>
de: B<-?>, B<--help>

source: give this help list
de: gibt eine kurze Hilfe aus.

source: give a short usage message
de: gibt eine kurze Meldung zur Verwendung aus.

source: print program version
de: gibt die Programmversion aus.

source: Mandatory or optional arguments to long options are also mandatory or optional for any corresponding short options.
de: Erforderliche oder optionale Argumente für lange Optionen sind ebenso erforderlich bzw. optional für die entsprechenden Kurzoptionen.

source: REPORTING BUGS
de: FEHLER MELDEN

source: Report bugs to E<lt>bug-grub@gnu.orgE<gt>.
de: Melden Sie Fehler (auf Englisch) an E<lt>bug-grub@gnu.orgE<gt>.

source: The full documentation for B<grub-render-label> is maintained as a Texinfo manual. If the B<info> and B<grub-render-label> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<grub-render-label> wird als ein Texinfo-Handbuch gepflegt. Wenn die Programme B<info> und B<grub-render-label> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.
