Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/ldd.1.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: ldd - print shared object dependencies
pl: ldd - wyświetla zależności od obiektów dzielonych

source: SYNOPSIS
pl: SKŁADNIA

source: B<ldd> [I<option>]... I<file>...
pl: B<ldd> [I<opcja>]... I<plik>...

source: DESCRIPTION
pl: OPIS

source: B<ldd> prints the shared objects (shared libraries) required by each program or shared object specified on the command line.
pl: B<ldd> wyświetla obiekty dzielone (biblioteki dzielone) wymagane przez każdy program lub obiekt dzielony podany w linii poleceń.

source: Security
pl: Bezpieczeństwo

source: In the usual case, B<ldd> invokes the standard dynamic linker (see B<ld.so>(8)) with the B<LD_TRACE_LOADED_OBJECTS> environment variable set to 1, which causes the linker to display the library dependencies. Be aware, however, that in some circumstances, some versions of B<ldd> may attempt to obtain the dependency information by directly executing the program. Thus, you should I<never> employ B<ldd> on an untrusted executable, since this may result in the execution of arbitrary code. A safer alternative when dealing with untrusted executables is:
pl: Zwyczajowo B<ldd> uruchamia standardowy konsolidator dynamiczny (patrz B<ld.so>(8) ze zmienną środowiska B<LD_TRACE_LOADED_OBJECTS> ustawioną na 1, co powoduje, że konsolidator wypisze zależności od bibliotek. Prosimy jednak uważać - niektóre wersje B<ldd> mogą próbować uzyskać te informacje, uruchamiając program bezpośrednio. Dlatego I<nigdy> nie powinno się używać B<ldd> z niezaufanym programem wykonywalnym, ponieważ może to owocować wykonaniem dowolnego kodu. Bezpieczniejsza alternatywa radzenia sobie z niezaufanymi programami wykonywalnymi to:

source: $ objdump -p /path/to/program | grep NEEDED
pl: $ objdump -p /ścieżka/do/programu | grep NEEDED

source: OPTIONS
pl: OPCJE

source: Print the version number of B<ldd>.
pl: Drukuje numer wersji B<ldd>.

source: Print all information, including, for example, symbol versioning information.
pl: Wypisuje wszystkie informacje, włączając to na przykład informacje o wersjach symboli.

source: Print unused direct dependencies. (Since glibc 2.3.4.)
pl: Wypisuje nieużywane bezpośrednie zależności. (Od glibc 2.3.4).

source: Perform relocations and report any missing objects (ELF only).
pl: Dokonuje relokacji i zgłasza wszelkie brakujące funkcje (tylko ELF).

source: Perform relocations for both data objects and functions, and report any missing objects or functions (ELF only).
pl: Dokonuje relokacji zarówno dla obiektów danych, jak i funkcji i zgłasza listę nieobecnych obiektów lub funkcji (tylko ELF).

source: Usage information.
pl: Informacje o użyciu programu.

source: BUGS
pl: BŁĘDY

source: B<ldd> does not work on a.out shared libraries.
pl: B<ldd> nie działa na bibliotekach współdzielonych a.out.

source: B<ldd> does not work with some extremely old a.out programs which were built before B<ldd> support was added to the compiler releases. If you use B<ldd> on one of these programs, the program will attempt to run with I<argc> = 0 and the results will be unpredictable.
pl: B<ldd> nie zadziała z bardzo starymi programami a.out, które zostały skonsolidowane zanim dodano do kompilatora obsługę B<ldd>. Jeśli użyje się B<ldd> na jednym z tych programów, to program będzie uruchomiony z I<argc> = 0, a wyniki tego będą nieprzewidywalne.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: COLOPHON
pl: O STRONIE

source: This page is part of release 4.05 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
pl: Angielska wersja tej strony pochodzi z wydania 4.05 projektu Linux I<man-pages>. Opis projektu, informacje dotyczące zgłaszania błędów, oraz najnowszą wersję oryginału można znaleźć pod adresem \%https://www.kernel.org/doc/man-pages/.
