Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/lz.1.po
Languages: de

source: Wed Feb 23 00:00:00 EET 2000
de: Mittwoch, 23. Februar 2000, 00:00:00 Uhr osteuropäische Zeit

source: Mtools Users Manual
de: Mtools-Benutzerhandbuch

source: NAME
de: BEZEICHNUNG

source: lz - gunzips and shows a listing of a gzip'd tar'd archive
de: lz - mit Gzip komprimiertes Tar-Archiv entpacken und als Liste anzeigen

source: SYNOPSIS
de: ÜBERSICHT

source: B<lz> I<file>
de: B<lz> I<Datei>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<lz> provides a listing of a gzip'd tar'd archive, that is a B<tar>(1) archive compressed with the B<gzip>(1) utility. It is not strictly necessary on Debian GNU/Linux, because the GNU B<tar>(1) program provides the same capability with the command
de: B<lz> listet den Inhalt eines mit B<gzip>(1) komprimierten B<tar>(1)-Archivs auf. Es ist in Debian GNU/Linux nicht unbedingt notwendig, da GNU B<tar>(1) die gleiche Fähigkeit mit dem Befehl

source: B<tar -tzf> I<file>
de: B<tar -tzf> I<Datei>

source: but this utility is provided in the mtools package for other platforms and is retained here for completeness.
de: bietet, aber dieses Dienstprogramm wird im Paket »mtools« für andere Plattformen bereitgestellt und hier vollständigkeitshalber behalten.

source: AUTHOR
de: AUTOR

source: Robert King (Robert.King@mailbox.gu.edu.au) wrote this page for the I<Debian/GNU> mtools package.
de: E<.MT robert.king@mailbox.gu.edu.au>Robert KingE<.ME> schrieb diese Handbuchseite für das »mtools«-Paket in I<Debian/GNU Linux>.

source: SEE ALSO
de: SIEHE AUCH
