Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/pacgraph.1.po
Languages: de

source: March 18, 2011
de: 18. März 2011

source: PACGRAPH \&1 "Pacgraph Manual"
de: PACGRAPH \&1 »Pacgraph-Handbuch«

source: NAME
de: BEZEICHNUNG

source: PACGRAPH provides a birds eye view of all installed packages
de: PACGRAPH erstellt eine Übersicht aller installierten Pakete

source: SYNOPSIS
de: ÜBERSICHT

source: E<.Nm pacgraph> -[h|s|o|e|c|r|n] [-f FILENAME] [-b|l|t|d COLOR] [-p INT INT] [-m MODE] [--shared] [--disable-palette] [package names]
de: E<.Nm pacgraph> -[h|s|o|e|c|r|n] [-f DATEINAME] [-b|l|t|d FARBE] [-p GANZZAHL GANZZAHL] [-m MODUS] [--shared] [--disable-palette] [Paketnamen]

source: DESCRIPTION
de: BESCHREIBUNG

source: E<.Nm> draws a pretty picture of your installed packages. Common uses are exploring dependency trees or finding hundreds of megs of useless packages. Supported distributions include Arch, Debian and Redhat.
de: E<.Nm> zeichnet eine ansehnliche Darstellung Ihrer installierten Pakete. Häufige Einsatzgebiete dafür sind die Erkundung des Abhängigkeitsbaums oder die Suche nach zahllosen nutzlosen Paketen. Dabei werden die Distributionen Archlinux, Debian und Redhat unterstützt.

source: E<.Nm> will by default generate a pacgraph.svg and if a converter is found automatically produce pacgraph.png. Alternately, pacgraph-tk provides and interactive version while pacgraph -c/--console produces a brief text summary. A list of packages may be provided as arguments to select them.
de: E<.Nm> wird in der Voreinstellung eine Datei pacgraph.svg erzeugen, und sofern ein Konvertierungsprogramm gefunden wurde, außerdem eine Datei pacgraph.png. Alternativ stellt pacgraph-tk eine interaktive Version zur Verfügung, während »pacgraph -c/--console« eine kurze Zusammenfassung in Textform ausgibt. Sie können eine Liste von Paketen als Argumente angeben, um diese auszuwählen.

source: More information and example graphs may be found on the project's homepage, http://kmkeen.com/pacgraph
de: Weitere Informationen und Beispieldiagramme finden Sie auf der Homepage des Projekts: http://kmkeen.com/pacgraph

source: OPTIONS
de: OPTIONEN

source: All of these are optional but many provide a means of generating a more aesthetically pleasing output.
de: Keine dieser Optionen muss angegeben werden, aber mit vielen davon erreichen Sie eine ästhetisch überzeugendere Ausgabe.

source: Show help message and exit.
de: zeigt Hilfeinformationen an und beendet das Programm.

source: Produce the SVG but do not attempt to rasterize it.
de: erzeugt eine SVG-Datei, aber versucht nicht, diese zu rastern.

source: Cm -f FILENAME --file=FILENAME
de: Cm -f DATEINAME --file=DATEINAME

source: Override default filename/location. Do not specify an extension.
de: setzt den vorgegebenen Dateinamen bzw. Speicherort außer Kraft. Geben Sie hierfür keine Endung an.

source: Print summary to console, does not draw a graph. Very fast and to the point.
de: gibt eine Zusammenfassung in die Konsole aus, aber zeichnet kein Diagramm. Sehr schnell und zielführend.

source: Disables lossy palette compression.
de: deaktiviert die verlustbehaftete Kompression der Palette.

source: THEMING OPTIONS
de: DARSTELLUNGSOPTIONEN

source: Colors may be words (white, red, etc), #RGB hex values or #RRGGBB hex values. Remember to quote/escape the #.
de: Die Farben können als Wörter (white, red, etc) oder als Hexadezimalwerte der Form #RGB oder #RRGGBB angegeben werden. Denken Sie daran, dass Sie das # maskieren bzw. in Anführungszeichen setzen.

source: Cm -b COLOR --background=COLOR
de: Cm -b FARBE --background=FARBE

source: Background color.
de: Hintergrundfarbe.

source: Cm -l COLOR --link=COLOR
de: Cm -l FARBE --link=FARBE

source: Color of links between packages.
de: Farbe der Verbindungen zwischen Paketen.

source: Cm -t COLOR --top=COLOR
de: Cm -t FARBE --top=FARBE

source: Color of packages which are not dependencies.
de: Farbe der Pakete, die keine Abhängigkeiten sind.

source: Cm -d COLOR --dep=COLOR
de: Cm -d FARBE --dep=FARBE

source: Color of packages which are dependencies.
de: Farbe der Pakete, die Abhängigkeiten sind.

source: Cm -i COLOR COLOR COLOR --highlight=COLOR COLOR COLOR
de: Cm -i FARBE FARBE FARBE --highlight=FARBE FARBE FARBE

source: Color of selected package, selected dependencies, selected needed-by.
de: Farbe des ausgewählten Pakets, der ausgewählten Abhängigkeiten und der ausgewählten »Benötigt von«.

source: Cm -p INT INT --point=INT INT
de: Cm -p GANZZAHL GANZZAHL --point=GANZZAHL GANZZAHL

source: Takes two integers, for the smallest and largest font size. Default is -p 10 100.
de: akzeptiert zwei Ganzzahlen für die jeweils kleinste und größte Schrift. Vorgabe ist -p 10 100.

source: OTHER OPTIONS
de: WEITERE OPTIONEN

source: Cm -m MODE --mode=MODE
de: Cm -m MODUS --mode=MODUS

source: Currently supported modes are arch, arch-repo, debian, redhat and ipkg. Default is arch. Use arch-repo to plot specific packages instead of installed packages.
de: Aktuell unterstützte Modi sind »arch«, »arch-repo«, »debian«, »redhat« und »ipkg«. Vorgabe ist »arch«. Verwenden Sie »arch-repo« zur Darstellung bestimmter Pakete anstelle der installierten Pakete.

source: Disable all chain compression.
de: deaktiviert jegliche Kompression.

source: Compare shared libraries.
de: vergleicht gemeinsam genutzte Bibliotheken.

source: Includes required-by of specified packages. Only works for arch-repo.
de: bezieht das »Benötigt-von« der angegebenen Pakete ein. Dies funktioniert nur für »arch-repo«.

source: AUTHORS
de: AUTOREN

source: E<.Nm> was written by E<.An Kyle Keen Aq keenerd@gmail.com > with patches from E<.An Carl Hamann> for Debian and Redhat support.
de: E<.Nm> wurde von E<.An Kyle Keen Aq keenerd@gmail.com > geschrieben, mit Patches von E<.An Carl Hamann> für Debian- und Redhat-Unterstützung.
