Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/repoquery.1.po
Languages: de

source: 17 October 2005
de: 17. Oktober 2005

source: NAME
de: BEZEICHNUNG

source: repoquery - query information from Yum repositories
de: repoquery - Informationen aus Yum-Paketquellen abfragen

source: SYNOPSIS
de: ÜBERSICHT

source: B<repoquery> [options] E<lt>item ...E<gt>
de: B<repoquery> [Optionen] E<lt>Objekt …E<gt>

source: B<repoquery> -a [options]
de: B<repoquery> -a [Optionen]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<repoquery> is a program for querying information from YUM repositories similarly to rpm queries.
de: B<repoquery> ist ein Programm zur Abfrage von Informationen aus Yum-Paketquellen, analog zu RPM-Abfragen.

source: GENERAL OPTIONS
de: ALLGEMEINE OPTIONEN

source: List valid queryformat tags and exit..
de: listet zulässige Formatabfragekennzeichnungen auf und beendet das Programm.

source: Report program version and exit.
de: zeigt Versionsinformationen an und beendet das Programm.

source: B<--repoid=E<lt>repoE<gt>>
de: B<--repoid=E<lt>PaketquelleE<gt>>

source: Specify which repository to query. Using this option disables all repositories not explicitly enabled with --repoid option (can be used multiple times). By default repoquery uses whatever repositories are enabled in YUM configuration.
de: gibt die abzufragende Paketquelle an. Diese Option deaktiviert alle Paketquellen, die nicht mit der Option --repoid aktiviert werden (dies kann mehrmals angegeben werden). Standardmäßig benutzt Repoquery sämtliche in der YUM-Konfiguration enthaltenen und aktivierten Paketquellen.

source: B<--enablerepo=E<lt>repoE<gt>>
de: B<--enablerepo=E<lt>PaketquelleE<gt>>

source: In addition to the default set, query the given additional repository, even if it is disabled in YUM configuration. Can be used multiple times.
de: fragt zusätzlich zu den vorgegebenen Paketquellen eine weitere Quelle ab, selbst wenn diese in der YUM-Konfiguration deaktiviert ist. Dies kann mehrmals angegeben werden.

source: B<--disablerepo=E<lt>repoE<gt>>
de: B<--disablerepo=E<lt>PaketquelleE<gt>>

source: Do not query the given repository, even if it is enabled in YUM configuration. Can be used multiple times.
de: überspringt die Abfrage der angegebenen Paketquelle, selbst wenn diese in der YUM-Konfiguration aktiviert ist. Dies kann mehrmals angegeben werden.

source: B<--repofrompath=E<lt>repoidE<gt>,E<lt>path/urlE<gt>>
de: B<--repofrompath=E<lt>Paketquellen-IDE<gt>,E<lt>Pfad/URLE<gt>>

source: Specify a path or url to a repository (same path as in a baseurl) to add to the repositories for this query. This option can be used multiple times. If you want to view only the pkgs from this repository combine this with --repoid. The repoid for the repository is specified by E<lt>repoidE<gt>.
de: gibt einen Pfad oder eine URL zu einer Paketquelle an (gleicher Pfad wie in der Basis-URL), um für diese Abfrage Paketquellen hinzuzufügen. Diese Option kann mehrmals angegeben werden. Falls nur die Pakete aus dieser Paketquelle angezeigt werden sollen, kombinieren Sie diese Option mit --repoid. Die Paketquellen-ID wird durch E<lt>Paketquellen-IDE<gt> angegeben.

source: Enable YUM plugin support.
de: aktiviert die Unterstützung für Yum-Plugins.

source: For rpmquery compatibility, doesn't do anything.
de: hat keinen Effekt, es ist nur für die rpmquery-Kompatibilität vorhanden.

source: Help; display a help message and then quit\&.
de: zeigt eine Hilfemeldung an und beendet das Programm\&.

source: Run quietly: no warnings printed to stderr.
de: aktiviert den stillen Modus: Es werden keine Warnungen in die Standardfehlerausgabe geleitet.

source: Produce verbose output.
de: zeigt ausführliche Informationen an.

source: Tells repoquery to run entirely from YUM cache - does not download any metadata or update the cache. Queries in this mode can fail or give partial/incorrect results if the cache isn't fully populated beforehand with eg "yum makecache".
de: führt dazu, dass repoquery vollständig aus dem Yum-Zwischenspeicher ausgeführt wird. Es werden weder Metadaten heruntergeladen noch der Zwischenspeicher aktualisiert. Abfragen in diesem Modus können scheitern oder unvollständige und inkorrekte Ergebnisse liefern, wenn der Zwischenspeicher zuvor nicht mit beispielsweise »yum makechache« aufgebaut wurde.

source: Create and use a private cache instead of the main YUM cache. This is used by default when run as non-root user.
de: erstellt und verwendet einen privaten Zwischenspeicher, anstatt den Haupt-Zwischenspeicher von Yum zu nutzen. Dies ist die Voreinstellung, wenn das Programm als gewöhnlicher Benutzer ausgeführt wird.

source: B<-c E<lt>config fileE<gt>, --config=E<lt>config fileE<gt>>
de: B<-c E<lt>KonfigurationsdateiE<gt>, --config=E<lt>KonfigurationsdateiE<gt>>

source: Use alternative config file (default is /etc/yum.conf).
de: verwendet eine alternative Konfigurationsdatei (Vorgabe ist /etc/yum.conf).

source: Pretend the current release version is the given string. This is very useful when combined with --installroot. You can also use --releasever=/ to take the releasever information from outside the installroot. Note that with the default upstream cachedir, of /var/cache/yum, using this option will corrupt your cache (and you can use $releasever in your cachedir configuration to stop this).
de: setzt die angegebene Zeichenkette als aktuelle Release-Version fest. Dies ist in Verbindung mit --installroot sinnvoll. Sie können auch --releasever=/ angeben, um die Informationen zur Release-Version von einem Ort außerhalb der Installationswurzel zu beziehen. Beachten Sie: Wenn Sie das vorgegebene Zwischenspeicherverzeichnis /var/cache/yum verwenden, kann diese Option Ihren Zwischenspeicher beschädigen. Um dies zu verhindern, können Sie die Variable $releasever in der Konfiguration Ihres Zwischenspeicher-Verzeichnisses verwenden.

source: B<--setopt=option=value>
de: B<--setopt=Option=Wert>

source: Set any config option in yum config or repo files. For options in the global config just use: --setopt=option=value for repo options use: --setopt=repoid.option=value
de: setzt beliebige Konfigurationsoptionen in Konfigurations- oder Paketquellendateien von Yum. Die globale Konfiguration ändern Sie mit --setopt=Option=Wert, die Paketquellen mit --setopt=Paketquellen-ID.Option=Wert.

source: PACKAGE QUERY OPTIONS
de: OPTIONEN ZUR PAKETABFRAGE

source: Show general information about package similarly to "rpm -qi"
de: zeigt allgemeine Informationen zu einem Paket an, ähnlich wie »rpm -qi«.

source: List files in package.
de: listet die Dateien im Paket auf.

source: List package dependencies.
de: listet die Abhängigkeiten des Pakets auf.

source: When used with --requires, resolve capabilities to originating packages.
de: löst in Verbindung mit --requires die Fähigkeiten zu den Ursprungspaketen auf.

source: List capabilities package provides.
de: listet die Fähigkeiten auf, die das Paket bereitstellt.

source: List capabilities obsoleted by package.
de: listet die Fähigkeiten auf, die das Paket als obsolet markiert.

source: List capabilities conflicting with package.
de: listet die Fähigkeiten auf, mit denen das Paket im Konflikt steht.

source: List package changelog.
de: zeigt das Änderungsprotokoll des Pakets an.

source: Show a location where the package could be downloaded from. For example: B<wget `repoquery --location yum`>
de: zeigt einen Ort an, von dem das Paket heruntergeladen werden kann. Beispiel: B<wget `repoquery --location yum`>

source: Show package source RPM name.
de: zeigt den Source-RPM-Namen des Pakets an.

source: Operate on corresponding source RPM.
de: arbeitet mit dem entsprechenden Quellpaket.

source: B<--groupmember PACKAGE>
de: B<--groupmember PAKET>

source: List the repodata groups (yumgroups.xml) belongs to (if any).
de: listet die repodata-Gruppen auf (yumgroups.xml), zu denen das Paket gehört (falls zutreffend).

source: Use name-version-release output format (rpm query default)
de: verwendet Name-Version-Release als Ausgabeformat (Voreinstellung für die RPM-Abfrage).

source: Use name-epoch:version-release.architecture output format (default)
de: verwendet Name-Epoche:Version-Release.Architektur als Ausgabeformat (Voreinstellung).

source: Use epoch:name-version-release.architecture output format (easier to parse than nevra)
de: verwendet Epoche:Name-Version-Release.Architektur als Ausgabeformat. Dies lässt sich einfacher auswerten als Name-Epoche:Version-Release.Architektur.

source: Specify custom output format for queries. You can add ":date", ":day" and ":isodate" to all the tags that are a time, and you can add ":k", ":m", ":g", ":t" and ":h" to sizes. You can also specify field width as in sprintf (Eg. %-20{name})
de: gibt ein benutzerdefiniertes Ausgabeformat für die Abfragen an. Sie können »:date«, »:day« und »:isodate« zu allen Zeitangaben-Tags hinzufügen sowie »:k«, »:m«, »:g«, »:t« und »:h« zu Größenangaben-Tags. Außerdem können Sie Feldbreiten wie in der PHP-Funktion sprintf eingeben, zum Beispiel %-20{name}.

source: Output format which can be used with --requires/--whatrequires/--obsoletes/--conflicts. Default output is 'text'.
de: Dieses Ausgabeformat kann mit »--requires«, »--whatrequires«, »--obsoletes« und »--conflicts« verwendet werden. Die Voreinstellung ist »text«.

source: In combination with --output ascii-tree|dot-tree this option specifies the number of level to print on the tree. Default level is 'all'.
de: gibt in Kombination mit --output ascii-tree|dot-tree die Anzahl der in der Baumansicht anzuzeigenden Ebenen an. Die Voreinstellung ist »all«.

source: PACKAGE SELECTION OPTIONS
de: OPTIONEN ZUR PAKETAUSWAHL

source: Query all available packages (for rpmquery compatibility / shorthand for repoquery '*')
de: sucht nach allen verfügbaren Paketen (für Kompatibilität zu rpmquery, Kürzel für repoquery '*')

source: B<-f, --file FILE>
de: B<-f, --file DATEI>

source: Query package owning FILE.
de: sucht nach Paketen, die diese DATEI enthalten.

source: B<--whatobsoletes CAPABILITY>
de: B<--whatobsoletes FÄHIGKEIT>

source: Query all packages that obsolete CAPABILITY.
de: sucht nach Paketen, die diese FÄHIGKEIT als obsolet markieren.

source: B<--whatconflicts CAPABILITY>
de: B<--whatconflicts FÄHIGKEIT>

source: Query all packages that conflict with CAPABILITY.
de: sucht nach Paketen, die Konflikte mit dieser FÄHIGKEIT verursachen.

source: B<--whatprovides CAPABILITY>
de: B<--whatprovides FÄHIGKEIT>

source: Query all packages that provide CAPABILITY.
de: sucht nach Paketen, die diese FÄHIGKEIT bereitstellen.

source: B<--whatrequires CAPABILITY>
de: B<--whatrequires FÄHIGKEIT>

source: Query all packages that require CAPABILITY.
de: sucht nach Paketen, die diese FÄHIGKEIT benötigen.

source: When used with --whatrequires, look for non-explicit dependencies in addition to explicit ones (e.g. files and Provides in addition to package names). This is the default.
de: wird zusammen mit --whatrequires verwendet, um zusätzlich zu den expliziten Abhängigkeiten auch nicht-explizite Abhängigkeiten einzubeziehen. So werden zum Beispiel außer Paketnamen auch enthaltene Dateien und »Provides:«-Tags berücksichtigt. Dies ist die Voreinstellung.

source: When used with --whatrequires, search for dependencies only exactly as given. This is effectively the opposite of --alldeps.
de: sucht in Verbindung mit --whatrequires nach exakt den angegebenen Abhängigkeiten. Dies ist effektiv das Gegenteil von --alldeps.

source: When used with --whatrequires, query packages recursively.
de: sucht in Verbindung mit --whatrequires rekursiv nach Paketen.

source: Limit the query to packages of given architecture(s). Valid values are all architectures known to rpm/yum such as 'i386' and 'src' for source RPMS. Note that repoquery will now change yum's "arch" to the first value in the archlist. So "--archlist=i386,i686" will change yum's canonical arch to i386, but allow packages of i386 and i686.
de: begrenzt die Abfrage der Pakete auf die angegebene(n) Architektur(en). Zulässige Werte sind hierbei alle Architekturen, die RPM bzw. Yum bekannt sind, beispielsweise »i386«, oder »src« für Quellpakete. Beachten Sie, dass repoquery den Wert von »arch« in Yum auf den ersten Wert in der Architekturenliste ändert. So ändert »--archlist=i386,i686« die kanonische Architektur von Yum zu i386, wobei Pakete für i386 und auch i686 erlaubt sind.

source: B<--pkgnarrow=WHAT>
de: B<--pkgnarrow=WAS>

source: Limit what packages are considered for the query. Valid values for WHAT are: installed, available, recent, updates, extras, all and repository (default).
de: begrenzt die bei der Abfrage zu berücksichtigenden Pakete. Zulässige Werte für WAS sind »installed«, »available«, »recent«, »updates«, »extras«, »all« und »repository« (Voreinstellung).

source: Restrict query ONLY to installed pkgs - disables all repos and only acts on rpmdb.
de: beschränkt die Abfrage auf installierte Pakete. Dadurch werden alle Paketquellen deaktiviert und ausschließlich die RPM-Datenbank genutzt.

source: GROUP QUERY OPTIONS
de: OPTIONEN ZUR GRUPPENABFRAGE

source: Show general information about group.
de: zeigt allgemeine Informationen zur Gruppe an.

source: List packages belonging to (required by) group.
de: listet Pakete auf, die zu dieser Gruppe gehören (das heißt, die von dieser Gruppe benötigt werden).

source: B<--grouppkgs=WHAT>
de: B<--grouppkgs=WAS>

source: Specify what type of packages are queried from groups. Valid values for WHAT are all, mandatory, default, optional.
de: gibt an, welche Pakettypen aus den Gruppen abgefragt werden sollten. Zulässige Werte sind »all«, »mandatory«, »default« und »optional«.

source: List groups required by group.
de: listet Gruppen auf, die von einer Gruppe benötigt werden.

source: GROUP SELECTION OPTIONS
de: OPTIONEN ZUR GRUPPENAUSWAHL

source: Query all available groups.
de: fragt alle verfügbaren Gruppen ab.

source: Query groups instead of packages.
de: fragt Gruppen anstelle von Paketen ab.

source: EXAMPLES
de: BEISPIELE

source: List all packages whose name contains 'perl':
de: Alle Pakete auflisten, deren Name »perl« enthält:

source: List all packages depending on openssl:
de: Alle Pakete auflisten, die von openssl abhängen:

source: List all package names and the repository they come from, nicely formatted:
de: Alle Paketnamen auflisten sowie die Paketquellen, aus denen Sie stammen, sauber formatiert:

source: List name and summary of all available updates (if any), nicely formatted:
de: Name und Zusammenfassung aller verfügbaren Aktualisierungen auflisten (falls verfügbar, sauber formatiert):

source: List optional packages in base group:
de: Optionale Pakete in der »base«-Gruppe auflisten:

source: List build requirements from 'anaconda' source rpm:
de: Bauabhängigkeiten des Quellpakets »anaconda« auflisten:

source: List packages which BuildRequire gail-devel
de: Pakete auflisten, die zur Erstellung das Paket gail-devel benötigen:

source: B<repoquery --archlist=src --whatrequires gail-devel> NB: This command will only work if you have repositories enabled which include srpms.
de: B<repoquery --archlist=src --whatrequires gail-devel> Hinweis: Dieser Befehl funktioniert nur dann, wenn Paketquellen aktiviert sind, die Quellpakete enthalten.

source: MISC
de: SONSTIGES

source: B<Specifying package names>
de: B<Angeben von Paketnamen>

source: A package can be referred to in all queries with any of the following:
de: Ein Paket kann in allen Abfragen aufgrund einer oder mehrerer der folgenden Eigenschaften berücksichtigt werden:

source: For example: B<repoquery -l kernel-2.4.1-10.i686>
de: Beispiel: B<repoquery -l kernel-2.4.1-10.i686>

source: Additionally wildcards (shell-style globs) can be used.
de: Zusätzliche Platzhalter (Textschnipsel im Shell-Stil) sind zulässig.

source: FILES
de: DATEIEN

source: As repoquery uses YUM libraries for retrieving all the information, it relies on YUM configuration for its default values like which repositories to use. Consult YUM documentation for details:
de: Da repoquery die Yum-Bibliotheken zum Ermitteln aller Informationen nutzt, bezieht es die Standardwerte zu den zu verwendenden Paketquellen aus der Yum-Konfiguration. Details hierzu finden Sie in der Yum-Dokumentation:

source: SEE ALSO
de: SIEHE AUCH

source: I<yum.conf (5)> http://yum.baseurl.org/
de: B<yum.conf>(5) http://yum.baseurl.org/

source: AUTHORS
de: AUTOREN

source: See the Authors file included with this program.
de: Lesen Sie die mit diesem Programm gelieferte Autorenliste.

source: BUGS
de: FEHLER

source: There are of course no bugs, but should you find any, you should first consult the FAQ section on http://yum.baseurl.org/wiki/Faq and if unsuccessful in finding a resolution contact the mailing list: yum-devel@lists.baseurl.org. To file a bug use http://bugzilla.redhat.com for Fedora/RHEL/Centos related bugs and http://yum.baseurl.org/report for all other bugs.
de: Es gibt natürlich keine Fehler, sollten Sie dennoch einen entdecken, ziehen Sie zuerst den Abschnitt der häufig gestellten Fragen auf http://yum.baseurl.org/wiki/Faq zu Rate. Sollten Sie dort keine Lösung finden, kontaktieren Sie die (englischsprachige) Mailingliste auf yum-devel@lists.baseurl.org. Für Fehlermeldungen benutzen Sie http://bugzilla.redhat.com für Fehler in Fedora/RHEL/Centos und http://yum.baseurl.org/report für sonstige Fehler.
