Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/rnano.1.po
Languages: fr

source: July 2020
fr: Juillet 2020

source: NAME
fr: NOM

source: rnano - a restricted nano
fr: rnano - Version restreinte de nano

source: B<rnano> [I<options>] [[+I<line>[,I<column>]]\ I<file>]...
fr: B<rnano> [I<options>] [[+I<ligne>[,I<colonne>]]\ I<fichier>]...

source: B<rnano> runs the B<nano> editor in restricted mode. This allows editing only the specified file or files, and doesn't allow the user access to the filesystem nor to a command shell.
fr: B<rnano> est une version de B<nano> fonctionnant en mode restreint. Ce mode ne permet d'éditer que le ou les fichiers indiqués et n'autorise pas l'utilisateur à accéder au système de fichiers ou à un interpréteur de commandes.

source: In restricted mode, B<nano> will:
fr: En mode restreint, B<nano> :

source: not allow suspending;
fr: ne permettra pas de suspendre l'édition\ ;

source: not allow saving the current buffer under a different name;
fr: ne permettra pas d'enregistrer le tampon en cours sous un nom différent\ ;

source: not allow inserting another file or opening a new buffer;
fr: ne permettra pas l'insertion d'un autre fichier ou l'ouverture d'un nouveau tampon\ ;

source: not allow appending or prepending to any file;
fr: ne permettra pas d'ajouter en début ou en fin d'un fichier\ ;

source: not make backup files nor do spell checking.
fr: ne fera pas de copies de sauvegarde ni de correction orthographique.

source: Show the available command-line options and exit.
fr: Afficher les options en ligne de commande disponibles et quitter.

source: For all existing options, see the B<nano>(1) man page.
fr: Pour toutes les options existantes, voir la page de manuel de B<nano>(1).

source: BUGS
fr: BOGUES

source: Please report bugs via I<https://savannah.gnu.org/bugs/?group=nano>.
fr: Veuillez rapporter les bogues à l'aide de I<https://savannah.gnu.org/bugs/?group=nano>.

source: HOMEPAGE
fr: PAGE D'ACCUEIL

source: SEE ALSO
fr: VOIR AUSSI

source: November 2018
fr: Novembre 2018

source: Show a summary of command-line options and exit.
fr: Afficher un résumé des options en ligne de commande et quitter.

source: See the B<nano>(1) manpage for all available options.
fr: Voir la page de manuel B<nano>(1) pour toutes les options disponibles.

source: AUTHOR
fr: AUTEUR

source: Chris Allegretta and others (see the files I<AUTHORS> and I<THANKS> for details). This manual page was originally written by Thijs Kinkhorst for the Debian system (but may be used by others).
fr: Chris Allegretta et d'autres (voir les fichiers I<AUTHORS> et I<THANKS> pour plus de détails). Cette page de manuel a été initialement rédigée par Thijs Kinkhorst pour le système Debian (mais elle peut être utilisée par d'autres).

source: August 2020
fr: Août 2020
