Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/sotruss.1.po
Languages: da

source: May 2014
da: maj 2014

source: User Commands
da: Brugerkommandoer

source: NAME
da: NAVN

source: sotruss - trace shared library calls through PLT
da: sotruss - registrer delte bibliotekskald via PLT

source: B<sotruss> [I<\,OPTION\/>...] [I<\,--\/>] I<\,EXECUTABLE \/>[I<\,EXECUTABLE-OPTION\/>...]
da: B<sotruss> [I<\,TILVALG\/>...] [I<\,--\/>] I<\,KØRBAR_FIL \/>[I<\,KØRBAR_FIL-TILVALG\/>...]

source: DESCRIPTION
da: BESKRIVELSE

source: B<sotruss> is a small wrapper around B<ld.so> that runs the specified I<executable> until it exits. It intercepts and produce a trace of the dynamic library calls which are called by the executed process via the Procedure Linkage Table (PLT). It outputs the caller, the calle and the parameters as each call is executed.
da: B<sotruss> er et lille omslag omkring B<ld.so>, der afvikler den angivne I<kørbar_fil> indtil den afsluttes. Omslaget fortolker og laver en registrering af de dynamiske bibliotekskald, der kaldes af den afviklede proces via Procedure Linkage Table (PLT). Der registreres kalder (caller), kaldningen (calle) og parametere efterhånden som hvert kald afvikles.

source: OPTIONS
da: TILVALG

source: B<-F>, B<--from> FROMLIST
da: B<-F>, B<--from> FRALISTE

source: Trace calls from objects on FROMLIST.
da: Registrer kald fra objekter på FRALISTE.

source: B<-T>, B<--to> TOLIST
da: B<-T>, B<--to> TILLISTE

source: Trace calls to objects on TOLIST.
da: Registrer kald til objekter på TILLISTE.

source: Also show exits from the function calls.
da: Vis også afslutninger fra funktionskaldene.

source: Trace child processes as they are created by currently traced processes as a result of the B<fork(2)> system call.
da: Registrer underprocesser som de oprettes af registrerede processer som et resultat af B<fork(2)>-systemkaldene.

source: B<-o>, B<--output> FILENAME
da: B<-o>, B<--output> FILNAVN

source: Write output to FILENAME (or FILENAME. in case B<-f> is also used) instead of standard error.
da: Skriv resultatet til FILNAVN (eller FILNAVN. i tilfælde af at B<-f> også bruges) i stedet for standardfejl.

source: Give this help list
da: Vis denne hjælpeliste

source: Give a short usage message
da: Vis en kort brugsbesked

source: Print program version
da: Vis programversion

source: AUTHOR
da: FORFATTER

source: Written by Ulrich Drepper.
da: Skrevet af Ulrich Drepper.

source: COPYRIGHT
da: OPHAVSRET

source: Copyright \(co 2013 Free Software Foundation, Inc.
da: Ophavsret \(co 2013 Free Software Foundation, Inc.

source: This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
da: Dette er et frit program; se kildeteksten for kopieringsbetingelser. Der er INGEN garanti; ikke engang for SALGBARHED eller EGNETHED FOR ET BESTEMT FORMÅL.

source: SEE ALSO
da: SE OGSÅ
