Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/ximtoppm.1.po
Languages: pl

source: April 2, 2000
pl: 2 kwietnia 2000

source: NAME
pl: NAZWA

source: ximtoppm - convert an Xim file into a portable pixmap
pl: ximtoppm - tworzy przenośną pixmapę (.ppm) z pliku Xim

source: SYNOPSIS
pl: SKŁADNIA

source: B<ximtoppm> [B<--alphaout=>{I<alpha-filename>,B<->}] [I<ximfile>]
pl: B<ximtoppm> [B<--alphaout=>{I<nazwa-pliku-alpha>,B<->}] [I<plikxim>]

source: DESCRIPTION
pl: OPIS

source: Reads an Xim file as input.
pl: Odczytuje plik Xim.

source: Produces a portable pixmap as output. The Xim toolkit is included in the contrib tree of the X.V11R4 release.
pl: Następnie zapisuje na standardowym wyjściu przenośną pixmapę (.ppm). Pakiet Xim jest zawarty w części contrib wydania X.V11R4.

source: OPTIONS
pl: OPCJE

source: B<--alphaout=>I<alpha-filename>
pl: B<--alphaout=>I<nazwa-pliku-alpha>

source: B<ximtoppm> creates a PGM (portable graymap) file containing the alpha channel values in the input image. If the input image doesn't contain an alpha channel, the I<alpha-filename> file contains all zero (transparent) alpha values. If you don't specify B<--alphaout>, B<ximtoppm> does not generate an alpha file, and if the input image has an alpha channel, B<ximtoppm> simply discards it.
pl: B<ximtoppm> tworzy plik PGM (przenaszalna mapa odcieni szarości) zawierający wartości kanału alpha w obrazie wejściowym. Jeśli obraz wejściowy nie zawiera kanału alpha, to plik I<nazwa-pliku-alpha> będzie zawierał same zera (oznaczające przeźroczystość) jako wartości alpha. Jeśli nie poda się opcji B<--alphaout>, to B<ximtoppm> nie wygeneruje pliku alpha, a jeśli obraz wejściowy zawierał informacje o przejrzystości, to B<ximtoppm> je zignoruje.

source: If you specify B<-> as the filename, B<ximtoppm> writes the alpha output to Standard Output and discards the image.
pl: Podanie B<-> spowoduje, że B<ximtoppm> zapisze informacje alpha na standardowe wyjście i zignoruje obraz.

source: Actually, an Xim image can contain an arbitrary fourth channel -- it need not be an Alpha channel. B<ximtoppm> extracts any fourth channel it finds as described above; it doesn't matter if it is an alpha channel or not.
pl: Właściwie to obraz Xim może zawierać dowolny czwarty kanał, który nie musi być kanałem alpha. B<ximtoppm> w sposób opisany powyżej wyciąga dowolny czwarty kanał, który znajdzie; nie ma znaczenia, czy jest to kanał alpha, czy nie.

source: See B<pnmcomp>(1) for one way to use the alpha output file.
pl: Jeden ze sposobów używania pliku wyjściowego alpha jest opisany w B<pnmcomp>(1).

source: All options can be abbreviated to their shortest unique prefix.
pl: Wszystkie opcje można skrócić do ich najkrótszego unikatowego prefiksu.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AUTHOR
pl: AUTOR
