Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/xwdtopnm.1.po
Languages: pl

source: 11 January 1991
pl: 11 stycznia 1991

source: NAME
pl: NAZWA

source: xwdtopnm - convert a X11 or X10 window dump file into a portable anymap
pl: xwdtopnm - utwórz przenośną mapę (.p?m) z pliku .xwd w wersji X10 lub X11

source: SYNOPSIS
pl: SKŁADNIA

source: B<xwdtopnm> [I<xwdfile>]
pl: B<xwdtopnm> [I<plik_xwd>]

source: DESCRIPTION
pl: OPIS

source: Reads a X11 or X10 window dump file as input.
pl: Odczytuje plik .xwd (X window dump file) w wersji X10 lub X11.

source: Produces a portable anymap as output. The type of the output file depends on the input file - if it's black & white, a I<pbm> file is written, else if it's grayscale a I<pgm> file, else a I<ppm> file. The program tells you which type it is writing.
pl: Następnie zapisuje na standardowe wyjście przenośną mapę (.p?m). Rodzaj pliku wyjściowego zależy od typu pliku wejściowego. Jeżeli plik wejściowy jest czarno-biały, tworzony jest plik I<pbm>, jeżeli plik wejściowy jest w skali szarości, tworzony jest plik I<pgm>, w pozostałych przypadkach tworzony jest plik I<ppm>. Program informuje użytkownika, jaki rodzaj pliku jest tworzony.

source: Using this program, you can convert anything on an X workstation's screen into an anymap. Just display whatever you're interested in, do an xwd, run it through xwdtopnm, and then use pnmcut to select the part you want.
pl: Używając tego programu możez stworzyć przenośną mapę ze wszystkiego, co widzisz na ekranie stacji roboczej. Wystarczy wyświetlić cokolwiek, uruchomić program I<xwd>, dokonać konwersji pliku wyjściowego za pomocą I<xwdtopnm>, a następnie użyć programu I<pnmcut>, by wybrać interesujący cię fragment obrazu.

source: BUGS
pl: PROBLEMY

source: I haven't tested this tool with very many configurations, so there are probably bugs. Please let me know if you find any.
pl: Nie przeprowadziłem testów tego programu w zbyt wielu konfiguracjach, więc prawdopodobnie zawiera on błędy. Poinformuj mnie, jeżeli napotkasz jakieś problemy.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AUTHOR
pl: AUTOR
