Repository: krisfremen/manpages-l10n
Catalog: po/*/man1/zeisstopnm.1.po
Languages: pl

source: 15 June 1993
pl: 15 lipca 1993

source: NAME
pl: NAZWA

source: zeisstopnm - convert a Zeiss confocal file into a portable anymap
pl: zeisstopnm - konwertuje plik zbieżnoogniskowy Zeissa do postaci przenośnej mapy

source: SYNOPSIS
pl: SKŁADNIA

source: B<zeisstopnm> [I<-pgm> | I<-ppm>] [I<zeissfile>]
pl: B<zeisstopnm> [I<-pgm> | I<-ppm>] [I<plik_zeissa>]

source: DESCRIPTION
pl: OPIS

source: Reads a Zeiss confocal file as input. Produces a portable anymap as output. The type of the output file depends on the input file - if it's grayscale a I<pgm> file, else a I<ppm> file will be produced. The program tells you which type it is writing.
pl: Odczytuje plik zbieżnoogniskowy Zeissa i zapisuje go w postaci przenośnej mapy. Rodzaj pliku wyjściowego zależy od typu pliku wejściowego. Plik w skali szarości przetwarzany jest do formatu I<pgm> (portable greymap). W każdym innym przypadku tworzony jest plik w formacie I<ppm> (portable pixmap). Program informuje, jaki typ pliku jest tworzony.

source: OPTIONS
pl: OPCJE

source: Force the output to be a I<pgm> file.
pl: Plik wyjściowy będzie w formacie I<pgm>.

source: Force the output to be a I<ppm> file.
pl: Plik wyjściowy będzie w formacie I<ppm>.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: pnm(5)
pl: B<pnm>(5)

source: AUTHOR
pl: AUTOR
