Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man8/ipchains.8.po
Languages: es

source: Turn on kernel logging of matching packets. When this option is set for a rule, the Linux kernel will print some information of all matching packets (like most IP header fields) via I<printk>().
es: Activa el registro del núcleo de los paquetes que concuerden. Cuando esta opción está activa para una regla, el núcleo Linux imprimirá cierta información de todos los paquetes que concuerden (como la mayoría de los campos de cabeceras IP) mediante I<printk>().

source: B<-o, --output>I< [maxsize]>
es: B<-o, --output>I< [tamaño-máximo]>

source: Copy matching packets to the userspace device. This is currently mainly for developers who want to play with firewalling effects in userspace. The optional maxsize argument can be used to limit the maximum number of bytes from the packet which are to be copied. This option is only valid if the kernel has been compiled with CONFIG_IP_FIREWALL_NETLINK set.
es: Copia los paquetes al dispositivo espacio de usuario. Esto es en la actualidad principalmente para desarrolladores que quieren jugar con efectos de cortafuegos en su espacio. El argumento opcional tamaño-máximo se puede usar para limitar el máximo número de bytes del paquete que se van a copiar. Esta opción sólo es válida si el núcleo se ha compilado con CONFIG_IP_FIREWALL_NETLINK activo.

source: B<-m, --mark>I< markvalue>
es: B<-m, --mark>I< valor-marca>

source: Mark matching packets. Packets can be marked with a 32-bit unsigned value which may (one day) change how they are handled internally. If you are not a kernel hacker you are unlikely to care about this. If the string I<markvalue> begins with a + or -, then this value will be added or subtracted from the current marked value of the packet (which starts at zero).
es: Marca paquetes concordados. Los paquetes se pueden marcar con un valor entero sin signo de 32 bits que (algún día) puede cambiar su manejo interno. Si no es un "kernel hacker" no es probable que tenga que preocuparse por esto. Si la cadena I<valor-marca> empieza con + o -, este valor se añade o resta del valor actual del valor de marca de paquetes (que empieza en cero).

source: Masks used for modifying the TOS field in the IP header. When a packet matches a rule, its TOS field is first bitwise and'ed with first mask and the result of this will be bitwise xor'ed with the second mask. The masks should be specified as hexadecimal 8-bit values. As the LSB of the TOS field must be unaltered (RFC 1349), TOS values which would cause it to be altered are rejected, as are any rules which always set more than TOS bit. Rules which might set multiple TOS bits for certain packets result in warnings (sent to stdout) which can be ignored if you know that packets with those TOS values will never reach that rule. Obviously, manipulating the TOS is a meaningless gesture if the rule's target is I<DENY> or I<REJECT>.
es: Máscara usada para modificar el campo TOS de la cabecera IP. Cuando un paquete concuerda con una regla, a su campo TOS, priemero se hace un and con la primera máscara y al resultado de esto se le hace un xor con la segunda máscara. Las máscaras se tiene que especificar como valores hexadecimales de 8-bit. Como el LSB del campo TOS debe quedar inalterado (RFC 1349), los valores TOS, que hicieran que se alterase, se rechazan, como es cualquier regla que siempre ponga más que el bit TOS. Las reglas que podrían poner múltiples bits TOS para ciertos paquetes originan avisos (enviados a stdout) que se pueden ignorar si sabe que paquetes con valores TOS nuncan alcanzarán esta regla. Obviamente manipular el TOS es un gesto sin sentido si el objetivo de la regla es I<DENY> o I<REJECT>.

source: Expand numbers. Display the exact value of the packet and byte counters, instead of only the rounded number in K's (multiples of 1000) M's (multiples of 1000K) or G's (multiples of 1000M). This option is only relevant for the B<-L> command.
es: Expande números. Muestra el valor exacto de los contadores de bytes y paquetes en lugar de sólo los números redondeados en K (múltiplos de 1000) M (múltiplos de 1000K) o G (múltiplss de 1000M). Esta opción sólo es relevante para el mandato B<-L>.

source: Only match TCP packets with the SYN bit set and the ACK and FIN bits cleared. Such packets are used to request TCP connection initiation; for example, blocking such packets coming in an interface will prevent incoming TCP connections, but outgoing TCP connections will be unaffected. This option is only meaningful when the protocol type is set to TCP. If the "!" flag precedes the "-y", the sense of the option is inverted.
es: Sólo concuerda con paquetes TCP con el bit SYN activo y los bits ACK y FIN limpios. Tales paquetes se usan para las solicitudes de inicio de conexión TCP; por ejemplo, bloqueando tales paquetes entrantes en un interfaz, prevendrá las conexiones TCP, pero las conexioenes salientes no se verán afectadas. Esta opción sólo tiene sentido cuando el tipo de protocolo está como TCP. Si la bandera "!" flag precede al "-y", el sentido de la opción se invierte.

source: FILES
es: FICHEROS

source: There is no way to reset the packet and byte counters in one chain only. This is a kernel limitation.
es: No hay forma de reiniciar los contadores de paquetes y bytes en una única cadena. Es una limitación del núcleo.

source: Loop detection is not done in ipchains; packets in a loop get dropped and logged, but that's the first you'll find out about it if you inadvertantly create a loop.
es: No se realiza la detección de bucles en ipchains; los paquetes en un bucle se eliminan y se registran, pero esto será lo primero que encontrará sobre esto si accidentalmente crea un bucle.

source: The explanation of what effect marking a packet has is intentionally vague until documentation describing the new 2.1 kernel's packet scheduling routines is released.
es: La explicación de qué efectos tiene marcar un paquete es vaga intencianlamente hasta que se publique la documentación del núcleo que describe las rutinas de secuenciación de paquetes del núcleo.

source: There is no way to zero the policy counters (ie. those on the built-in chains).
es: No hay forma de poner a cero los contadores de política (i.e. las cadenas predefinidas).

source: NOTES
es: FALLOS

source: This B<ipchains> is very different from the ipfwadm by Jos Vos, as it uses the new IP firewall trees. Its functionality is a superset of ipfwadm, and there is generally a 1:1 mapping of commands. I believe the new command names are more rational. There are, however, a few changes of which you should be aware.
es: Este B<ipchains> es muy diferente al ipfwadm by Jos Vos, ya que usa los nuevos árboles de cortafuegos IP. Su funcionalidad incluye ipfwadm, y hay normalmente una aplicación 1:1 de los mandatos. Hay, sin embargo, algunos cambios con los que debería tener cuidado.

source: Fragments are handled differently. All fragments after the first used to be let through (which is usually safe); they can now be filtered. This means that you should probably add an explicit rule to accept fragments if you are converting over. Also, look for old accounting rules which check for source and destination ports of 0xFFFF (0xFF for ICMP packets) which was the old way of doing accounting on fragments.
es: Los fragmentos se manejan de diferente forma. Todos los fragmentos tras el primero usado se dejan pasar (que normalmente es seguro); ahora se pueden filtrar. Esto significa que probablemente añadirá una regla específica para aceptar fragmentos si los está convirtiendo. También busque las antiguas reglas de contabilidad que verifican los puertos origen y destino de 0xFFFF (0xFF para paquetes ICMP) que era la anterior forma de contabilizar los fragmentos.

source: Accounting rules are now simply integrated into the input and output chains; you can simulate the old behaviour like so:
es: La reglas de contabilidad ahora simplemente están integradas en las cadenas de entrada y salidad; puede simular el anterior comportamiento como:

source: This creates three user-defined chains, I<acctin>, I<acctout> and I<acctio>, which are to contain any accounting rules (these rules should be specified without a B<-j> flag, so that the packets simply pass through them unscathed).
es: Esto crea tres cadenas definidas I<acctin>, I<acctout> y I<acctio>, que son para contener cualquier regla de contabilidad (estas reglas se deberían especificar sin una bandera B<-j> para que los paquetes simplemente lo pasen sin perjudicar nada).

source: A I<MASQ> or I<REDIRECT> target encountered by the kernel out of place (ie. not during a forward or input rule respectively) will cause a message to the syslog and the packet to be dropped.
es: A I<MASQ> o I<REDIRECT> objetivos encontrados por el núcleo fuera de lugar (i.e. no durante una regla de reenvío o de entrada respectivamente) ocasionarán un mensaje a syslog y que el paquete sea descartado.

source: The old behaviour of SYN and ACK matching (which was previously ignored for non-TCP packets) has changed; the SYN option is not valid for non-TCP-specific rules.
es: El anterior comportamiento de concordancias con SYN y ACK (que era previamente ignorado para paquetes no TCP) ha cambiado; la opción SYN no es válida para reglas no específicas TCP.

source: The ACK matching option (B<-k>) is no longer supported; the combination of B<!> and B<-y> will give the equivalent).
es: La opción de concordancia ACK ( B<-k>) ya no se soporta; la combinación de B<!> y B<-y> proporcionan la equivalencia).

source: It is now illegal to specify a TOS mask which will set or alter the least significant TOS bit; previously TOS masks were silently altered by the kernel if they tried to do this.
es: Ahora es ilegal especificar una máscara TOS que acitve o modifique el bit TOS menos significativo; previamente las máscaras TOS eran modificadas silenciosamente por el núcleo si intentaban hacer esto.

source: The B<-b> flag is now handled by simply inserting or deleting a pair of rules, one with the source and destination specifications reversed.
es: La bandera B<-b> ahora se gestiona simplemente insertando o borrando un par de reglas, una con las especificaciones de origen y destino intercambiadas.

source: There is no way to specify an interface by address: use its name.
es: No hay forma de especificar un interfaz por dirección: use su nombre.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: AUTHOR
es: AUTOR
