Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man8/ipchains.8.po
Languages: es

source: February 8, 1998
es: 8 Febrero 1998

source: ipchains - IP firewall administration
es: ipchains - IP administración de cortafuegos

source: SYNOPSIS
es: SINOPSIS

source: B<ipchains -[ADC] >chain rule-specification [options]
es: B<ipchains -[ADC] >cadena especificación-de-regla [opciones]

source: B<ipchains -[RI] >chain rulenum rule-specification [options]
es: B<ipchains -[RI] >cadena numero-regla especificación-de-regla [opciones]

source: B<ipchains -D >chain rulenum [options]
es: B<ipchains -D >cadena numero-regla [opciones]

source: B<ipchains -[LFZNX] >[chain] [options]
es: B<ipchains -[LFZNX] >[cadena] [opciones]

source: B<ipchains -P >chain target [options]
es: B<ipchains -P >cadena objetivo [opciones]

source: B<ipchains -M >[ -L | -S ] [options]
es: B<ipchains -M >[ -L | -S ] [opciones]

source: DESCRIPTION
es: DESCRIPCIÓN

source: B<Ipchains> is used to set up, maintain, and inspect the IP firewall rules in the Linux kernel. These rules can be divided into 4 different categories: the IP input chain, the IP output chain, the IP forwarding chain, and user defined chains.
es: B<Ipchains> se usa para configurar, mantener e inspeccioar las reglas de cortafuegos IP del núcleo Linux. Estas reglas se pueden dividir en 4 categorías diferentes: la cadena de entrada IP, la cadena de salida IP, la cadena de reenvío IP y las cadenas definidas por el usuario.

source: For each of these categories, a separate table of rules is maintained, any of which might refer to one of the user-defined chains.
es: Para cada una de estas categorías se mantiene una tabla de reglas separada, cualquiera de las cuales podría remitir a una de las cadenas definidas por el usuario.

source: See I<ipfw>(4) for more details.
es: Váease I<ipfw>(4) para más detalles.

source: TARGETS
es: OBJETIVOS

source: A firewall rule specifies criteria for a packet, and a target. If the packet does not match, the next rule in the chain is the examined; if it does match, then the next rule is specified by the value of the target, which can be the name of a user-defined chain, or one of the special values I<ACCEPT>, I<DENY>, I<REJECT>, I<MASQ>, I<REDIRECT> or I<RETURN>.
es: Una regla de cortafuegos especifica citerios para un paquete y un objetivo. Si el paquete no concuerda se examina la siguiente regla de la cadena; si concuerda, la siguiente regla se especifica por el valor del objetivo, que puede ser el nombre de una cadena definida por el usuario o uno de los valores especiales I<ACCEPT>, I<DENY>, I<REJECT>, I<MASQ>, I<REDIRECT> o I<RETURN>.

source: I<ACCEPT> means to let the packet through. I<DENY> means to drop the packet on the floor. I<REJECT> means the same as drop, but is more polite and easier to debug, since an ICMP message is sent back to the sender indicating that the packet was dropped. (Note that I<DENY> and I<REJECT> are the same for ICMP packets).
es: I<ACCEPT> significa dejar pasar el paquete. I<DENY> significa tirar el paquete al suelo (denegar). I<REJECT> significa lo mismo que denegar, pero más educado y fácil de depurar, ya que devuelve en mensaje ICMP al remitente indicando que el paquete fue elliminado. (Observe que I<DENY> y I<REJECT> son lo mismo para paquetes ICMP).

source: I<MASQ> is only legal for the forward and user defined chains, and can only be used when the kernel is compiled with B<CONFIG_IP_MASQUERADE> defined. With this, packets will be masqueraded as if they originated from the local host. Furthermore, reverse packets will be recognized as such and they will be demasqueraded automatically, bypassing the forwarding chain.
es: I<MASQ> es sólo legal para reenvío y cadenas definidas por el usuario, y sólo se puede usar cuando el núcleo está compilado con B<CONFIG_IP_MASQUERADE> definida. Con esto, los paquetes se enmascaran como si estuvieran originados desde el host local. Más aún, los paquetes devueltos serán reconocidos y desenmascarados automáticamente y entonces pasados a la cadena de reenvío.

source: I<REDIRECT> is only lega for the input and user-defined chains and can only be used when the Linux kernel is compiled with B<CONFIG_IP_TRANSPARENT_PROXY> defined. With this, packets will be redirected to a local socket, even if they were sent to a remote host. If the specified redirection port is 0, which is the default value, the destination port of a packet will be used as the redirection port. When this target is used, an optional extra argument (the port number) can be supplied.
es: I<REDIRECT> es sólo legal para las cadenas de entrada y definidas por el usuario, y sólo se puede usar cuando en núcleo linux está compilado con B<CONFIG_IP_TRANSPARENT_PROXY> definido. Con esto, los paquetes se redirigen al socket local, incluso si son enviados a un host remoto. Si el puerto de redirección especificado es 0, que es el valor por defecto, el puerto objetivo de un paquete se usa como puerto de redirección. Cuando se usa este objetivo, se puede suministrar un argumento extra, el número de puerto.

source: If the end of a user-defined chain is reached, or a rule with target I<RETURN> is matched, then the next rule in the previous (calling) chain is examined. If the end of a builtin chain is reached, or a rule in a builtin chain with target I<RETURN> is matched, the target specified by the chain policy determines the fate of the packet.
es: Si se llega al final de una cadena definida por el usuario, o se concuerda con una regla con objetivo I<RETURN>, se examina la siguiente regla de la cadena previa (llamada). Si se llega al final de una cadena predefinida o se concuerda con una regla de la cadena predefinida con el objetivo I<RETURN> el objetivo especificado por la política de la cadena determina el destino del paquete.

source: OPTIONS
es: OPCIONES

source: The options that are recognized by B<ipchains> can be divided into several different groups.
es: Las opciones que reconoce B<ipchains> se pueden dividir en varios grupos diferentes.

source: COMMANDS
es: MANDATOS

source: These options specify the specific action to perform; only one of them can be specified on the command line, unless otherwise specified below. For all the long versions of the command and option names, you only need to use enough letters to ensure that B<ipchains> can differentiate it from all other options.
es: Estas opciones indican la acción específica que hay que realizar; sólo se puede especificar una de ellas en la línea de mandatos, salvo que más abajo se especifique lo contrario. En todas las versiones largas de los nombres de mandatos y nombres de opciones, sólo es necesario especificar suficientes letras para asegurarse de que B<ipchains> puede distinguirla de las otras opciones.

source: Append one or more rules to the end of the selected chain. When the source and/or destination names resolve to more than one address, a rule will be added for each possible address combination.
es: Añade una o más reglas al final de la cadena seleccionada. Cuando los nombres origen y/o destino se resuelven a más de una dirección, se añade una nueva regla para cada posible combinación de dirección.

source: Delete one or more rules from the selected chain. There are two versions of this command: the rule can be specified as a number in the chain (starting at 1 for the first rule) or a rule to match.
es: Elimina una o más reglas de la cadena seleccionada. Hay dos versiones de este comando: la regla se puede especificar como el número de la cadena (empezando en 1 para la primera regla) o como una regla que concuerde.

source: Replace a rule in the selected chain. If the source and/or destination names resolve to multiple addresses, the command will fail. Rules are numbered starting at 1.
es: Sustituye una regla de la cadena seleccionada. Si los nombres origen y/o destino se resuelven a múltiples direcciones, el mandato fallará. Las reglas se numeran comenzando por 1.

source: Insert one or more rules in the selected chain as the given rule number. So, if the rule number is 1, the rule or rules are inserted at the head of the chain.
es: Inserta una o más reglas en la cadena seleccionada con el número indicado de regla. Así, si la regla tiene el número 1 la regla o reglas se insertan al principio de la cadena.

source: List all rules in the selected chain. If no chain is selected, all chains are listed. It is legal to specify the B<-Z> (zero) option as well, in which case no chain may be specified. The exact output is effected by the other arguments given.
es: Muestra todas las reglas de la cadena seleccionada. Si no hay cadena seleccionada, se listan todas las cadenas. Es legal especificar la opción B<-Z> (cero) también, en cuyo caso no se puede especificar cadena. La salida exacta está determinada por los otros argumentos indicados.

source: Flush the selected chain. This is equivalent to deleting all the rules one by one.
es: Vacía la cadena seleccionada. Es equivalente a borrar todas las reglas una a una.

source: Create a new user-defined chain of the given name. There must be no target of that name already.
es: Crea una nueva cadena definida por el usuario con el nombre dado. No puede haber un objetivo con ese nombre existente.

source: Delete the specified user-defined chain. There must be no references to the chain (if there are you must delete or replace the referring rules before the chain can be deleted). If no argument is given, it will attempt to delete every non-builtin chain.
es: Borra la cadena definida por el usuario especificada. No pueden haber referencias a la cadena (si hay tiene que borrar o sustituir las referidas reglas antes de poder borrar la cadena). Si no se dan argumentos, intentará eliminar todas las cadenas no predefinidas.

source: Set the policy for the chain to the given target. See the section B<TARGETS> for the legal targets. Only non-userdefined chains can have policies, and neither built-in nor user-defined chains can be policy targets.
es: Fija la política para la cadena con un destino dado. Véase la sección B<OBJETIVOS> para los objetivos legles. Sólo las cadenas no definidas por el usuario pueden tener políticas, y ni las cadenas predefinidas ni las definidas por el usuario pueden ser objetivos de política.

source: This option allows viewing of the currently masqueraded connections (in conjunction with the B<-L> option) or to set the kernel masqerading parameters (with the B<-S> option).
es: Esta opción permite ver las conexiones enmascaradas actualmente (en conjunción con la opción B<-L>) o fija los parámetros de enmascaramiento del núcleo (con la opción B<-S>).

source: Change the timeout values used for masquerading. This command always takes 3 parameters, representing the timeout values (in seconds) for TCP sessions, TCP sessions after receiving a FIN packet, and UDP packets, respectively. A timeout value 0 means that the current timeout value of the corresponding entry is preserved. This option is only allowed in combination with the B<-M> flag.
es: Cambia los plazos de tiempo (timeouts) usados para enmascaramiento Este comando siempre toma 3 parámetros, que representan los valores de los temporizadores (en segundos) para sesiones TCP, sesiones TCP tras recibir un paquete FIN, y paquetes UDP respectivamente. Un valor de temporizador 0 significa que se conserva el valor correspondiente de la entrada. Esta opción sólo está permitida en combinación con la bandera B<-M>.

source: Check the given packet against the selected chain. This is extremely useful for testing, as the same kernel routines used to check "real" network packets are used to check this packet. It can be used to check user-defined chains as well as the builtin ones. The same arguments used to specify firewall rules are used to construct the packet to be tested. In particular, the B<-s> (source), B<-d> (destination), B<-p> (protocol), and B<-i> (interface) flags are compulsory.
es: Verifica el paquete dado con la regla seleccionada. Es extremadamente útil para comprobar, ya que se usan las mismas rutinas del núcleo para verificar paquetes "reales" se usan para verificar este paquete. Se puede usar para verificar cadenas definidas por el usuario y cadenas predefinidas. Los mismos argumentos que se usan para especificar reglas de cortafuegos son los que se usan para construir el paquete el paquete que se quiere comprobar. En particular son obligatorias las banderas B<-s> (origen), B<-d> (destino), B<-p> (protocolo) y B<-i> (interfaz).

source: Help. Give a (currently very brief) description of the command syntax.
es: Ayuda. Da una descripción (actualmente breve) de la sintaxis del mandato.

source: PARAMETERS
es: PARÁMETROS

source: The following parameters make up a rule specification (as used in the add, delete, replace, append and check commands).
es: Los siguientes parámetros afectan las especificaciones de reglas (como se usan en los mandatos add, delete, replace, append y check).

source: The protocol of the rule or of the packet to check. The specified protocol can be one of I<tcp>, I<udp>, I<icmp> or I<all>, or it can be a numeric value, representing one of these protocols or a different one. Also a protocol name from I</etc/protocols> is allowed. A "!" argument before the protocol inverts the test. The number zero is equivalent to I<all>. Protocol I<all> will match with all protocols and is taken as default when this option is omitted. I<All> may not be used in in combination with the check command.
es: El protocolo de la regla del paquete que se quiere verificar. El protocolo especificado puede ser uno de los siguientes: I<tcp>, I<udp>, I<icmp> o I<all>, o puede ser un valor numérico, que representa uno de estos protocolos u otro diferente. También está permitido un protocolo de nombre de I</etc/protocols>. Un argumento "!" antes del protocolo invierte el test. El número cero es equivalente a I<all>. Protocolo I<all> concordará con cualquier protocolo y es tomado por defecto cuando se omite esta opción. I<All> no se puede usar en combinación con el mandato check.

source: B<-s, --source >[!] I<address[/mask]> [!] [I<port[:port]>]
es: B<-s, --source >[!] I<dirección[/máscara]>] [!] [I<puerto[:puerto]>]

source: Source specification. I<Address> can be either a hostname, a network name, or a plain IP address. The I<mask> can be either a network mask or a plain number, specifying the number of 1's at the left side of the network mask. Thus, a mask of I<24> is equivalent to I<255.255.255.0>. A "!" argument before the address specification inverts the sense of the address.
es: Especificación de origen. I<Dirección> puede ser un nombre de host, un nombre de red o una simple dirección IP. La I<máscara> puede ser una máscara de red o un simple número que especifique el número de unos (1) a la izquierda en la máscara de red. Así, una máscara de I<24> es equivalente a I<255.255.255.0>. Un argumento "!" antes de la especificación de dirección invierto el sentido de la dirección.

source: The source may include a port specification or ICMP type. This can either be a service name, a port number, a numeric ICMP type, or one of the ICMP type names shown by the command B<ipchains -h icmp>. Note that many of these ICMP names refer to both a type and code, meaning that an ICMP code after the B<-d> flag is illegal. In the rest of this paragraph, a port means either a I<port> specification or an ICMP type. An inclusive range is can also be specified, using the format I<port>:I<port>. If the first port is omitted, "0" is assumed; if the last is omitted, "65535" is assumed.
es: El origen puede incluir especificaciones de puertos o tipo ICMP. Esto puede ser bien un nombre de servicio, un número de puerto, un tipo numérico ICMP o uno de los nombres de tipo ICMP mostrados por el mandato B<ipchains -h icmp>. Observe que muchos de estos nombres ICMP se refieren al tipo y código, lo que significa que un código ICMP tras la bandera B<-d> es ilegal. En el resto de este párrafo, un I<port> significa bien una especificación de puerto o un tipo ICMP. Se puede especificar un rango usando el formato I<puerto>:I<puerto>. Si se omite el primer puerto se supone "0"; si se omite el último, se supone "65535".

source: Ports may only be specified in combination with the I<tcp>, I<udp>, or I<icmp> protocols. A "!" before the port specification inverts the sense. When the check command is specified, exactly one port is required, and if the B<-f> (fragment) flag is specified, no ports are allowed. The flag B<--src> is a convenience alias for this option.
es: Los puertos se pueden especificar sólo en combinación con los protocolos I<tcp>, I<udp> o I<icmp> Un "!" antes de la especificación de puerto invierte el sentido. Cuando se especifica el mandato check, se requiere sólo un puerto, y si se especifica la bandera B<-f> (fragmento) no se permiten puertos. La bandera B<--src> es un alias para esta opción.

source: B<--source-port >[!] [I<port[:port]>]
es: B<--source-port >[!] [I<puerto[:puerto]>]

source: This allows separate specifiction of the source port or port range. See the description of the B<-s> flag above for details. The flag B<--sport> is an alias for this option.
es: Esto permite separar las especificaciones del puerto origen o rango de puertos. Véase la descripción anterior de la bandera B<-s> para más detalles. La bandera B<--sport> es un alias de esta opción.

source: B<-d, --destination >[!] I<address>[/I<mask>] [!] [I<port[:port]>]
es: B<-d, --destination >[!] I<dirección>[/I<máscara>] [!] [I<puerto[:puerto]>]

source: Destination specification. See the desciption of the B<-s> (source) flag for a detailed description of the syntax. For ICMP, which does not have ports, a "destination port" refers to the numeric ICMP code. The flag B<--dst> is a convenience alias for this option.
es: Especificación de destino. Véase la descripción de la bandera B<-s> (origen) para una detallada descripción de la sintaxis. Para ICMP, que no tiene puertos un "puerto destino" se refiere a un código numérico ICMP. La bandera B<--dst> es un alias de esta opción.

source: B<--destination-port >[!] [I<port[:port]>]
es: B<--destination-port >[!] [I<puerto[:puerto]>]

source: This allows separate specifiction of the ports. See the description of the B<-s> flag for details. The flag B<--dport> is an alias for this option.
es: Esto permite separar especificacioens de puertos. Véase la descripción de la bandera B<-s> para los detalles. la bandera B<--dport> es un alias de esta opción.

source: B<--icmp-type >[!] typename
es: B<--icmp-type >[!] nombre-de tipo

source: This allows specification of the ICMP type (use the B<-h icmp> option to see valid ICMP type names). This is often more convenient to appending it to the destination specification.
es: Esto permite especificaciones de tipo ICMP This allows specification of the ICMP type (use la opción B<-h icmp> para ver los nombres de tipo ICMP válidos). Con frecuencia es más conveniente añadirlo a las especificacones de destino.

source: B<-j, --jump >I<target>
es: B<-j, --jump >I<objetivo>

source: This specifies the target of the rule; ie. what to do if the packet matches it. The target can be a user-defined chain (not the one this rule is in) or one of the special targets which decide the fate of the packet immediately. If this option is omitted in a rule, then matching the rule will have no effect on the packet's fate, but the counters on the rule will be incremented.
es: Esto especifica el objetivo de la regla; i.e., qué hacer con el paquete si concuerda con la regla. El objetivo puede ser una cadena definida por el usuario (no en la que está la regla) o uno de los objetivos especiales que decide el destino del paquete de forma inmediata. Si omitimos esta opción en una regla, entonces la concordancia no tendrá efecto sobre el destino del paquete, pero se incremnetarán los contadores de la regla.

source: B<-i, --interface >I<[!] name>
es: B<-i, --interface >I<[!] nombre>

source: Optional name of an interface via which a packet is received, or via which is packet is going to be sent. When this option is omitted, the empty string is assumed, which has a special meaning and will match with any interface name. When the "!" argument is used before the interface name, the sense is inverted. If the interface name ends in a "+", then any interface which begins with this name will match.
es: Nombre opcional de un interfaz a través del cual se reciben los paquetes, o mediante el cual salen los paquetes se envían. Cuando se omite esta opción se supone una cadena vacía, que tiene un significado especial, y concordará con cualquier nombre de interfaz. Cuando se usa el argumento "!" antes del nombre de interfaz, se invierte el sentido. Si el nombre de interfaz termina en un "+" entonces concordará cualquier nombre de interfaz que empiece con ese nombre.

source: This means that the rule only refers to second and further fragments of fragmented packets. Since there is no way to tell the source or destination ports of such a packet (or ICMP type), such a packet will not match any rules which specify them. When the "!" argument precedes the "-f" flag, the sense is inverted.
es: Esto significa que la regla sólo se refiere al segundo o siguientes fragmentos de paquetes fragmentados. Como no hay forma de indicar los puertos origen y destino de tales paquetes (o tipo ICMP), esos paquetes, tales paquetes no verificarán ninguna regla que los especifique. Cuando el argumento "!" precede a la bandera -f, se invierte el sentido.

source: OTHER OPTIONS
es: OTRAS OPCIONES

source: The following additional options can be specified:
es: Se pueden especificar las siguientes opciones adicionales:

source: Bidirectional mode. The rule will match with IP packets in both directions; this has the same effect as repeating the rule with the source & destination reversed.
es: Modo bidireccional. La regla concordará con los paquetes IP en ambas direcciones; esto tiene los mismos efectos que repetir la regla cambiando origen y destino.

source: Verbose output. This option makes the list command show the interface address, the rule options (if any), and the TOS masks. The packet and byte counters are also listed, with the suffix 'K', 'M' or 'G' for 1000, 1,000,000 and 1,000,000,000 multipliers respectively (but see the B<-x> flag to change this). When used in combination with B<-M>, information related to delta sequence numbers will also be listed. For appending, insertion, deletion and replacement, this causes detailed information on the rule or rules to be printed.
es: Salida documentada. Esta opción hace que el mantato list muestre la driección del interfaz, las opciones de la regla (si hay) y las máscaras TOS. Los contadores también se muestran con los sufijos 'K', 'M' o 'G' para multiplicadores 1000, 1,000,000 y 1,000,000,000 respectivamente (pero vea la bandera B<-x> para cambiar esto). Cuando se usa en combinación con B<-M>, la información relativa a los núeros de secuencia delta también se mostrarán. Para añadir, insertar, borrar y sustituir, esto hace que se muestre inforamción detallada sobre la regla.

source: Numeric output. IP addresses and port numbers will be printed in numeric format. By default, the program will try to display them as host names, network names, or services (whenever applicable).
es: Salida numérica Las direcciones IP y los números de puertos se imprimirán en formato numérico. Por defecto, el programa intentará mostrarlos como nombres de hosts, nombres de redes o servicios (cuando sea aplicable).
