Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man8/ipfwadm.8.po
Languages: es

source: July 30, 1996
es: 30 Julio 1996

source: NAME
es: NOMBRE

source: ipfwadm - IP firewall and accounting administration
es: ipfwadm - Administración del cortafuegos y contabilidad IP

source: SYNOPSIS
es: SINOPSIS

source: B<ipfwadm -A >command parameters [options]
es: B<ipfwadm -A >parámetros [opciones]

source: B<ipfwadm -I >command parameters [options]
es: B<ipfwadm -I >parámetros [opciones]

source: B<ipfwadm -O >command parameters [options]
es: B<ipfwadm -O >parámetros [opciones]

source: B<ipfwadm -F >command parameters [options]
es: B<ipfwadm -F >parámetros [opciones]

source: B<ipfwadm -M >[ -l | -s ] [options]
es: B<ipfwadm -M >[-l | -s] [opciones]

source: DESCRIPTION
es: DESCRIPCIÓN

source: B<Ipfwadm> is used to set up, maintain, and inspect the IP firewall and accounting rules in the Linux kernel. These rules can be divided into 4 different categories: accounting of IP packets, the IP input firewall, the IP output firewall, and the IP forwarding firewall. For each of these categories, a separate list of rules is maintained. See I<ipfw>(4) for more details.
es: B<Ipfwadm> se utiliza para configurar, mantener e inspeccionar los cortafuegos IP y las reglas de contabilidad del núcleo Linux. Estas reglas se pueden dividir en cuatro categorías diferentes: contabilidad de paquetes IP, cortafuegos de entrada IP, cortafuegos de salida IP y cortafuegos de reenvío. Para cada una de estas categorías se mantiene una lista separada de reglas.

source: OPTIONS
es: OPCIONES

source: The options that are recognized by B<ipfwadm> can be divided into several different groups.
es: Las opciones reconocidas por I<ipfwadm> se dividen en varios grupos diferentes.

source: CATEGORIES
es: CATEGORÍAS

source: The following flags are used to select the category of rules to which the given command applies:
es: Las siguientes opciones se usan para seleccionar la categoría de reglas a las que se aplican los comandos:

source: B<-A> [I<direction>]
es: B<-A>I< [dirección]>

source: IP accounting rules. Optionally, a I<direction> can be specified (I<in>, I<out>, or I<both>), indicating whether only incoming or outgoing packets should be counted. The default direction is I<both>.
es: Reglas de contabilidad IP. Opcionalmente se puede especificar un I<sentido> (I<in>, I<out>, I<both>), indicando si sólo se deben contar paquetes de entrada, de salida o de ambos tipos. La opción por defecto es I<both>.

source: IP input firewall rules.
es: Reglas de entrada al cortafuegos IP.

source: IP output firewall rules.
es: Reglas de salida del cortafuegos IP.

source: IP forwarding firewall rules.
es: Reglas de reenvío del cortafuegos IP.

source: IP masquerading administration. This category can only be used in combination with the B<-l> (list) or B<-s> (set timeout values) command.
es: Administración de "IP masquerading". Esta categoría sólo se puede usar en combinación con el comando B<-l> (list) o el comando B<-s> (fijar tiempo de expiración).

source: Exactly one of these options has to be specified.
es: Se tiene que especificar exactamente una de estas opciones.

source: COMMANDS
es: COMANDOS

source: The next options specify the specific action to perform. Only one of them can be specified on the command line, unless something else is listed in the description.
es: Las siguientes opciones especifican la acción concreta que hay que realizar. Sólo se puede especificar una de ellas en la línea de comandos, salvo que se indique otra cosa en la descripción.

source: B<-a> [I<policy>]
es: B<-a>I< [comportamiento]>

source: Append one or more rules to the end of the selected list. For the accounting chain, no policy should be specified. For firewall chains, it is required to specify one of the following policies: I<accept>, I<deny>, I<reject>, or I<masquerade>. When the source and/or destination names resolve to more than one address, a rule will be added for each possible address combination.
es: Añade una o más reglas al final de la lista seleccionada. Para la contabilidad no se puede especificar ningún comportamiento. Para el cortafuegos es necesario especificar una de las siguientes políticas: I<accept>, I<masquerade> (válida sólo para reglas de reenvío), I<deny> o I<reject>. Cuando los nombre de origen y/o destino se resuelven con más de una dirección, se añadirá una regla para cada posible combinación.

source: B<-i> [I<policy>]
es: B<-i>I< [comportamiento]>

source: Insert one or more rules at the beginning of the selected list. See the description of the B<-a> command for more details.
es: Inserta una o más reglas al principio de la lista seleccionada. Vea la descripción del comando B<-a> para más detalles.

source: B<-d> [I<policy>]
es: B<-d>I< [comportamiento]>

source: Delete one or more entries from the selected list of rules. The semantics are equal to those of the append/insert commands. The specified parameters should exactly match the parameters given with an append or insert command, otherwise no match will be found and the rule will not be removed from the list. Only the first matching rule in the list will be deleted.
es: Borra una o más entradas al comienzo de la lista seleccionada. La semántica es idéntica a la de los comandos anteriores. Los parámetros especificados deben coincidir exactamente con los dados en los comandos añadir o insertar. En otro caso, si no se ajusta a nada, no se borrará ninguna regla. Sólo se borra la primera coincidencia.

source: List all the rules in the selected list. This command may be combined with the B<-z> (reset counters to zero) command. In that case, the packet and byte counters will be reset immediately after listing their current values. Unless the B<-x> option is present, packet and byte counters (if listed) will be shown as I<number>K or I<number>M, where 1K means 1000 and 1M means 1000K (rounded to the nearest integer value). See also the B<-e> and B<-x> flags for more capabilities.
es: Lista todas las reglas de la lista seleccionada. Este comando se puede combinar con el comando B<-z> (reiniciar el contador a cero). En ese caso los contadores de bytes y de paquetes se reinician inmediatamente tras mostrar sus valores actuales. Salvo que la opción B<-x> esté presente, los contadores de paquetes (si son listados) se mostrarán como númeroK o númeroM donde 1K significa 1000 y 1M significa 1000K (redondeado al valor entero más cercano). Vea también las opciones B<-e> y B<-x> para ver más posibilidades.

source: Reset the packet and byte counters of all the rules in selected list. This command may be combined with the B<-l> (list) command.
es: Reinicia los contadores de bytes y de paquetes de todas las reglas de la lista seleccionada. Este comando se puede combinar con el comando B<-l> (list).

source: Flush the selected list of rules.
es: Vacía la lista de reglas seleccionada.

source: B<-p>I< policy>
es: B<-p>I< política>

source: Change the default policy for the selected type of firewall. The given policy has to be one of I<accept>, I<deny>, I<reject>, or I<masquerade>. The default policy is used when no matching rule is found. This operation is only valid for IP firewalls, that is, in combination with the B<-I>, B<-O>, or B<-F> flag.
es: Cambia la política por defecto para el tipo seleccionado de cortafuegos. La política dada tiene que ser una de I<accept,> I<masquerade> (sólo válida para reglas de reenvío), I<deny> o I<reject.> La política por defecto se utiliza cuando no se encuentra ninguna regla que se ajuste. Esta operación sólo es válida para cortafuegos IP, esto es, en combinación con las opciones B<-I>, B<-O> o B<-F.>

source: Change the timeout values used for masquerading. This command always takes 3 parameters, representing the timeout values (in seconds) for TCP sessions, TCP sessions after receiving a FIN packet, and UDP packets, respectively. A timeout value 0 means that the current timeout value of the corresponding entry is preserved. This operation is only allowed in combination with the B<-M> flag.
es: Cambia los valores de caducidad (timeout) usados en el enmascaramiento. Este comando siempre toma tres parámetros, que representan valores de caducidad (en segundos) para sesiones TCP, sesiones TCP tras recibir un paquete FIN y paquetes UDP, respectivamente. Un valor de caducidad 0 significa que el valor actual de caducidad, de la entrada correspondiente, se preserva. Esta operación sólo está permitida en combinación con la opción B<-M>.

source: Check whether this IP packet would be accepted, denied, or rejected by the selected type of firewall. This operation is only valid for IP firewalls, that is, in combination with the B<-I>, B<-O>, or B<-F> flag.
es: Comprueba si este paquete IP sería aceptado, denegado o rechazado por el tipo de cortafuegos seleccionado. Esta operación sólo es válida para cortafuegos IP en combinación con las opciones B<-I>, B<-O> o B<-F>.

source: Help. Give a (currently very brief) description of the command syntax.
es: Ayuda. Da una descripción (actualmente breve) de la sintaxis del comando.

source: PARAMETERS
es: PARÁMETROS

source: B<-P >I<protocol>
es: B<-P >I<protocolo>

source: The protocol of the rule or of the packet to check. The specified protocol can be one of I<tcp>, I<udp>, I<icmp>, or I<all>. Protocol I<all> will match with all protocols and is taken as default when this option is omitted. I<All> may not be used in in combination with the check command.
es: El protocolo de la regla o del paquete a comprobar. El protocolo especificado puede ser I<tcp>, I<udp>, I<icpm> o I<all.> El protocolo I<all> se adaptará a todos los protocolos y se toma por defecto cuando se omite esta opción. I<all> no se puede usar en combinación con el comando B<-c.>

source: B<-S >I<address>[/I<mask>] [I<port> ...]
es: B<-S >I<dirección>[/I<máscara>] [I<puerto> ...]

source: Source specification (optional). I<Address> can be either a hostname, a network name, or a plain IP address. The I<mask> can be either a network mask or a plain number, specifying the number of 1's at the left side of the network mask. Thus, a mask of I<24> is equivalent with I<255.255.255.0>.
es: Especificación de origen (obligatorio). La I<dirección> puede ser bien un nombre de host, un nombre de red o una dirección IP concreta. La I<máscara> puede ser una máscara de red o un número que indique el número de bits con valor 1 a la izquierda de la máscara de red. Es decir, son equivalentes la máscara I<255.255.255.0> y el número I<24>.

source: The source may include one or more port specifications or ICMP types. Each of them can either be a service name, a port number, or a (numeric) ICMP type. In the rest of this paragraph, a I<port> means either a port specification or an ICMP type. One of these specifications may be a range of ports, in the format I<port>:I<port>. Furthermore, the total number of ports specified with the source and destination addresses should not be greater than B<IP_FW_MAX_PORTS> (currently 10). Here a port range counts as 2 ports.
es: El origen puede incluir una o más especificaciones de puertos o tipos ICMP. Cada uno de ellos puede ser un nombre de servicio, número de puerto o un tipo ICPM (numérico). En el resto de este párrafo, I<puerto> significa o una especificación de puerto o un tipo ICPM. Una de estas especificaciones puede ser un rango de puertos, con el formato I<puerto>:I<puerto>. Además, el número total de puertos especificados con las direcciones origen y destino no debe ser mayor que B<IP_FW_MAX_PORTS> (actualmente 10). Aquí un rango de puertos cuenta como dos puertos.

source: Packets not being the first fragment of a TCP, UDP, or ICMP packet are always accepted by the firewall. For accounting purposes, these second and further fragments are treated special, to be able to count them in some way. The port number 0xFFFF (65535) is used for a match with the second and further fragments of TCP or UDP packets. These packets will be treated for accounting purposes as if both their port numbers are 0xFFFF. The number 0xFF (255) is used for a match with the second and further fragments of ICMP packets. These packets will be treated for acounting purposes as if their ICMP types are 0xFF. Note that the specified command and protocol may imply restrictions on the ports to be specified. Ports may only be specified in combination with the I<tcp>, I<udp>, or I<icmp> protocol.
es: Los paquetes que no son el primer fragmento de un paquete B<TCP>, B<UDP> o B<ICMP> son siempre aceptados por el cortafuegos. Por motivos de contabilidad, estos segundos y posteriores fragmentos se tratan de forma especial para poderlos contar de alguna forma. El puerto número 0xFFFF (65535) se usa para ajustarse con el segundo y siguientes fragmentos de paquetes TCP o UDP. Estos paquetes se tratarán para propósitos de contabilidad como si sus puertos fueran 0xFFFF. El número 0xFF (255) se usa para ajustarse con el segundo y siguientes fragmentos para contabilidad de paquetes ICPM. Estos paquetes se tratarán, para propósitos de contabilidad, como si sus tipos ICPM fueran 0xFF. Observe que los comando y protocolo especificados pueden implicar restricciones sobre el puerto que sea especificado en combinación con los protocolos I<tcp>, I<udp> o I<icpm.> También, cuando se especifica el comando B<-c>, se requiere exactamente un puerto.

source: B<-D >I<address>[/I<mask>] [I<port> ...]
es: B<-D >I<dirección>[/I<máscara>] [I<puerto> ...]>

source: Destination specification (optional). See the desciption of the B<-S> (source) flag for a detailed description of the syntax, default values, and other requirements. Note that ICMP types are not allowed in combination with the B<-D> flag: ICMP types can only be specified after the the B<-S> flag.
es: Especificaciones de destino (obligatorio). Vea la descripción de la opción B<-S> (origen) para una descripción detallada de la sintaxis. Observe que los tipos B<ICMP> no están permitidos en combinación con la opción B<-D>; los tipos B<ICMP> sólo se pueden especificar tras la bandera B<-S>.

source: B<-V >I<address>
es: B<-V >I<dirección>

source: Optional address of an interface via which a packet is received, or via which is packet is going to be sent. I<Address> can be either a hostname or a plain IP address. When a hostname is specified, it should resolve to exactly one IP address. When this option is omitted, the address I<0.0.0.0> is assumed, which has a special meaning and will match with any interface address. For the check command, this option is mandatory.
es: La dirección opcional de un interfaz a través del cual se envía o recibe un paquete. I<dirección> puede ser un nombre de host o una dirección IP. Cuando se especifica un nombre de host, éste se debe resolver a exactamente una dirección IP. Cuando se omite esta opción, se supone la dirección I<0.0.0.0>, que tiene un significado especial y se ajustará a cualquier dirección de interfaz. Para el comando B<-c>, esta opción es obligatoria.

source: B<-W >I<name>
es: B<-W >I<nombre>

source: Optional name of an interface via which a packet is received, or via which is packet is going to be sent. When this option is omitted, the empty string is assumed, which has a special meaning and will match with any interface name. For the check command, this option is mandatory.
es: Nombre opcional de un interfaz a través del cual se envían o reciben paquetes. Cuando se omite, se supone una cadena de caracteres vacía, que tiene un significado especial y se ajustará a cualquier nombre de interfaz. Para el comando B<-c>, esta opción es obligatoria.

source: OTHER OPTIONS
es: OTRAS OPCIONES

source: The following additional options can be specified:
es: Se pueden especificar las siguientes opciones adicionales:

source: Bidirectional mode. The rule will match with IP packets in both directions. This option is only valid in combination with the append, insert, or delete commands.
es: Modo Bidireccional. La regla se ajustará con paquetes IP en ambas direcciones. Esta opción sólo es válida en combinación con los comandos I<-a>, I<-i> o I<-d>.

source: Extended output. This option makes the list command also show the interface address and the rule options (if any). For firewall lists, also the packet and byte counters (the default is to only show these counters for the accounting rules) and the TOS masks will be listed. When used in combination with B<-M>, information related to delta sequence numbers will also be listed. This option is only valid in combination with the list command.
es: Salida extendida. Esta opción hace al comando B<-l> mostrar también la dirección del interfaz y las opciones de la regla (si existe). Para las listas del cortafuegos, también se mostrarán los contadores de bytes y paquetes (por defecto sólo se muestran los contadores para las reglas de contabilidad) y se muestran las máscaras TOS. Cuando se usa en combinación con B<-M>, también mostrará la información relacionada con la secuencia de números delta. Esta opción sólo es válida en combinación con el comando B<-l>.

source: Masquerade packets accepted for forwarding. When this option is set, packets accepted by this rule will be masqueraded as if they originated from the local host. Furthermore, reverse packets will be recognized as such and they will be demasqueraded automatically, bypassing the forwarding firewall. This option is only valid in forwarding firewall rules with policy I<accept> (or when specifying I<accept> as default policy) and can only be used when the kernel is compiled with B<CONFIG_IP_MASQUERADE> defined.
es: Enmascaramiento de paquetes aceptados para reenvío. Cuando se utiliza esta opción, los paquetes aceptados por esta regla serán enmascarados como si fueran originales del host local. Además, los paquetes de respuesta serán reconocidos como tales y serán desenmascarados automáticamente pasando el cortafuegos de reenvío. Esta opción es sólo válida para las reglas de reenvío con comportamiento I<accept> (o cuando se haya especificado I<accept> como el comportamiento por defecto), y sólo se puede usar cuando se compila el núcleo con la opción B<CONFIG_IP_MASQUERADE>.

source: Numeric output. IP addresses and port numbers will be printed in numeric format. By default, the program will try to display them as host names, network names, or services (whenever applicable).
es: Salida numérica. Las direcciones IP y números se imprimirán en formato numérico. Por defecto, el programa intentará mostrarlos como nombres de host, nombres de red o servicios (cuando sea aplicable).

source: Turn on kernel logging of matching packets. When this option is set for a rule, the Linux kernel will print some information of all matching packets (like most IP header fields) via I<printk>(). This option will only be effective when the Linux kernel is compiled with B<CONFIG_IP_FIREWALL_VERBOSE> defined. This option is only valid in combination with the append, insert or delete command.
es: Activa el registro del núcleo de paquetes ajustados. Cuando se pone esta opción para una regla, el núcleo de Linux imprimirá cierta información básica de todos los paquetes que se ajusten a ella mediante I<printk>(). Esta opción sólo será efectiva cuando se compile el núcleo con la opción B<CONFIG_IP_FIREWALL_VERBOSE>. Esta opción sólo es válida en combinación con los comandos B<-a>, B<-i> o B<-d>.

source: B<-r >[I<port>]
es: B<-r >[I<puerto>]

source: Redirect packets to a local socket. When this option is set, packets accepted by this rule will be redirected to a local socket, even if they were sent to a remote host. If the specified redirection port is 0, which is the default value, the destination port of a packet will be used as the redirection port. This option is only valid in input firewall rules with policy I<accept> and can only be used when the Linux kernel is compiled with B<CONFIG_IP_TRANSPARENT_PROXY> defined.
es: Redirecciona paquetes a un conector (socket) local. Cuanto se utiliza esta opción, los paquetes aceptados por la regla serán redireccionados a un conector local, incluso si fueran redireccionados a un host remoto. Si el puerto redireccionado es 0, que es el valor por defecto, se usará el puerto destino del paquete como el puerto de redirección. Esta opción es sólo válida en las reglas de entrada del cortafuegos con comportamiento I<accept> y sólo puede ser utilizada cuando el núcleo de Linux está compilado con la opción B<CONFIG_IP_TRANSPARENT_PROXY>.

source: Verbose output. Print detailed information of the rule or packet to be added, deleted, or checked. This option will only have effect with the append, insert, delete, or check command.
es: Salida detallada. Imprime información detallada de la regla o paquete añadido, borrado o comprobado. Esta opción sólo tendrá efecto con los comandos B<-a>, B<-i>, B<-d> o B<-c>.

source: Expand numbers. Display the exact value of the packet and byte counters, instead of only the rounded number in K's (multiples of 1000) or M's (multiples of 1000K). This option will only have effect when the counters are listed anyway (see also the B<-e> option).
es: Expande números. Muestra el valor exacto de los contadores de bytes y de paquetes, en lugar de sólo los números redondeados a múltiplos de 1K o de 1M (múltiplo de 1000K). Esta opción sólo tendrá efecto cuando se muestren los contadores de cualquier forma (vea la opción B<-e>).

source: Only match TCP packets with the SYN bit set and the ACK bit cleared (this option will be ignored for packets of other protocols). This option is only valid in combination with the append, insert, or delete command.
es: Solo ajusta paquetes TCP con el bit SYN activado y el bit ACK desactivado. Esta opción sólo es válida en combinación con los comandos B<-a>, B<-i> o B<-d>, y el protocolo TCP.

source: FILES
es: FICHEROS

source: SEE ALSO
es: VÉASE TAMBIÉN

source: AUTHOR
es: AUTOR
