Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man8/raidstart.8.po
Languages: es

source: NAME
es: NOMBRE

source: raidstart, raidstop, - command set to manage md devices.
es: raidstart, raidstop, - conjunto de órdenes para gestionar dispositivos md.

source: SYNOPSIS
es: SINOPSIS

source: B<raidstart> [options] E<lt>raiddeviceE<gt>*
es: B<raidstart> [opciones] E<lt>dispositivoRAIDE<gt>*

source: B<raidstop> [options] E<lt>raiddeviceE<gt>*
es: B<raidstop> [opciones] E<lt>dispositivoRAIDE<gt>*

source: DESCRIPTION
es: DESCRIPCIÓN

source: RAID devices are virtual devices created from two or more real block devices. This allows multiple disks to be combined into a single filesystem, possibly with automated backup and recovery. Linux RAID devices are implemented through the md device driver.
es: Los dispositivos RAID son dispositivos virtuales creados a partir de 2 o más dispositivos de bloques reales. Esto permite combinar varios discos en un único sistema de ficheros, posiblemente con mecanismos de copia de seguridad y recuperación automáticos. Los dispositivos RAID de Linux se implementan a través del manejador (I<driver>) de dispositivos RAID.

source: If you're using the B</proc> filesystem, B</proc/mdstat> gives you informations about md devices status.
es: Si usa el sistema de ficheros B</proc>, el fichero B</proc/mdstat> le proporcionará información acerca del estado de los dispositivos md.

source: Currently, Linux supports linear md devices, RAID0 (striping), RAID1 (mirrroring), and RAID4 and RAID5. For information on the various levels of RAID, check out:
es: Actualmente, Linux soporta dispositivos md lineales, RAID0 (striping), RAID1 (mirroring), y RAID4 y RAID5. Para obtener información sobre los diferentes niveles de RAID, consulte la página

source: Avaible commands are :
es: Las órdenes disponibles son:

source: B<raidstart> : activates (starts) an existing 'persistent' md device
es: B<raidstart>: configura los dispositivos md (RAID) del núcleo, juntando varios dispositivos en uno.

source: B<raidstop> : turns off an md device, and unconfigures (stops) it
es: B<raidstop>: desactiva un dispositivo md y lo desconfigura.

source: By default, a systems RAID configuration is kept in B</etc/raidtab>, which can configure multiple RAID devices.
es: Por defecto, la configuración de un sistema RAID se mantiene en el fichero B</etc/raidtab>, que puede contener la configuración de varios dispositivos RAID.

source: All of these tools work similiarly. If B<-a> (or B<--all>) is specified, the specified operation is performed on all of the RAID devices mentioned in the configuration file. Otherwise, one or more RAID devices must be specified on the command line. For example:
es: Todas estas herramientas trabajan de forma similar. Si se especifica la opción B<-a> (o B<--all>) la operación indicada se realizará sobre todos los dispositivos RAID mencionados en el fichero de configuración. En caso contrario, se deben especificar uno o más dispositivos RAID en la línea de órdenes. Por ejemplo:

source: Starts all of the 'old' RAID0 RAID devices specified in B</etc/raidtab>. If only I</dev/md1> should be started, the following command should be used instead:
es: configura todos los dispositivos RAID especificados en B</etc/raidtab>. Si sólo se debe configurar el dispositivo I</dev/md1>, se debe usar la siguiente orden en su lugar:

source: OPTIONS
es: OPCIONES

source: Apply the command to all of the configurations specified in the config file.
es: Aplica la orden a todas las configuraciones especificadas en el fichero de configuración.

source: B<-c>, B<--configfile> I<filename>
es: B<-c>, B<--configfile> I<nombrefichero>

source: Use I<filename> as the configuration file (B</etc/raidtab> is used by default).
es: Usa I<nombrefichero> como fichero de configuración (por defecto se usa B</etc/raidtab>).

source: Displays a short usage message, then exits.
es: Muestra un breve mensaje de uso y a continuación termina.

source: Displays a short version message, then exits.
es: Muestra un breve mensaje de versión y a continuación termina.

source: NOTES
es: NOTAS

source: The raidtools are derived from the md-tools and raidtools packages, which were originally written by Marc Zyngier, Miguel de Icaza, Gadi Oxman, Bradley Ward Allen, and Ingo Molnar.
es: El paquete raidtools deriva de los paquetes md-tools y raidtools, que originalmente fueron escritos pr Marc Zyngier, Miguel de Icaza, Gadi Oxman, Bradley Ward Allen e Ingo Molnar.

source: BUGS
es: FALLOS

source: SEE ALSO
es: VÉASE TAMBIÉN
