Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man8/rdev.8.po
Languages: es

source: 20 November 1993
es: 20 Noviembre 1993

source: Linux Programmer's Manual
es: Manual del Programador de Linux

source: NAME
es: NOMBRE

source: rdev - query/set image root device, swap device, RAM disk size, or video mode
es: rdev - ver/modificar el dispositivo raíz, dispositivo de intercambio, tamaño del disco RAM o el modo de vídeo de una imagen

source: SYNOPSIS
es: SINOPSIS

source: DESCRIPTION
es: DESCRIPCIÓN

source: With no arguments, B<rdev> outputs an I</etc/mtab> line for the current root file system. With no arguments, B<swapdev>, B<ramsize>, B<vidmode>, and B<rootflags> print usage information.
es: Sin argumentos, B<rdev> imprime la línea de I</etc/mtab> con el sistema de ficheros raíz actual. Sin argumentos, B<swapdev>, B<ramsize>, B<vidmode> y B<rootflags> imprimen información sobre su uso.

source: In a bootable image for the Linux kernel, there are several pairs of bytes which specify the root device, the video mode, the size of the RAM disk, and the swap device. These pairs of bytes, by default, begin at offset 504 (decimal) in the kernel image:
es: En una imagen de arranque del kernel de Linux, hay varios pares de bytes que especifican el dispositivo raíz, el modo de vídeo, el tamaño del disco RAM y el dispositivo de intercambio. Estos pares de bytes, por defecto, empiezan en el desplazamiento 504 (decimal) en la imagen del kernel:

source: 498 Root flags (500 and 502 Reserved) 504 RAM Disk Size 506 VGA Mode 508 Root Device (510 Boot Signature)
es: 498 Opciones raíz (500 y 502 Reservados) 504 Tamaño del disco RAM 506 Modo VGA 508 Dispositivo raíz (510 Firma de Arranque)

source: B<rdev> will change these values.
es: B<rdev> cambiará estos valores.

source: Typical values for the I<image> parameter, which is a bootable Linux kernel image, are as follows:
es: Valores típicos para el parámetro I<image> , que es una imagen arrancable del kernel de Linux, son los siguientes:

source: When using the B<rdev>, or B<swapdev> commands, the I<root_device> or I<swap_device> parameter are as follows:
es: Cuando se usan los comandos B<rdev>, o B<swapdev> , los parámetros I<root_device> o I<swap_device> son como sigue:

source: For the B<ramsize> command, the B<size> parameter specifies the size of the RAM disk in kilobytes.
es: Para el comando B<ramsize>, el parámetro B<size> especifica el tamaño del disco RAM en kilobytes.

source: For the B<rootflags> command, the B<flags> parameter contains extra information used when mounting root. Currently the only effect of these flags is to force the kernel to mount the root filesystem in readonly mode if B<flags> is non-zero.
es: Para el comando B<rootflags>, el parámetro B<flags> contiene información extra usada cuando se monte la raíz. Actualmente el único efecto de esta opción es forzar al kernel a montar el sistema de ficheros raíz en modo solo lectura si B<flags> es diferente de cero.

source: For the B<vidmode> command, the B<mode> parameter specifies the video mode:
es: Para el comando B<vidmode>, el parámetro B<mode> especifica el modo de vídeo:

source: -3 = Prompt -2 = Extended VGA -1 = Normal VGA 0 = as if "0" was pressed at the prompt 1 = as if "1" was pressed at the prompt 2 = as if "2" was pressed at the prompt n = as if "n" was pressed at the prompt
es: -3 = Preguntar -2 = VGA Extendido -1 = VGA Normal 0 = como si se hubiera pulsado "0" al preguntar 1 = como si se hubiera pulsado "1" al preguntar 2 = como si se hubiera pulsado "2" al preguntar n = como si se hubiera pulsado "n" al preguntar

source: If the I<value> is not specified, the I<image> will be examined to determine the current settings.
es: Si I<value> no se especifica, la I<image> será examinada para determinar la configuración actual.

source: OPTIONS
es: OPCIONES

source: Causes B<rdev> to act like B<swapdev>.
es: Causa que B<rdev> actúe como B<swapdev>.

source: Causes B<rdev> to act like B<ramsize>.
es: Causa que B<rdev> actúe como B<ramsize>.

source: Causes B<rdev> to act like B<rootflags>.
es: Causa que B<rdev> actúe como B<rootflags>.

source: Causes B<rdev> to act like B<vidmode>.
es: Causa que B<rdev> actúe como B<vidmode>.

source: Provides help.
es: Proporciona ayuda.

source: BUGS
es: FALLOS

source: For historical reasons, there are two methods for specifying alternative values for the offset.
es: Por razones históricas, hay dos métodos para especificar valores alternativos para el desplazamiento.

source: The user interface is cumbersome, non-intuitive, and should probably be re-written from scratch, allowing multiple kernel image parameters to be changed or examined with a single command.
es: El interfaz con el usuario es engorroso, poco intuitivo y debería ser escrito de nuevo, permitiendo que varios parámetros de una imagen de kernel pudieran ser cambiados o examinados con un único comando.

source: If LILO is used, B<rdev> is no longer needed for setting the root device and the VGA mode, since these parameters that B<rdev> modifies can be set from the LILO prompt during a boot. However, B<rdev> is still needed at this time for setting the RAM disk size. Users are encouraged to find the LILO documentation for more information, and to use LILO when booting their systems.
es: Si se usa LILO, no será necesario B<rdev> para cambiar el dispositivo raíz y el modo VGA, dado que estos parámetros que B<rdev> modifica pueden ser cambiados en la línea de comandos de LILO durante el arranque. De todas maneras, B<rdev> es necesario todavía para cambiar el tamaño del disco RAM. Se aconseja a los usuarios que busquen en la documentación de LILO para más información y a usar LILO cuando arranquen su sistema.

source: AUTHORS
es: AUTORES

source: Originally by Werner Almesberger (almesber@nessie.cs.id.ethz.ch) Modified by Peter MacDonald (pmacdona@sanjuan.UVic.CA) rootflags support added by Stephen Tweedie (sct@dcs.ed.ac.uk)
es: Originalmente por Werner Almesberger (almesber@nessie.cs.id.ethz.ch) Modificado por Peter MacDonald (pmacdona@sanjuan.UVic.CA) Soporte para rootflags añadido por Stephen Tweedie (sct@dcs.ed.ac.uk)
