Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man8/rpmspec.8.po
Languages: de

source: 29 October 2010
de: 29. Oktober 2010

source: NAME
de: BEZEICHNUNG

source: rpmspec - RPM Spec Tool
de: rpmspec - Werkzeug für RPM-Spec-Dateien

source: SYNOPSIS
de: ÜBERSICHT

source: QUERYING SPEC FILES:
de: SPEC-DATEIEN ABFRAGEN:

source: B<rpmspec> {B<-q|--query>} [B<select-options>] [B<query-options>] I<SPEC_FILE>I< ...>
de: B<rpmspec> {B<-q|--query>} [B<Auswahloptionen>] [B<Abfrageoptionen>] I<SPEC-DATEI>I< …>

source: PARSING SPEC FILES TO STDOUT:
de: AUSWERTUNGSOPTIONEN FÜR DIE STANDARDAUSGABE:

source: B<rpmspec> {B<-P|--parse>} I<SPEC_FILE>I< ...>
de: B<rpmspec> {B<-P|--parse>} I<SPEC-DATEI>I< …>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<rpmspec> is a tool for querying a spec file. More specifically for querying hypothetical packages which would be created from the given spec file. So querying a spec file with B<rpmspec> is similar to querying a package built from that spec file. But is is not identical. With B<rpmspec> you can't query all fields which you can query from a built package. E. g. you can't query BUILDTIME with B<rpmspec> for obvious reasons. You also cannot query other fields automatically generated during a build of a package like auto generated dependencies.
de: B<rpmspec> ist ein Werkzeug zum Abfragen einer Spec-Datei. Genauer gesagt, zum Abfragen hypothetischer Pakete, die aus der angegebenen Spec-Datei erstellt werden würden. So ähnelt die Abfrage einer Spec-Datei mit B<rpmspec> zwar einer Abfrage eines aus dieser Spec-Datei erstellten Pakets, aber sie ist nicht identisch. Mit B<rpmspec> können Sie nicht alle Felder abfragen, die sie für ein erstelltes Paket abfragen können. Zum Beispiel können Sie aus naheliegenden Gründen BUILDTIME mit B<rpmspec> nicht abfragen. Sie können auch weitere Felder nicht abfragen, die während der Erstellung eines Pakets automatisch generiert werden, beispielsweise automatisch erzeugte Abhängigkeiten.

source: select-options
de: Auswahloptionen

source: query-options
de: Abfrageoptionen

source: [B<--qf,--queryformat >I<QUERYFMT>] [B<--target >I<TARGET_PLATFORM>]
de: [B<--qf,--queryformat >I<ABFRAGEFORMAT>] [B<--target >I<ZIELPLATTFORM>]

source: QUERY OPTIONS
de: ABFRAGEOPTIONEN

source: The general form of an rpm spec query command is
de: Die allgemeine Form eines Abfragebefehls für RPM-Spec-Dateien ist

source: B<rpm> {B<-q|--query>} [B<select-options>] [B<query-options>]
de: B<rpm> {B<-q|--query>} [B<Auswahloptionen>] [B<Abfrageoptionen>]

source: You may specify the format that the information should be printed in. To do this, you use the
de: Sie können das Format angeben, in dem die Information ausgegeben werden soll. Dafür verwenden Sie die Option

source: B<--qf|--queryformat> I<QUERYFMT>
de: B<--qf|--queryformat> I<ABFRAGEFORMAT>

source: option, followed by the I<QUERYFMT> format string. See B<rpm(8)> for details.
de: gefolgt von der Formatzeichenkette I<ABFRAGEFORMAT>. Siehe B<rpm>(8) für Details.

source: SELECT OPTIONS
de: AUSWAHLOPTIONEN

source: B<--rpms> Operate on the all binary package headers generated from spec. B<--builtrpms> Operate only on the binary package headers of packages which would be built from spec. That means ignoring package headers of packages that won't be built from spec i. e. ignoring package headers of packages without file section. B<--srpm> Operate on the source package header(s) generated from spec.
de: B<--rpms> wertet die Header aller Binärpakete aus, die aus dieser Spec-Datei erstellt werden. B<--builtrpms> wertet nur die Header der Binärpakete aus, die aus dieser Spec-Datei erstellt werden würden. Das bedeutet, dass die Header der Pakete ignoriert werden, die nicht aus dieser Spec-Datei erstellt werden, das heißt, die Pakete, die keinen B<files>-Abschnitt haben. B<--srpm> wertet die Header des Quellpakets oder der Quellpakete aus, die aus der Spec-Datei erstellt werden.

source: EXAMPLES
de: BEISPIELE

source: Get list of binary packages which would be generated from the rpm spec file:
de: Eine Liste der Binärpakete ausgeben, die aus der RPM-Spec-Datei erstellt werden würden:

source: Get summary infos for single binary packages generated from the rpm spec file:
de: Zusammenfassende Informationen zu den einzelnen Binärpaketen ausgeben, die aus der RPM-Spec-Datei erstellt werden würden:

source: Get the source package which would be generated from the rpm spec file:
de: Das Quellpaket ausgeben, das aus der RPM-Spec-Datei erstellt werden würde:

source: Parse the rpm spec file to stdout:
de: Die RPM-Spec-Datei auswerten und in die Standardausgabe schreiben:

source: SEE ALSO
de: SIEHE AUCH

source: B<rpmspec --help> - as rpm supports customizing the options via popt aliases it's impossible to guarantee that what's described in the manual matches what's available.
de: B<rpmspec --help> - da B<rpm> benutzerdefinierte Optionen über Popt-Aliase unterstützt, können wir unmöglich garantieren, dass die Beschreibungen in diesem Handbuch exakt dem entsprechen, was verfügbar ist.

source: AUTHORS
de: AUTOREN

source: \f[B]rpmspec\f[R] {\f[B]-q|--query\f[R]} [\f[B]select-options\f[R]] [\f[B]query-options\f[R]] \f[I]SPEC_FILE ...\fR
de: \f[B]rpmspec\f[R] {\f[B]-q|--query\f[R]} [\f[B]Auswahloptionen\f[R]] [\f[B]Abfrageptionen\f[R]] \f[I]SPEC-DATEI …\fR

source: \f[B]rpmspec\f[R] {\f[B]-P|--parse\f[R]} \f[I]SPEC_FILE ...\fR
de: \f[B]rpmspec\f[R] {\f[B]-P|--parse\f[R]} \f[I]SPEC-DATEI …\fR

source: \f[B]rpmspec\f[R] is a tool for querying a spec file. More specifically for querying hypothetical packages which would be created from the given spec file. So querying a spec file with \f[B]rpmspec\f[R] is similar to querying a package built from that spec file. But is is not identical. With \f[B]rpmspec\f[R] you can\[aq]t query all fields which you can query from a built package. E. g. you can\[aq]t query BUILDTIME with \f[B]rpmspec\f[R] for obvious reasons. You also cannot query other fields automatically generated during a build of a package like auto generated dependencies.\fR
de: \f[B]rpmspec\f[R] ist ein Werkzeug zum Abfragen einer Spec-Datei. Genauer gesagt, zum Abfragen hypothetischer Pakete, die aus der angegebenen Spec-Datei erstellt werden würden. So ähnelt die Abfrage einer Spec-Datei mit \f[B]rpmspec\f[R] zwar einer Abfrage eines aus dieser Spec-Datei erstellten Pakets, aber sie ist nicht identisch. Mit \f[B]rpmspec\f[R] können Sie nicht alle Felder abfragen, die sie für ein erstelltes Paket abfragen können. Zum Beispiel können Sie aus naheliegenden Gründen BUILDTIME mit \f[B]rpmspec\f[R] nicht abfragen. Sie können auch weitere Felder nicht abfragen, die während der Erstellung eines Pakets automatisch generiert werden, beispielsweise automatisch erzeugte Abhängigkeiten.

source: [\f[B]--qf,--queryformat \f[I]QUERYFMT\f[R]] [\f[B]--target \f[I]TARGET_PLATFORM\f[R]]\fR
de: [\f[B]--qf,--queryformat \f[I]ABFRAGEFORMAT\f[R]] [\f[B]--target \f[I]ZIELPLATTFORM\f[R]]\fR

source: \f[B]rpm\f[R] {\f[B]-q|--query\f[R]} [\f[B]select-options\f[R]] [\f[B]query-options\f[R]]\fR
de: \f[B]rpm\f[R] {\f[B]-q|--query\f[R]} [\f[B]Auswahloptionen\f[R]] [\f[B]Abfrageptionen\f[R]]\fR

source: You may specify the format that the information should be printed in. To do this, you use the
de: Sie können das Format angeben, in dem die Information ausgegeben werden soll. Dafür verwenden Sie die Option

source: \f[B]--qf|--queryformat\f[R] \f[I]QUERYFMT\fR
de: \f[B]--qf|--queryformat\f[R] \f[I]ABFRAGEFORMAT\fR

source: option, followed by the \f[I]QUERYFMT\f[R] format string. See \f[B]rpm(8)\f[R] for details.\fR
de: gefolgt von der Formatzeichenkette \f[I]ABFRAGEFORMAT\f[R]. Siehe \f[B]rpm(8)\f[R] für Details.\fR

source: \f[B]--rpms\f[R] Operate on the all binary package headers generated from spec. \f[B]--builtrpms\f[R] Operate only on the binary package headers of packages which would be built from spec. That means ignoring package headers of packages that won\[aq]t be built from spec i. e. ignoring package headers of packages without file section. \f[B]--srpm\f[R] Operate on the source package header(s) generated from spec.\fR
de: \f[B]--rpms\f[R] wertet die Header aller Binärpakete aus, die aus dieser Spec-Datei erstellt werden. \f[B]--builtrpms\f[R] wertet nur die Header der Binärpakete aus, die aus dieser Spec-Datei erstellt werden würden. Das bedeutet, dass die Header der Pakete ignoriert werden, die nicht aus dieser Spec-Datei erstellt werden, das heißt, die Pakete, die keinen B<files>-Abschnitt haben. \f[B]--srpm\f[R] wertet die Header des Quellpakets oder der Quellpakete aus, die aus der Spec-Datei erstellt werden.\fR

source: \f[C]Get summary infos for single binary packages generated from the rpm spec file:\fR
de: \f[C]Zusammenfassende Informationen zu den einzelnen Binärpaketen ausgeben, die aus der RPM-Spec-Datei erstellt werden würden:\fR

source: \f[C]Get the source package which would be generated from the rpm spec file:\fR
de: \f[C]Das Quellpaket ausgeben, das aus der RPM-Spec-Datei erstellt werden würde:\fR

source: \f[C]Parse the rpm spec file to stdout:\fR
de: \f[C]Die RPM-Spec-Datei auswerten und in die Standardausgabe schreiben:\fR

source: \f[B]rpmspec --help\f[R] - as rpm supports customizing the options via popt aliases it\[aq]s impossible to guarantee that what\[aq]s described in the manual matches what\[aq]s available.\fR
de: \f[B]rpmspec --help\f[R] - da \f[B]rpm\f[R] benutzerdefinierte Optionen über Popt-Aliase unterstützt, können wir unmöglich garantieren, dass die Beschreibungen in diesem Handbuch exakt dem entsprechen, was verfügbar ist.\fR
