Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/binkdlogstat.8.po
Languages: de

source: July 2005
de: Juli 2005

source: NAME
de: BEZEICHNUNG

source: Binkdlogstat - binkd log analyser and statistic generator
de: Binkdlogstat - analysiert das Binkd-Protokoll und erstellt Statistiken

source: SYNOPSYS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: B<binkdlogstat> is a program which generates reports of the activity of the binkd daemon. It analyzes binkd log files and prints to stdout a formatted report with the following information for each node:
de: B<Binkdlogstat> erzeugt Berichte über die Arbeit des B<binkd>(8)-Daemons . Das Programm analysiert B<binkd>(8)-Protokolldateien und gibt einen formatierten Bericht auf der Standardausgabe aus. Für jeden Knoten sind die folgenden Informationen enthalten:

source: - number of successful incoming sessions
de: - Anzahl der erfolgreichen eingehenden Sitzungen

source: - number of failed incoming sessions
de: - Anzahl der fehlgeschlagenen eingehenden Sitzungen

source: - number of successful outgoing sessions
de: - Anzahl der erfolgreichen ausgehenden Sitzungen

source: - number of failed outgoing sessions
de: - Anzahl der fehlgeschlagenen ausgehenden Sitzungen

source: - outgoing traffic in bytes
de: - ausgehender Verkehr in Byte

source: - incoming traffic in bytes
de: - eingehender Verkehr in Byte

source: - number of sent files
de: - Anzahl gesendeter Dateien

source: - number of received files
de: - Anzahl empfangener Dateien

source: - average CPS with node
de: - durchschnittliche CPS pro Knoten

source: It also provides total information for these categories for the log file.
de: Außerdem stellt es auch Gesamtzahlen für diese Kategorien für die Protokolldatei bereit.

source: B<binkdlogstat> uses stdin as a source and stdout as a result file, so it can be used as a filter.
de: B<Binkdlogstat> verwendet die Standardeingabe als Quelle und die Standardausgabe als Ergebnisdatei. Daher kann es als Filter eingesetzt werden.

source: SEE ALSO
de: SIEHE AUCH

source: binkd(8)
de: B<binkd>(8)

source: AUTHOR
de: AUTOR

source: Binkdlogstat was written by Pavel Gulchouck E<lt>gul@lucky.netE<gt> 2:463/68
de: B<Binkdlogstat> wurde von Pavel Gulchouck E<lt>gul@lucky.netE<gt> 2:463/68 geschrieben.

source: This manual page was written by Kaliuta Yauheni E<lt>y.kaliuta@gmail.comE<gt>
de: Diese Handbuchseite erstellte Kaliuta Yauheni E<lt>y.kaliuta@gmail.comE<gt>.

source: This is free documentation; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.
de: Dieses Handbuch ist Freie Dokumentation. Sie können es unter den Bedingungen der GNU General Public License in der von der Free Software Foundation veröffentlichten Fassung weiterverteilen. Dabei haben Sie die Wahl zwischen der Version 2 der Lizenz oder irgendeiner späteren Version.
