Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/lsblk.8.po
Languages: pl

source: February 2013
pl: luty 2013

source: System Administration
pl: Administracja systemem

source: NAME
pl: NAZWA

source: lsblk - list block devices
pl: lsblk - wypisuje urządzenia blokowe

source: SYNOPSIS
pl: SKŁADNIA

source: B<lsblk> [options] [I<device>...]
pl: B<lsblk> [I<opcje>] [I<urządzenie>...]

source: DESCRIPTION
pl: OPIS

source: B<lsblk> lists information about all available or the specified block devices. The B<lsblk> command reads the B<sysfs> filesystem and B<udev db> to gather information.
pl: B<lsblk> wypisuje informacje o wszystkich dostępnych lub podanych urządzeniach blokowych. Polecenie B<lsblk> odczytuje system plików B<sysfs> i B<udev db> w celu zebrania informacji.

source: The command prints all block devices (except RAM disks) in a tree-like format by default. Use B<lsblk --help> to get a list of all available columns.
pl: Domyślnie polecenie wypisuje informacje o wszystkich urządzeniach (z wyjątkiem dysków RAM) w formacie przypominającym drzewo. Za pomocą B<lsblk --help> można uzyskać listę dostępnych kolumn.

source: The default output, as well as the default output from options like B<--fs> and B<--topology>, is subject to change. So whenever possible, you should avoid using default outputs in your scripts. Always explicitly define expected columns by using B<--output> I<columns-list> in environments where a stable output is required.
pl: Domyślny wynik, jak również domyślny wynik z opcji takich jak B<--fs> i B<--topology> może ulec zmianie. Gdy to tylko możliwe należy unikać używania domyślnych wyników w swoich skryptach. Proszę zawsze jawnie określać oczekiwane kolumny opcją B<--output> I<lista> w środowiskach wymagającego stabilnego wyniku.

source: Note that B<lsblk> might be executed in time when B<udev> does not have all information about recently added or modified devices yet. In this case it is recommended to use B<udevadm settle> before lsblk to synchronize with udev.
pl: Proszę zauważyć, że B<lsblk> może być wykonane w momencie, gdy B<udev> nie ma jeszcze wszystkich informacji o ostatnio dodanych lub zmodyfikowanych urządzeniach. W takim przypadku zaleca się użycie najpierw B<udevadm settle>, aby dokonać synchronizacji z udev.

source: OPTIONS
pl: OPCJE

source: Also list empty devices. (By default they are skipped.)
pl: Wypisuje również puste urządzenia (domyślnie są pomijane).

source: Print the SIZE column in bytes rather than in a human-readable format.
pl: Wypisuje kolumnę SIZE w bajtach zamiast w formacie czytelnym dla ludzi.

source: Print information about the discarding capabilities (TRIM, UNMAP) for each device.
pl: Wypisuje informacje o funkcjach "discard" (TRIM, UNMAP) przy każdym urządzeniu.

source: Do not print holder devices or slaves. For example, B<lsblk --nodeps /dev/sda> prints information about the sda device only.
pl: Nie wypisuje urządzeń nadrzędnych ani podrzędnych. Przykładowo B<lsblk --nodeps /dev/sda> wypisze informacje tylko o urządzeniu sda.

source: B<-e>,B< --exclude >I<list>
pl: B<-e>, B<--exclude >I<lista>

source: Exclude the devices specified by the comma-separated I<list> of major device numbers. Note that RAM disks (major=1) are excluded by default. The filter is applied to the top-level devices only.
pl: Pomija urządzenia podane w I<liście> urządzeń określonych głównymi numerami urządzeń i oddzielonych przecinkami. Domyślnie pomijane są dyski RAM (główny numer urządzenia równy 1). Filtr ma zastosowanie jedynie do urządzeń najwyższego poziomu.

source: Output info about filesystems. This option is equivalent to B<-o\ NAME,FSTYPE,LABEL,UUID,MOUNTPOINT>. The authoritative information about filesystems and raids is provided by the B<blkid>(8) command.
pl: Wypisuje informacje o systemach plików. Jest to odpowiednik B<-o NAME,FSTYPE,LABEL,UUID,MOUNTPOINT>. Pełne informacje o systemach plików i macierzach RAID są udostępniane przez polecenie B<blkid>(8).

source: Display help text and exit.
pl: Wyświetla pomoc i wychodzi.

source: B<-I>,B< --include >I<list>
pl: B<-I>,B< --include >I<lista>

source: Include devices specified by the comma-separated I<list> of major device numbers. The filter is applied to the top-level devices only.
pl: Obejmuje urządzenia podane w I<liście> urządzeń określonych głównymi numerami urządzeń i oddzielonych przecinkami. Filtr ma zastosowanie jedynie do urządzeń najwyższego poziomu.

source: Use ASCII characters for tree formatting.
pl: Do formatowania drzewa używa znaków ASCII.

source: Use JSON output format.
pl: Używa formatu wyjściowego JSON.

source: Produce output in the form of a list.
pl: Wynikowa postać ma formę listy.

source: Output info about device owner, group and mode. This option is equivalent to B<-o\ NAME,SIZE,OWNER,GROUP,MODE>.
pl: Wypisuje informacje o posiadaczu, grupie i trybie urządzenia. Jest to odpowiednik B<-o NAME,SIZE,OWNER,GROUP,MODE>.

source: Do not print a header line.
pl: Nie wypisuje nagłówka.

source: B<-o>,B< --output >I<list>
pl: B<-o>,B< --output >I<lista>

source: Specify which output columns to print. Use B<--help> to get a list of all supported columns.
pl: Określa wypisywane kolumny. Ich listę można poznać podając opcję B<--help>.

source: The default list of columns may be extended if I<list> is specified in the format I<+list> (e.g. B<lsblk -o +UUID>).
pl: Domyślna listę kolumn można rozszerzyć, jeśli I<listę> poda się w formacie B<+>I<lista> (np. B<lsblk -o +UUID>).

source: Output all available columns.
pl: Wypisuje wszystkie domyślne kolumny.

source: Produce output in the form of key="value" pairs. All potentially unsafe characters are hex-escaped (\exE<lt>codeE<gt>).
pl: Produkuje wynik w formie par klucz="wartość". Wszystkie potencjalnie niebezpieczne znaki są cytowane szesnastkowo (\exE<lt>kodE<gt>).

source: Print full device paths.
pl: Wypisuje pełne ścieżki urządzeń.

source: Produce output in raw format. All potentially unsafe characters are hex-escaped (\exE<lt>codeE<gt>) in the NAME, KNAME, LABEL, PARTLABEL and MOUNTPOINT columns.
pl: Produkuje wynik w formacie surowym. Wszystkie potencjalnie niebezpieczne znaki są cytowane szesnastkowo (\exE<lt>kodE<gt>) w kolumnach NAME, KNAME, LABEL, PARTLABEL i MOUNTPOINT.

source: Output info about SCSI devices only. All partitions, slaves and holder devices are ignored.
pl: Wypisuje informacje jedynie o urządzeniach SCSI. Wszystkie partycje, urządzenia podrzędne i kieszenie na urządzenia są ignorowane.

source: Print dependencies in inverse order.
pl: Wypisuje zależności w odwróconej kolejności.

source: Output info about block-device topology. This option is equivalent to B<-o\ NAME,ALIGNMENT,MIN-IO,OPT-IO,PHY-SEC,LOG-SEC,ROTA,SCHED,RQ-SIZE,RA,WSAME>.
pl: Wypisuje informacje o topologii urządzeń blokowych. Jest to odpowiednik B<-o NAME,ALIGNMENT,MIN-IO,OPT-IO,PHY-SEC,LOG-SEC,ROTA,SCHED,RQ-SIZE,RA,WSAME>.

source: Display version information and exit.
pl: Wypisuje informację o wersji programu i wychodzi.

source: B<-x>,B< --sort >I<column>
pl: B<-x>,B< --sort >I<kolumna>

source: Sort output lines by I<column>.
pl: Sortuje wiersze wyjściowe wg I<kolumny>.

source: NOTES
pl: UWAGI

source: For partitions, some information (e.g. queue attributes) is inherited from the parent device.
pl: W przypadku partycji część informacji (np. atrybuty kolejki) jest dziedziczona z urządzenia nadrzędnego.

source: The B<lsblk> command needs to be able to look up each block device by major:minor numbers, which is done by using B</sys/dev/block>. This sysfs block directory appeared in kernel 2.6.27 (October 2008). In case of problems with a new enough kernel, check that CONFIG_SYSFS was enabled at the time of the kernel build.
pl: Polecenie B<lsblk> musi być w stanie odszukać każde urządzenie blokowe przez nr-główny:nr-poboczny (major:minor), co jest dokonywane za pomocą I</sys/dev/block>. Ten katalog urządzeń blokowych sysfs pojawił się w wersji jądra 2.6.27 (październik 2008). Jeśli z tak odpowiednio nowym jądrem występują problemy, proszę sprawdzić, czy jądro zbudowano z włączoną opcją CONFIG_SYSFS.

source: RETURN CODES
pl: KODY ZAKOŃCZENIA

source: success
pl: sukces

source: failure
pl: niepowodzenie

source: not found all specified devices
pl: nie znaleziono wszystkich podanych urządzeń

source: some specified devices found, some not found
pl: znaleziono jedynie część podanych urządzeń

source: AUTHORS
pl: AUTORZY

source: ENVIRONMENT
pl: ŚRODOWISKO

source: enables libblkid debug output.
pl: włącza wyjście debugowania libblkid.

source: enables libmount debug output.
pl: włącza wyjście debugowania libmount.

source: enables libsmartcols debug output.
pl: włącza wyjście debugowania libsmartcols.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: The lsblk command is part of the util-linux package and is available from ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
pl: Polecenie lsblk jest częścią pakietu util-linux i jest dostępne pod adresem ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
