Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/modprobe.8.po
Languages: pl

source: NAME
pl: NAZWA

source: modprobe - Add and remove modules from the Linux Kernel
pl: modprobe - dodaje i usuwa moduły z jądra Linux

source: SYNOPSIS
pl: SKŁADNIA

source: B<modprobe> [B<-v>] [B<-V>] [B<-C\ >I<config-file>] [B<-n>] [B<-i>] [B<-q>] [B<-b>] [I<modulename>] [I<module\ parameters>...]
pl: B<modprobe> [B<-v>] [B<-V>] [B<-C\ >I<plik-konfiguracyjny>] [B<-n>] [B<-i>] [B<-q>] [B<-b>] [I<nazwa-modułu>] [I<moduł\ parametry>...]

source: B<modprobe> [-r] [B<-v>] [B<-n>] [B<-i>] [I<modulename>...]
pl: B<modprobe> [-r] [B<-v>] [B<-n>] [B<-i>] [I<nazwa-modułu>...]

source: B<modprobe> [--dump-modversions] [I<filename>]
pl: B<modprobe> [--dump-modversions] [I<nazwa-pliku>]

source: DESCRIPTION
pl: OPIS

source: B<modprobe> intelligently adds or removes a module from the Linux kernel: note that for convenience, there is no difference between _ and - in module names (automatic underscore conversion is performed)\&. B<modprobe> looks in the module directory /lib/modules/`uname -r` for all the modules and other files, except for the optional configuration files in the /etc/modprobe\&.d directory (see B<modprobe.d>(5))\&. B<modprobe> will also use module options specified on the kernel command line in the form of E<lt>moduleE<gt>\&.E<lt>optionE<gt> and blacklists in the form of modprobe\&.blacklist=E<lt>moduleE<gt>\&.
pl: B<modprobe> dodaje i usuwa moduły z jądra Linux w sposób inteligentny: proszę zauważyć, że dla wygody nie rozróżnia się _ i - w nazwach modułów (przeprowadzana jest automatyczna konwersja znaków podkreślenia)\&. B<modprobe> szuka wszystkich modułów i innych plików w katalogu modułów /lib/modules/`uname -r`. Wyjątkami są opcjonalne pliki konfiguracyjne w katalogu /etc/modprobe\&.d (patrz B<modprobe.conf>(5))\&. B<modprobe> użyje również opcji modułu podanych w wierszu polecenia jądra w postaci E<lt>modułE<gt>\&.E<lt>opcjaE<gt> i czarnych list w postaci modprobe\&.blacklist=E<lt>modułE<gt>\&.

source: Note that unlike in 2\&.4 series Linux kernels (which are not supported by this tool) this version of B<modprobe> does not do anything to the module itself: the work of resolving symbols and understanding parameters is done inside the kernel\&. So module failure is sometimes accompanied by a kernel message: see B<dmesg>(8)\&.
pl: Proszę zauważyć, że w przeciwieństwie do jąder Linux z gałęzi 2\&.4 (które nie są obsługiwane przez to narzędzie) ta wersja B<modprobe> nic nie wykonuje na samych modułach: interpretowanie symboli i obsługa parametrów jest wykonywana wewnątrz jądra\&. W związku z tym, błędom modułów towarzyszą niekiedy komunikaty jądra: patrz B<dmesg>(8)\&.

source: B<modprobe> expects an up-to-date modules\&.dep\&.bin file as generated by the corresponding B<depmod> utility shipped along with B<modprobe> (see B<depmod>(8))\&. This file lists what other modules each module needs (if any), and B<modprobe> uses this to add or remove these dependencies automatically\&.
pl: B<modprobe> oczekuje obecności zaktualizowanego pliku modules\&.dep\&.bin utworzonego przez powiązane narzędzie B<depmod>, dystrybuowane razem z B<modprobe> (patrz B<depmod>(8))\&. Dla każdego modułu plik ten posiada spis innych modułów jakich (jeśli jest taka potrzeba) wymaga dany moduł, a B<modprobe> używa jej do automatycznego dodawania lub usuwania tych zależności\&.

source: If any arguments are given after the I<modulename>, they are passed to the kernel (in addition to any options listed in the configuration file)\&.
pl: Jeśli po I<nazwie-modułu> podano argumenty, są one przekazywane jądru (oprócz ewentualnych opcji umieszczonych w pliku konfiguracyjnym)\&.

source: OPTIONS
pl: OPCJE

source: Insert all module names on the command line\&.
pl: Ładuje wszystkie moduły podane w wierszu polecenia\&.

source: This option causes B<modprobe> to apply the B<blacklist> commands in the configuration files (if any) to module names as well\&. It is usually used by B<udev>(7)\&.
pl: Opcja powoduje zastosowanie przez B<modprobe> poleceń B<blacklist> z plików konfiguracyjnych (jeśli występują) także do nazw modułów\&. Jest ona używana z reguły przez B<udev>(7)\&.

source: This option overrides the default configuration directory (/etc/modprobe\&.d)\&.
pl: Opcja przesłania domyślny katalog konfiguracyjny (/etc/modprobe\&.d)\&.

source: This option is passed through B<install> or B<remove> commands to other B<modprobe> commands in the MODPROBE_OPTIONS environment variable\&.
pl: Poprzez opcje B<install> i B<remove>, opcja jest podawana innym poleceniom B<modprobe> w zmiennej środowiskowej MODPROBE_OPTIONS\&.

source: Dump out the effective configuration from the config directory and exit\&.
pl: Zrzuca efektywną konfigurację z katalogu konfiguracyjnego i wychodzi\&.

source: Print out a list of module versioning information required by a module\&. This option is commonly used by distributions in order to package up a Linux kernel module using module versioning deps\&.
pl: Wypisuje listę informacji o wersjach modułów wymaganych przez moduł\&. Opcja jest używana przeważnie przez dystrybucje, aby spakietować moduł jądra Linux, używając zależności uwzględniających wersje modułu.

source: Root directory for modules, / by default\&.
pl: Główny katalog dla modułów, domyślnie "/".

source: Normally, B<modprobe> will succeed (and do nothing) if told to insert a module which is already present or to remove a module which isn\*(Aqt present\&. This is ideal for simple scripts; however, more complicated scripts often want to know whether B<modprobe> really did something: this option makes modprobe fail in the case that it actually didn\*(Aqt do anything\&.
pl: B<modprobe> zwykle kończy pracę pomyślnie (nic nie robiąc) jeśli poleci się mu załadować moduł, który jest już obecny lub usunąć moduł, który nie jest obecny. To dobre rozwiązanie do prostych skryptów, jednak bardziej skomplikowane chcą się często dowiedzieć, czy B<modprobe> tak naprawdę coś zrobił: ta opcja powoduje, że modprobe kończy pracę z niepowodzeniem, jeśli program faktycznie nic nie wykonuje.

source: Every module contains a small string containing important information, such as the kernel and compiler versions\&. If a module fails to load and the kernel complains that the "version magic" doesn\*(Aqt match, you can use this option to remove it\&. Naturally, this check is there for your protection, so this using option is dangerous unless you know what you\*(Aqre doing\&.
pl: Każdy moduł zawiera niewielki łańcuch z ważnymi informacjami obejmującymi np. wersje jądra i kompilatora\&. Jeśli nie uda się załadować modułu, a jądro poinformuje że "version magic" nie pasuje, można użyć tej opcji do usunięcia go. Oczywiście to sprawdzenie odbywa się dla ochrony użytkownika, więc użycie niniejszej opcji jest niebezpieczne, chyba że jest się pewnym tego, co się robi.

source: This applies to any modules inserted: both the module (or alias) on the command line and any modules on which it depends\&.
pl: Opcja odnosi się do wszystkich załadowanych modułów: zarówno modułu (lub aliasu) z wiersza polecenia, jak i do modułów od których jest on zależny\&.

source: When modules are compiled with CONFIG_MODVERSIONS set, a section detailing the versions of every interfaced used by (or supplied by) the module is created\&. If a module fails to load and the kernel complains that the module disagrees about a version of some interface, you can use "--force-modversion" to remove the version information altogether\&. Naturally, this check is there for your protection, so using this option is dangerous unless you know what you\*(Aqre doing\&.
pl: Jeśli moduły są skompilowane z ustawieniem CONFIG_MODVERSIONS, tworzona jest sekcja nt. szczegółów wersji każdego modułu użytego przez (lub udostępnianego) przez dany moduł\&. Jeśli nie powiedzie się załadowanie modułu, a jądro poinformuje że nie zgadza się wersja któregoś z modułu będącego interfejsem, można użyć "--force-modversion" aby usunąć również informację o wersji\&. Oczywiście to sprawdzenie odbywa się dla ochrony użytkownika, więc użycie niniejszej opcji jest niebezpieczne, chyba że jest się pewnym tego, co się robi.

source: This applies any modules inserted: both the module (or alias) on the command line and any modules on which it depends\&.
pl: Opcja odnosi się do wszystkich załadowanych modułów: zarówno modułu (lub aliasu) z wiersza polecenia, jak i do modułów od których jest on zależny\&.

source: Try to strip any versioning information from the module which might otherwise stop it from loading: this is the same as using both B<--force-vermagic> and B<--force-modversion>\&. Naturally, these checks are there for your protection, so using this option is dangerous unless you know what you are doing\&.
pl: Próbuje wyciąć z modułu wszystkie informacje o wersji, które mogą spowodować jego niepomyślne załadowanie: jest to odpowiednik użycia obu opcji B<--force-vermagic> i B<--force-modversion>\&. Oczywiście to sprawdzenie odbywa się dla ochrony użytkownika, więc użycie niniejszej opcji jest niebezpieczne, chyba że jest się pewnym tego, co się robi.

source: This applies to any modules inserted: both the module (or alias) on the command line and any modules it on which it depends\&.
pl: Opcja odnosi się do wszystkich załadowanych modułów: zarówno modułu (lub aliasu) z wiersza polecenia, jak i do modułów od których jest on zależny\&.

source: This option causes B<modprobe> to ignore B<install> and B<remove> commands in the configuration file (if any) for the module specified on the command line (any dependent modules are still subject to commands set for them in the configuration file)\&. Both B<install> and B<remove> commands will currently be ignored when this option is used regardless of whether the request was more specifically made with only one or other (and not both) of B<--ignore-install> or B<--ignore-remove>\&. See B<modprobe.d>(5)\&.
pl: Opcja powoduje ignorowanie przez B<modprobe> poleceń B<install> i B<remove> w pliku konfiguracyjnym (jeśli istnieje), do modułu podanego w wierszu polecenia (wszystkie zależne moduły będą wciąż miały ustawiane polecenia je dotyczące z pliku konfiguracyjnego)\&. Oba polecenia B<install> i B<remove> będą obecnie ignorowane gdy użyta jest ta opcja, niezależnie czy żądanie dotyczyło tylko jednego (a nie obu) z B<--ignore-install> i B<--ignore-remove>\&. Patrz B<modprobe.d>(5)\&.

source: This option does everything but actually insert or delete the modules (or run the install or remove commands)\&. Combined with B<-v>, it is useful for debugging problems\&. For historical reasons both B<--dry-run> and B<--show> actually mean the same thing and are interchangeable\&.
pl: Opcja wykonuje wszystko poza rzeczywistym załadowaniem lub usunięciem modułu (lub wykonaniu poleceń install lub remove)\&. W połączeniu z B<-v> jest przydatna do debugowania problemów\&. Z powodów historycznych zarówno B<--dry-run> i B<--show> oznaczają to samo i mogą być stosowane wymiennie\&.

source: With this flag, B<modprobe> won\*(Aqt print an error message if you try to remove or insert a module it can\*(Aqt find (and isn\*(Aqt an alias or B<install>/B<remove> command)\&. However, it will still return with a non-zero exit status\&. The kernel uses this to opportunistically probe for modules which might exist using request_module\&.
pl: Z tą opcją B<modprobe> nie będzie wypisywało informacji o błędzie, gdy będzie się próbowało załadować moduł, którego nie można znaleźć (i nie jest aliasem lub poleceniem B<install>/B<remove>)\&. Program będzie mógł wciąż zwracać niezerowy kod zakończenia\&. Jądro używa tej opcji do wypróbowania modułów, które mogą potencjalnie istnieć, przy użyciu request_module\&.

source: Print all module names matching an alias\&. This can be useful for debugging module alias problems\&.
pl: Wypisuje wszystkie nazwy modułów pasujące do aliasu\&. Może być przydatne do debugowania problemów z aliasem modułu\&.

source: This option causes B<modprobe> to remove rather than insert a module\&. If the modules it depends on are also unused, B<modprobe> will try to remove them too\&. Unlike insertion, more than one module can be specified on the command line (it does not make sense to specify module parameters when removing modules)\&.
pl: Opcja powoduje usunięcie modułu przez B<modprobe>, zamiast załadowania go\&. Jeśli moduły, od których on zależy są również nieużywane, B<modprobe> także spróbuje je usunąć. W przeciwieństwie do ładowania modułów, można podać kilka modułów w wierszu polecenia (nie ma sensu podawać parametrów modułu podczas usuwania go)\&.

source: There is usually no reason to remove modules, but some buggy modules require it\&. Your distribution kernel may not have been built to support removal of modules at all\&.
pl: Z reguły nie ma powodu aby usuwać moduły, ale część błędnych modułów może tego wymagać\&. Jądro dystrybucyjne może w ogóle nie być zbudowane z obsługą usuwania modułów\&.

source: Set the kernel version, rather than using B<uname>(2) to decide on the kernel version (which dictates where to find the modules)\&.
pl: Ustawia wersję jądra, zamiast używania B<uname>(2) do decydowania o niej (decyduje o miejscu szukania modułów)\&.

source: List the dependencies of a module (or alias), including the module itself\&. This produces a (possibly empty) set of module filenames, one per line, each starting with "insmod" and is typically used by distributions to determine which modules to include when generating initrd/initramfs images\&. B<Install> commands which apply are shown prefixed by "install"\&. It does not run any of the install commands\&. Note that B<modinfo>(8) can be used to extract dependencies of a module from the module itself, but knows nothing of aliases or install commands\&.
pl: Wypisuje zależności modułu (lub aliasu) włącznie z samym modułem. Wynikiem jest (być może pusty) zestaw nazw plików modułów, po jednym w wierszu, zaczynających się "insmod", który jest z reguły używany przez dystrybucje do określenia które moduły włączyć do generowanych obrazów initrd/initramfs. Stosowane polecenie B<install> jest poprzedzone przez "install"\&. Opcja nie wykonuje żadnego z poleceń instalacji\&. Proszę zauważyć, że B<modinfo>(8) może zostać użyte do pozyskania zależności modułu z samego modułu, ale nie wie nic o aliasach ani poleceniach instalacji\&.

source: This option causes any error messages to go through the syslog mechanism (as LOG_DAEMON with level LOG_NOTICE) rather than to standard error\&. This is also automatically enabled when stderr is unavailable\&.
pl: Opcja powoduje, że wszystkie komunikaty o błędach przesyłane są przez mechanizm syslog (jak LOG_DAEMON z poziomem LOG_NOTICE), zamiast na standardowe wyjście błędów\&. Włącza się również automatycznie, gdy stderr jest niedostępne\&.

source: Show version of program and exit\&.
pl: wyświetla informacje o wersji i kończy działanie\&.

source: Print messages about what the program is doing\&. Usually B<modprobe> only prints messages if something goes wrong\&.
pl: Wypisuje informacje o czynnościach wykonywanych przez program\&. B<modprobe> wypisuje zwykle komunikaty jedynie, gdy występują jakieś problemy\&.

source: ENVIRONMENT
pl: ŚRODOWISKO

source: The MODPROBE_OPTIONS environment variable can also be used to pass arguments to B<modprobe>\&.
pl: Do przekazania argumentów do B<modprobe> można użyć również zmiennej środowiskowej MODPROBE_OPTIONS\&.

source: COPYRIGHT
pl: PRAWA AUTORSKIE

source: This manual page originally Copyright 2002, Rusty Russell, IBM Corporation\&. Maintained by Jon Masters and others\&.
pl: Pierwotnie: Copyright 2002, Rusty Russell, IBM Corporation\&. Strona podręcznika jest obecnie zarządzana przez Jona Mastersa i innych\&.

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: AUTHORS
pl: AUTORZY

source: Developer
pl: Deweloper
