Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/netstat.8.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: netstat - Print network connections, routing tables, interface statistics, masquerade connections, and multicast memberships
pl: netstat - wyświetla połączenia sieciowe, tablice trasowania, statystyki interfejsu, połączenia maskaradowe i udziale w połączeniach multicast

source: SYNOPSIS
pl: SKŁADNIA

source: B<netstat> [I<address_family_options>] [B<--tcp>|B<-t>] [B<--udp>|B<-u>] [B<--raw>|B<-w>] [B<--listening>|B<-l>] [B<--all>|B<-a>] [B<--numeric>|B<-n>] [B<--numeric-hosts>] [B<--numeric-ports>] [B<--numeric-users>] [B<--symbolic>|B<-N>] [B<--extend>|B<-e>[B<--extend>|B<-e]>] [B<--timers>|B<-o>] [B<--program>|B<-p>] [B<--verbose>|B<-v>] [B<--continuous>|B<-c]>
pl: B<netstat> [I<opcje-rodziny-adresów>] [B<--tcp>|B<-t>] [B<--udp>|B<-u>] [B<--raw>|B<-w>] [B<--listening>|B<-l>] [B<--all>|B<-a>] [B<--numeric>|B<-n>] [B<--numeric-hosts>] [B<--numeric-ports>] [B<--numeric-users>] [B<--symbolic>|B<-N>] [B<--extend>|B<-e>[B<--extend>|B<-e]>] [B<--timers>|B<-o>] [B<--program>|B<-p>] [B<--verbose>|B<-v>] [B<--continuous>|B<-c]>

source: B<netstat> {B<--route>|B<-r>} [I<address_family_options>] [B<--extend>|B<-e>[B<--extend>|B<-e]>] [B<--verbose>|B<-v>] [B<--numeric>|B<-n>] [B<--numeric-hosts>] [B<--numeric-ports>] [B<--numeric-users>] [B<--continuous>|B<-c]>
pl: B<netstat> {B<--route>|B<-r>} [I<opcje-rodziny-adresów>] [B<--extend>|B<-e>[B<--extend>|B<-e]>] [B<--verbose>|B<-v>] [B<--numeric>|B<-n>] [B<--numeric-hosts>] [B<--numeric-ports>] [B<--numeric-users>] [B<--continuous>|B<-c]>

source: I<address_family_options>:
pl: I<opcje-rodziny-adresów>:

source: [B<-4>] [B<-6>] [B<--protocol=>{B<inet>,B<unix>,B<ipx>,B<ax25>,B<netrom>,B<ddp>}[,B<...]>] [B<--unix>|B<-x>] [B<--inet>|B<--ip>] [B<--ax25>] [B<--ipx>] [B<--netrom>] [B<--ddp>]
pl: [B<-4>] [B<-6>] [B<--protocol=>{B<inet>,B<unix>,B<ipx>,B<ax25>,B<netrom>,B<ddp>}[...]] [B<--unix>|B<-x>] [B<--inet>|B<--ip>] [B<--ax25>] [B<--ipx>] [B<--netrom>] [B<--ddp>]

source: DESCRIPTION
pl: OPIS

source: B<Netstat> prints information about the Linux networking subsystem. The type of information printed is controlled by the first argument, as follows:
pl: B<Netstat> wyświetla dane o podsystemie sieciowym Linuksa. Typ wyświetlanej informacji jest kontrolowany przez pierwszy argument, jak poniżej:

source: (none)
pl: (bez opcji)

source: By default, B<netstat > displays a list of open sockets. If you don't specify any address families, then the active sockets of all configured address families will be printed.
pl: Domyślnie B<netstat> wyświetla listę otwartych gniazd. Jeśli nie poda się rodzin adresów, to wypisane zostaną aktywne gniazda wszystkich skonfigurowanych rodzin adresów.

source: Display the kernel routing tables. See the description in B<route>(8) for details. B<netstat -r> and B<route -e> produce the same output.
pl: Wyświetla tabele trasowania. Więcej informacji znajduje się w podręczniku B<route>(8). B<netstat -r> i B<route -e> wyświetlają to samo.

source: Display multicast group membership information for IPv4 and IPv6.
pl: Wyświetla informacje o członkostwie w połączeniach multicast w przypadku IPv4 i IPv6.

source: Display a table of all network interfaces.
pl: Wyświetla tabelę wszystkich interfejsów sieciowych.

source: Display a list of masqueraded connections.
pl: Wyświetla listę połączeń maskaradowych.

source: Display summary statistics for each protocol.
pl: Wyświetla zwięzłe statystyki każdego protokołu.

source: OPTIONS
pl: OPCJE

source: Tell the user what is going on by being verbose. Especially print some useful information about unconfigured address families.
pl: Mówi użytkownikowi co się dzieje, wyświetlając więcej informacji. Co ważne, wypisuje niektóre interesujące informacje o nieskonfigurowanych rodzinach adresów.

source: Do not truncate IP addresses by using output as wide as needed. This is optional for now to not break existing scripts.
pl: Nie skraca adresów IP, używając tak szerokiego wyjścia, jakie jest potrzebne. Jest to obecnie opcjonalne, aby nie zepsuć istniejących skryptów.

source: Show numerical addresses instead of trying to determine symbolic host, port or user names.
pl: Pokazuje adresy numeryczne; nie próbuje zdeterminować symbolicznego hosta, portu czy nazwy użytkownika.

source: shows numerical host addresses but does not affect the resolution of port or user names.
pl: pokazuje adresy numeryczne; ale nie wpływa na określenie portu lub nazwy użytkownika.

source: shows numerical port numbers but does not affect the resolution of host or user names.
pl: pokazuje porty numeryczne, ale nie wpływa na określenie komputera czy nazwy użytkownika.

source: shows numerical user IDs but does not affect the resolution of host or port names.
pl: pokazuje numeryczne identyfikatory użytkowników, ale nie wpływa na określenie komputera czy nazw portów.

source: --protocol=I<family >R<, >-A
pl: --protocol=I<rodzina >R<, >-A

source: Specifies the address families (perhaps better described as low level protocols) for which connections are to be shown. I<family> is a comma (',') separated list of address family keywords like B<inet>, B<unix>, B<ipx>, B<ax25>, B<netrom>, and B<ddp>. This has the same effect as using the B<--inet>, B<--unix> (B<-x>), B<--ipx>, B<--ax25>, B<--netrom>, and B<--ddp> options.
pl: Określa rodzinę adresów (prawdopodobnie lepsze określenie to protokoły niskiego poziomu) do pokazywanych połączeń. I<rodzina> jest listą oddzielonych przecinkami słów kluczowych, takich jak B<inet>, B<unix>, B<ipx>, B<ax25>, B<netrom> i B<ddp>. To ma taki sam efekt, jak długie opcje B<--inet>, B<--unix> (B<-x>), B<--ipx>, B<--ax25>, B<--netrom> i B<--ddp>.

source: The address family B<inet> includes raw, udp and tcp protocol sockets.
pl: Rodzina adresów B<inet> obejmuje gniazda protokołów raw, udp i tcp.

source: This will cause B<netstat> to print the selected information every second continuously.
pl: To powoduje, że B<netstat> będzie wypisywał wybraną informację w trybie ciągłym, co sekundę.

source: Display additional information. Use this option twice for maximum detail.
pl: Wyświetla dodatkowe informacje. Dwukrotne użycie tej opcji da maksymalny poziom szczegółowości.

source: Include information related to networking timers.
pl: Obejmuje informacje związane z sieciowymi licznikami czasu.

source: Show the PID and name of the program to which each socket belongs.
pl: Pokazuje PID-y oraz nazwy programów, do których należą poszczególne gniazda.

source: Show only listening sockets. (These are omitted by default.)
pl: Pokazuje jedynie nasłuchujące gniazda (są one domyślnie pomijane).

source: Show both listening and non-listening sockets. With the B<--interfaces> option, show interfaces that are not up
pl: Pokazuje zarówno nasłuchujące jak i nienasłuchujące gniazda. Z opcją B<--interfaces> pokazuje nieaktywne interfejsy.

source: Print routing information from the FIB. (This is the default.)
pl: Wypisuje informacje trasowania z FIB (domyślnie).

source: Print routing information from the route cache.
pl: Wypisuje informacje trasowania z buforu trasowania.

source: OUTPUT
pl: WYJŚCIE

source: Active Internet connections R<(TCP, UDP, raw)>
pl: Aktywne połączenia internetowe R<(TCP, UDP, RAW)>

source: The protocol (tcp, udp, raw) used by the socket.
pl: Protokół (tcp, udp, raw) używany przez gniazdo.

source: The count of bytes not copied by the user program connected to this socket.
pl: Liczba bajtów nieskopiowanych przez program użytkownika podłączonego do tego gniazda.

source: The count of bytes not acknowledged by the remote host.
pl: Liczba bajtów, których odbiór nie został potwierdzony przez zdalny host.

source: Address and port number of the local end of the socket. Unless the B<--numeric> (B<-n>) option is specified, the socket address is resolved to its canonical host name (FQDN), and the port number is translated into the corresponding service name.
pl: Adres lokalny (lokalna nazwa hosta) i numer portu gniazda. O ile nie podano opcji B<--numeric> (B<-n>), adres gniazda jest rozwiązywany do jego postaci kanonicznej (FQDN), a numer portu jest tłumaczony na odpowiadającą mu nazwę usługi.

source: Address and port number of the remote end of the socket. Analogous to "Local Address."
pl: Adres zdalnego komputera i numer portu jego gniazda. Analogiczne do "Local Adress".

source: The state of the socket. Since there are no states in raw mode and usually no states used in UDP, this column may be left blank. Normally this can be one of several values:
pl: Stan gniazda. Ponieważ w RAW to nie działa, a zazwyczaj w UDP też nie, to pole pozostaje czasem puste. Normalnie może być to jedna z kilku wartości:

source: The socket has an established connection.
pl: Gniazdo zestawiło połączenie.

source: The socket is actively attempting to establish a connection.
pl: Gniazdo aktywnie próbuje zestawić połączenie.

source: A connection request has been received from the network.
pl: Żądanie połączenia zostało otrzymane z sieci.

source: The socket is closed, and the connection is shutting down.
pl: Gniazdo jest zamknięte, a połączenie się zamyka.

source: Connection is closed, and the socket is waiting for a shutdown from the remote end.
pl: Połączenie jest zamknięte, a gniazdo czeka na zamknięcie na drugim końcu.

source: The socket is waiting after close to handle packets still in the network.
pl: Po zamknięciu, gniazdo czeka na obsługę pakietów wciąż będących w sieci.

source: The socket is not being used.
pl: Gniazdo nie jest używane.

source: The remote end has shut down, waiting for the socket to close.
pl: Zdalny koniec zamknął i oczekuje aż gniazdo się zamknie.

source: The remote end has shut down, and the socket is closed. Waiting for acknowledgement.
pl: Zdalny koniec zamknął, a gniazdo jest zamknięte. Oczekiwanie potwierdzenia.

source: The socket is listening for incoming connections. Such sockets are not included in the output unless you specify the B<--listening> (B<-l>) or B<--all> (B<-a>) option.
pl: Gniazdo nasłuchuje nadchodzących połączeń. Te gniazda są wyświetlane tylko jeśli ustawiono opcję B<--listening> (B<-l>) lub B<--all> (B<-a>).

source: Both sockets are shut down but we still don't have all our data sent.
pl: Obydwa gniazda są zamknięte, lecz wciąż nie mamy wysłanych wszystkich danych.

source: The state of the socket is unknown.
pl: Stan gniazda jest nieznany.

source: The username or the user id (UID) of the owner of the socket.
pl: Nazwa lub identyfikator użytkownika (UID) właściciela gniazda.

source: Slash-separated pair of the process id (PID) and process name of the process that owns the socket. B<--program> causes this column to be included. You will also need I<superuser> privileges to see this information on sockets you don't own. This identification information is not yet available for IPX sockets.
pl: Identyfikator procesu i oddzielona ukośnikiem nazwa procesu, który jest właścicielem gniazda. Opcja B<--program> powoduje, że kolumna ta jest brana pod uwagę. Potrzebne są również uprawnienia I<superużytkownika>, aby zobaczyć tę informację w przypadku gniazd, których nie jest się właścicielem. Ta informacja identyfikacyjna nie jest wciąż dostępna dla gniazd IPX.

source: (this needs to be written)
pl: (musi to być napisane)

source: Active UNIX domain Sockets
pl: Gniazda aktywne dziedziny UNIX-owej

source: The protocol (usually unix) used by the socket.
pl: Protokół (zwykle unix) używany przez gniazdo.

source: The reference count (i.e. attached processes via this socket).
pl: Liczba referencji (np. załączonych przez to gniazdo procesów).

source: The flags displayed is SO_ACCEPTON (displayed as B<ACC>), SO_WAITDATA (B<W>) or SO_NOSPACE (B<N>). SO_ACCECPTON is used on unconnected sockets if their corresponding processes are waiting for a connect request. The other flags are not of normal interest.
pl: Wyświetlane flagi to SO_ACCEPTON (wyświetlane jako B<ACC>), SO_WAITDATA (B<W>) lub SO_NOSPACE (B<N>). SO_ACCECPTON jest używane na niepodłączonych gniazdach jeśli odpowiadające im procesy oczekują na żądanie połączenia. Pozostałe flagi zwykle nie są interesujące.

source: There are several types of socket access:
pl: Istnieje wiele rodzajów dostępu do gniazd:

source: The socket is used in Datagram (connectionless) mode.
pl: Gniazdo jest używane w trybie datagramowym (bezpołączeniowym).

source: This is a stream (connection) socket.
pl: Gniazdo jest strumieniowe (połączeniowe).

source: The socket is used as a raw socket.
pl: Gniazdo jest gniazdem typu raw.

source: This one serves reliably-delivered messages.
pl: Gniazdo serwuje rdm (reliably-delivered messages).

source: This is a sequential packet socket.
pl: Gniazdo jest gniazdem typu sequential packet.

source: Raw interface access socket.
pl: Gniazdo dostępu interfejsu RAW.

source: Who ever knows what the future will bring us - just fill in here :-)
pl: Któż wie, co przyszłość może nam przynieść - wypełnij :-)

source: This field will contain one of the following Keywords:
pl: To pole będzie zawierać jedno z następujących słów kluczowych:

source: The socket is not allocated
pl: Gniazdo nie jest zaalokowane

source: The socket is listening for a connection request. Such sockets are only included in the output if you specify the B<--listening> (B<-l>) or B<--all> (B<-a>) option.
pl: Gniazdo nasłuchuje żądań połączeń. Te gniazda są wyświetlane tylko jeśli ustawiono opcję B<--listening> (B<-l>) lub B<--all> (B<-a>).

source: The socket is about to establish a connection.
pl: Gniazdo ma zamiar zestawić połączenie.

source: The socket is connected.
pl: Gniazdo jest połączone.

source: The socket is disconnecting.
pl: Gniazdo się rozłącza.

source: The socket is not connected to another one.
pl: Gniazdo nie jest podłączone do innego.

source: This state should never happen.
pl: Ten stan nie powinien nigdy wystąpić.

source: Process ID (PID) and process name of the process that has the socket open. More info available in B<Active Internet connections> section written above.
pl: Identyfikator procesu (PID) i nazwa procesu, który posiada otwarte dane gniazdo. Więcej informacji znajduje się w rozdziale B<Aktywne połączenia internetowe>, znajdującym się wyżej.

source: This is the path name as which the corresponding processes attached to the socket.
pl: Wyświetla ścieżkę do procesów przywiązanych do gniazda.

source: Active IPX sockets
pl: Aktywne gniazda IPX

source: (this needs to be done by somebody who knows it)
pl: (powinno to być zrobione przez kogoś, kto je zna)

source: Active NET/ROM sockets
pl: Aktywne gniazda NET/ROM

source: Active AX.25 sockets
pl: Aktywne gniazda AX.25

source: NOTES
pl: UWAGI

source: Starting with Linux release 2.2 B<netstat -i> does not show interface statistics for alias interfaces. To get per alias interface counters you need to setup explicit rules using the B<ipchains(8)> command.
pl: Od Linuksa 2.2, B<netstat -i> nie wyświetla statystyk interfejsu, w przypadku aliasu interfejsu. Aby uzyskać liczniki aliasu interfejsu należy skonfigurować odpowiednie reguły za pomocą polecenia B<ipchains(8)>.

source: FILES
pl: PLIKI

source: I</etc/services> -- The services translation file
pl: I</etc/services> -- Plik translacji usług

source: I</proc> -- Mount point for the proc filesystem, which gives access to kernel status information via the following files.
pl: I</proc> -- Punkt montowania systemu plików proc, który daje dostęp do informacji statusu jądra za pomocą następujących plików:

source: I</proc/net/dev> -- device information
pl: I</proc/net/dev> -- informacja o urządzeniach

source: I</proc/net/raw> -- raw socket information
pl: I</proc/net/raw> -- informacja o gniazdach RAW

source: I</proc/net/tcp> -- TCP socket information
pl: I</proc/net/tcp> -- informacja o gniazdach TCP

source: I</proc/net/udp> -- UDP socket information
pl: I</proc/net/udp> -- informacja o gniazdach UDP

source: I</proc/net/igmp> -- IGMP multicast information
pl: I</proc/net/igmp> -- informacja o multicast IGMP.

source: I</proc/net/unix> -- Unix domain socket information
pl: I</proc/net/unix> -- informacja o gniazdach dziedziny UNIX-owej

source: I</proc/net/ipx> -- IPX socket information
pl: I</proc/net/ipx> -- informacja o gniazdach IPX

source: I</proc/net/ax25> -- AX25 socket information
pl: I</proc/net/ax25> -- informacja o gniazdach AX25

source: I</proc/net/appletalk> -- DDP (appletalk) socket information
pl: I</proc/net/appeltalk> -- informacja o gniazdach DDP (appletalk)

source: I</proc/net/nr> -- NET/ROM socket information
pl: I</proc/net/nr> -- informacja o gniazdach NET/ROM

source: I</proc/net/route> -- IP routing information
pl: I</proc/net/route> -- informacje o trasowaniu IP

source: I</proc/net/ax25_route> -- AX25 routing information
pl: I</proc/net/ax25_route> -- informacje o trasowaniu AX25

source: I</proc/net/ipx_route> -- IPX routing information
pl: I</proc/net/ipx_route> -- informacje o trasowaniu IPX

source: I</proc/net/nr_nodes> -- NET/ROM nodelist
pl: I</proc/net/nr_nodes> -- lista węzłów NET/ROM

source: I</proc/net/nr_neigh> -- NET/ROM neighbours
pl: I</proc/net/nr_neigh> -- jądrowi sąsiedzi NET/ROM

source: I</proc/net/ip_masquerade> -- masqueraded connections
pl: I</proc/net/ip_masquerade> -- połączenia maskaradowe

source: I</proc/net/snmp> -- statistics
pl: I</proc/net/snmp> -- statystyki

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: BUGS
pl: BŁĘDY

source: Occasionally strange information may appear if a socket changes as it is viewed. This is unlikely to occur.
pl: Czasami mogą pojawić się dziwne informacje jeśli gniazdo zmienia się podczas przeglądania. Rzadko się to zdarza.

source: AUTHORS
pl: AUTORZY

source: The netstat user interface was written by Fred Baumgarten E<lt>dc6iq@insu1.etec.uni-karlsruhe.deE<gt>, the man page basically by Matt Welsh E<lt>mdw@tc.cornell.eduE<gt>. It was updated by Alan Cox E<lt>Alan.Cox@linux.orgE<gt> but could do with a bit more work. It was updated again by Tuan Hoang E<lt>tqhoang@bigfoot.comE<gt>.
pl: Interfejs użytkownika netstata został napisany przez Freda Baumgartena E<lt>dc6iq@insu1.etec.uni-karlsruhe.deE<gt> strona podręcznika man przez Matta Welsha E<lt>mdw@tc.cornell.eduE<gt>. Była poprawiana przez Alana Coxa E<lt>Alan.Cox@linux.orgE<gt>, który mógł się bardziej postarać. Zaktualizował ją ponownie Tuan Hoang E<lt>tqhoang@bigfoot.comE<gt>.

source: The man page and the command included in the net-tools package is totally rewritten by Bernd Eckenfels E<lt>ecki@linux.deE<gt>.
pl: Strona man i komendy załączone w pakiecie net-tools zostały kompletnie przepisane przez Bernda Eckenfelsa E<lt>ecki@linux.deE<gt>.
