Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/qmail-getpw.8.po
Languages: pl

source: NAME
pl: NAZWA

source: qmail-getpw - give addresses to users
pl: qmail-getpw - podaje adresy użytkowników

source: SYNOPSIS
pl: SKŁADNIA

source: B<qmail-getpw> I<local>
pl: B<qmail-getpw> I<lokalny>

source: DESCRIPTION
pl: OPIS

source: In B<qmail>, each user controls a vast array of local addresses. B<qmail-getpw> finds the user that controls a particular address, I<local>. It prints six pieces of information, each terminated by NUL: I<user>; I<uid>; I<gid>; I<homedir>; I<dash>; and I<ext>. The user's account name is I<user>; the user's uid and gid in decimal are I<uid> and I<gid>; the user's home directory is I<homedir>; and messages to I<local> will be handled by I<homedir>B</.qmail>I<dashext>.
pl: W systemie B<qmail> każdy użytkownik zarządza pokaźną tablicą lokalnych adresów. B<qmail-getpw> znajduje użytkownika, który zarządza poszczególnymi adresami I<lokalnymi>. Wypisuje sześć porcji informacji, a każda porcja zakończona jest znakiem NUL: I<użytkownik>; I<uid>; I<gid>; I<katalogdomowy>; I<kreska> i I<dod>. Nazwa konta użytkownika to I<użytkownik>; dziesiętne wartości UID i GID użytkownika to I<uid> i I<gid>; katalog domowy użytkownika to I<katalogdomowy>; a wiadomość kierowana do I<lokalnego> będzie obsługiwana przez I<katalogdomowy>B</.qmail>I<kreskadod>.

source: In case of trouble, B<qmail-getpw> exits nonzero without printing anything.
pl: W przypadku kłopotów B<qmail-getpw> wychodzi, zwracając niezerowy kod błędu bez wypisywania czegokolwiek.

source: B<WARNING:> The operating system's B<getpwnam> function, which is at the heart of B<qmail-getpw>, is inherently unreliable: it fails to distinguish between temporary errors and nonexistent users. Future versions of B<getpwnam> should return ETXTBSY to indicate temporary errors and ESRCH to indicate nonexistent users.
pl: B<OSTRZEŻENIE:> Funkcja systemowa B<getpwnam>, będąca sercem B<qmail-getpw>, nie jest z natury pewna: zawodzi przy tymczasowych błędach i nieistniejących użytkownikach. Przyszłe wersje B<getpwnam> powinny zwracać ETXTBSY, by wskazać na błędy tymczasowe, i ESRCH, by wskazać na użytkowników, którzy nie istnieją.

source: RULES
pl: REGUŁY

source: B<qmail-getpw> considers an account in B</etc/passwd> to be a user if (1) the account has a nonzero uid, (2) the account's home directory exists (and is visible to B<qmail-getpw>), and (3) the account owns its home directory. B<qmail-getpw> ignores account names containing uppercase letters. B<qmail-getpw> also assumes that all account names are shorter than 32 characters.
pl: B<qmail-getpw> rozważa, czy konto należy do użytkownika, używając pliku B</etc/passwd>. By stwierdzić, że tak jest w istocie: (1) konto musi mię niezerowy numer UID, (2) musi istnieć katalog domowy użytkownika (i musi on być widoczny dla B<qmail-getpw>) i wreszcie (3) katalog domowy musi należeć do właściciela konta. B<qmail-getpw> ignoruje nazwy kont zawierające duże litery. B<qmail-getpw> zakłada też, że wszystkie nazwy kont są krótsze niż 32 znaki.

source: B<qmail-getpw> gives each user control over the basic I<user> address and all addresses of the form I<user>B<->I<anything>. When I<local> is I<user>, I<dash> and I<ext> are both empty. When I<local> is I<user>B<->I<anything>, I<dash> is a hyphen and I<ext> is I<anything>. I<user> may appear in any combination of uppercase and lowercase letters at the front of I<local>.
pl: B<qmail-getpw> daje każdemu użytkownikowi kontrolę nad podstawowym adresem I<użytkownika> i wszystkimi adresami w formie I<użytkownik>B<->I<cokolwiek>. Gdy I<lokalny> jest zapisane jako I<użytkownik>, pola I<kreska> i I<dod> są oba puste. Gdy I<lokalny> jest zapisane jako I<użytkownik>B<->I<cokolwiek>, pole I<kreska> jest myślnikiem, a I<dod> jest I<czymkolwiek>. I<użytkownik> może być zapisany przy użyciu dowolnej kombinacji dużych i małych liter na początku I<lokalnego>.

source: A catch-all user, B<alias>, controls all other addresses. In this case I<ext> is I<local> and I<dash> is a hyphen.
pl: Łapacz każdego użytkownika, B<alias>, kontroluje wszystkie pozostałe adresy. W tym przypadku I<dod> jest I<lokalnym>, a I<kreska> myślnikiem.

source: You can override all of B<qmail-getpw>'s decisions with the B<qmail-users> mechanism, which is reliable, highly configurable, and much faster than B<qmail-getpw>.
pl: Można przeciążyć wszystkie decyzje programu B<qmail-getpw> używając mechanizmu B<qmail-users>, który się sprawdza, jest bardzo komfortowy i o wiele szybszy niż B<qmail-getpw>.

source: SEE ALSO
pl: ZOBACZ TAKŻE
