Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/qmail-pw2u.8.po
Languages: pl

source: NAME
pl: NAZWA

source: qmail-pw2u - build address assignments from a passwd file
pl: qmail-pw2u - buduje przypisania adresów na podstawie pliku passwd

source: SYNOPSIS
pl: SKŁADNIA

source: B<qmail-pw2u> [ B<-/ohHuUC> ] [ B<-c>I<char> ]
pl: B<qmail-pw2u> [ B<-/ohHuUC> ] [ B<-c>I<znak> ]

source: DESCRIPTION
pl: OPIS

source: B<qmail-pw2u> reads a V7-format passwd file from standard input and prints a B<qmail-users>-format assignment file.
pl: B<qmail-pw2u> czyta plik passwd w formacie V7 ze standardowego wejścia i drukuje plik w formacie B<qmail-users>.

source: A V7-format passwd file is a series of lines. Each line has the format
pl: Format V7 pliku passwd jest to seria linii w formacie:

source: user:password:uid:gid:gecos:home:shell
pl: użytkownik:hasło:uid:gid:gecos:domowy:shell

source: where I<user> is an account name, I<uid> and I<gid> are the user id and group id of that account, and I<home> is the account's home directory. I<password>, I<gecos>, and I<shell> are ignored by B<qmail-pw2u>.
pl: gdzie I<użytkownik> jest nazwą konta, I<uid> i I<gid> to identyfikatory użytkownika i grupy tego konta, a I<domowy> to katalog domowy. I<hasło>, I<gecos> i I<shell> są ignorowane przez B<qmail-pw2u>.

source: If you put the output of B<qmail-pw2u> into B</var/lib/qmail/users/assign>, and then run B<qmail-newu>, B<qmail-lspawn> will obey the assignments printed by B<qmail-pw2u>. B<WARNING:> After changing any users, uids, gids, or home directories in your passwd file, you must run B<qmail-pw2u> and B<qmail-newu> again if you want B<qmail-lspawn> to see the changes.
pl: Jeśli wyjście programu B<qmail-pw2u> zostanie przekierowane do pliku B</var/lib/qmail/users/assign>, a potem zostanie uruchomiony B<qmail-newu>, to B<qmail-lspawn> będzie postępować zgodnie z wypisanymi przez B<qmail-pw2u> przypisaniami. B<OSTRZEŻENIE:> Po zmianach dotyczących użytkowników, ich identyfikatorów lub katalogów domowych w pliku passwd trzeba ponownie uruchomić B<qmail-pw2u> i B<qmail-newu>, aby B<qmail-lspawn> zauważył zmiany.

source: RULES
pl: REGUŁY

source: By default, B<qmail-pw2u> follows the same rules as B<qmail-getpw>. It skips I<user> if (1) I<uid> is zero, (2) I<home> does not exist, (3) I<user> does not own I<home>, or (4) I<user> contains uppercase letters. It then gives each remaining I<user> control over the basic I<user> address and all addresses of the form I<user>B<->I<anything>. A catch-all user, B<alias>, controls all other addresses.
pl: Domyślnie, B<qmail-pw2u> postępuje zgodnie z tymi samymi regułami, co B<qmail-getpw>. Pomija I<użytkownika>, jeśli (1) I<uid> ma wartość zero, (2) katalog I<domowy> nie istnieje, (3) I<użytkownik> nie jest właścicielem katalogu I<domowy> lub (4) nazwa I<użytkownika> zawiera duże litery. Potem przekazywana jest kontrola I<użytkownika> nad adresem podstawowym widocznym jako I<użytkownik> i nad wszystkimi adresami w formie I<użytkownik>B<->I<cokolwiek>. Łapacz wszystkich użytkowników, B<alias>, kontroluje wszystkie pozostałe adresy

source: You may change these rules by setting up files in B</var/lib/qmail/users>:
pl: Można zmieniać te reguły przez zmiany w plikach z B</var/lib/qmail/users>:

source: Allowed users, one per line. If B<include> exists, and I<user> is not listed in B<include>, I<user> is ignored.
pl: Dozwoleni użytkownicy, jeden na linię. Jeśli plik B<include> istnieje, a I<użytkownik> nie jest w nim wyszczególniony, to I<użytkownik> ten jest ignorowany.

source: Ignored users, one per line. If B<exclude> exists, and I<user> is listed in B<exclude>, I<user> is ignored.
pl: Użytkownicy ignorowani, jeden na linię. Jeśli plik B<exclude> istnieje, a I<użytkownik> jest w nim wyszczególniony, to I<użytkownik> ten jest ignorowany.

source: Replacement names for users. Each line has the form
pl: Zmiana nazw dla użytkowników. Każda linia jest postaci

source: user:mailname1:mailname2:...
pl: użytkownik:nazwapocztowa1:nazwapocztowa2:...

source: The addresses I<mailname1> and I<mailname1>B<->I<ext> and I<mailname2> and so on will be delivered to I<user>.
pl: Listy zaadresowane do I<nazwapocztowa1> i I<nazwapocztowa1>B<->I<dod> oraz I<nazwapocztowa2> i inne wyszczególnione będą dostarczone do I<użytkownika>.

source: B<WARNING:> The addresses I<user> and I<user>B<->I<ext> will not be delivered to I<user> unless I<user> is listed as one of the I<mailname>s.
pl: B<OSTRZEŻENIE:> Listy zaadresowane do I<użytkownik> i I<użytkownik>B<->I<dod> nie będą dostarczone do I<użytkownika>, dopóki sam I<użytkownik> nie jest wyszczególniony jako jedno z pól I<nazwapocztowa>.

source: A line in B<mailnames> is silently ignored if the user does not exist.
pl: Linia w pliku B<mailnames> jest po cichu ignorowana, jeśli użytkownik nie istnieje.

source: Extra addresses. Each line has the form
pl: adresy dodatkowe. Każda linia ma postać

source: sub:user:pre:
pl: pod:użytkownik:przed:

source: I<sub> will be handled by I<home>B</.qmail->I<pre>, where I<home> is I<user>'s home directory; I<sub>B<->I<ext> will be handled by I<home>B</.qmail->I<pre>B<->I<ext>.
pl: I<pod> będzie obsługiwane przez I<domowy>B</.qmail->I<przed>, gdzie I<domowy> to katalog domowy I<użytkownika>; I<pod>B<->I<dod> będzie obsługiwane przez I<domowy>B</.qmail->I<przed>B<->I<dod>.

source: Extra assignments, printed at the end of B<qmail-pw2u>'s output.
pl: Dodatkowe przypisania, wypisywane na końcu wyjścia B<qmail-pw2u>.

source: OPTIONS
pl: OPCJE

source: (Default.) Skip I<user> if I<home> does not exist (or is not visible to B<qmail-pw2u>). Skip I<user> if I<home> is not owned by I<user>.
pl: (Domyślna.) Pomija I<użytkownika>, jeśli jego katalog I<domowy> nie istnieje (lub nie jest widoczny dla B<qmail-pw2u>). Pomija I<użytkownika>, jeśli katalog I<domowy> nie jest własnością I<użytkownika>.

source: Stop if I<home> does not exist. This is appropriate if every user is supposed to have a home directory. Skip I<user> if I<home> is not owned by I<user>.
pl: Zatrzymuje się, jeśli katalog I<domowy> nie istnieje. Jest to odpowiednie, jeśli każdy użytkownik przypuszczalnie ma katalog domowy. Pomija I<użytkownika>, jeśli katalog I<domowy> do niego nie należy.

source: Do not check the existence or ownership of I<home>.
pl: Nie sprawdzaj obecności posiadania katalogu I<domowego>.

source: (Default.) Skip I<user> if there are any uppercase letters in I<user>.
pl: (Domyślna.) Pomija I<użytkownika>, jeśli są jakieś duże litery w nazwie I<użytkownika>.

source: Allow uppercase letters in I<user>.
pl: Zezwala na duże litery w nazwie I<użytkownika>.

source: B<-c>I<char>
pl: B<-c>I<znak>

source: Use I<char> as the user-extension delimiter in place of B<->.
pl: Używa I<znaku> zamiast znaku B<-> jako separatora nazwy użytkownika od rozszerzenia.

source: Disable the user-extension mechanism.
pl: Wyłącza mechanizm użytkownik-rozszerzenie.

source: Use I<home>B</.qmail-/>... instead of I<home>B</.qmail->...
pl: Używa I<domowy>B</.qmail-/>... zamiast I<domowy>B</.qmail->...

source: SEE ALSO
pl: ZOBACZ TAKŻE
