Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/qmail-queue.8.po
Languages: pl

source: NAME
pl: NAZWA

source: qmail-queue - queue a mail message for delivery
pl: qmail-queue - kolejkowanie wiadomości pocztowej w celu jej dostarczenia

source: SYNOPSIS
pl: SKŁADNIA

source: DESCRIPTION
pl: OPIS

source: B<qmail-queue> reads a mail message from descriptor 0. It then reads envelope information from descriptor 1. It places the message into the outgoing queue for future delivery by B<qmail-send>.
pl: B<qmail-queue> czyta wiadomość pocztową z deskryptora 0. Potem czyta informacje kopertowe z deskryptora 1. Umieszcza wiadomość w kolejce wychodzącej dla późniejszego dostarczenia przez B<qmail-send>.

source: The envelope information is an envelope sender address followed by a list of envelope recipient addresses. The sender address is preceded by the letter F and terminated by a 0 byte. Each recipient address is preceded by the letter T and terminated by a 0 byte. The list of recipient addresses is terminated by an extra 0 byte. If B<qmail-queue> sees end-of-file before the extra 0 byte, it aborts without placing the message into the queue.
pl: Informacja kopertowa to kopertowy adres nadawcy poprzedzony listą kopertowych odbiorców. Adres nadawcy jest poprzedzony literą F i zakończony znakiem o kodzie 0. Każdy adres odbiorcy jest poprzedzony literą T i zakończony znakiem o kodzie 0. Lista adresów odbiorców jest zakończona dodatkowym bajtem 0. Jeśli B<qmail-queue> ujrzy znak końca pliku przed dodatkowym bajtem 0, to przerywa działanie bez umieszczenia wiadomości w kolejce.

source: Every envelope recipient address should contain a username, an @ sign, and a fully qualified domain name.
pl: Każdy kopertowy adres odbiorcy powinien zawierać nazwę użytkownika, znak @ i w pełni kwalifikowaną nazwę domenową (FQDN).

source: B<qmail-queue> always adds a B<Received> line to the top of the message. Other than this, B<qmail-queue> does not inspect the message and does not enforce any restrictions on its contents. However, the recipients probably expect to see a proper header, as described in B<qmail-header(5)>.
pl: B<qmail-queue> zawsze dodaje linię B<Received> na górze wiadomości. Poza tym B<qmail-queue> nie sprawdza wiadomości i nie wprowadza żadnych ograniczeń co do jej zawartości. Jednakże odbiorca zapewne oczekuje pojawienia się odpowiedniego nagłówka, tak jak to opisano w B<qmail-header>(5).

source: Programs included with qmail which invoke B<qmail-queue> will invoke the contents of B<$QMAILQUEUE> instead, if that environment variable is set.
pl: Programy z pakietu qmail będą zamiast B<qmail-queue> uruchamiać zawartość zmiennej B<$QMAILQUEUE>, jeśli ta zmienna jest ustawiona.

source: FILESYSTEM RESTRICTIONS
pl: OGRANICZENIA SYSTEMU PLIKÓW

source: B<qmail-queue> imposes two constraints on the queue structure: each B<mess> subdirectory must be in the same filesystem as the B<pid> directory; and each B<todo> subdirectory must be in the same filesystem as the B<intd> directory.
pl: B<qmail-queue> nakłada dwa warunki na strukturę kolejki: każdy podkatalog B<mess> musi znajdować się w tym samym systemie plików, co katalog B<pid>, a każdy podkatalog B<todo> musi znajdować się w tym samym systemie plików, co katalog B<intd>.

source: EXIT CODES
pl: KODY ZAKOŃCZENIA

source: B<qmail-queue> does not print diagnostics. It exits 0 if it has successfully queued the message. It exits between 1 and 99 if it has failed to queue the message.
pl: B<qmail-queue> nie wypisuje diagnostyki. Zwraca 0, jeśli wiadomość została pomyślnie umieszczona w kolejce. Zwraca 1 do 99, jeśli wystąpił błąd.

source: All B<qmail-queue> error codes between 11 and 40 indicate permanent errors:
pl: Wszystkie kody błędów B<qmail-queue> zawierające się pomiędzy 11 a 40 wskazują na błędy stałe:

source: Address too long.
pl: Zbyt długi adres.

source: Mail server permanently refuses to send the message to any recipients. (Not used by B<qmail-queue>, but can be used by programs offering the same interface.)
pl: Serwer poczty całkowicie odmawia przesłania wiadomości do jakichkolwiek odbiorców. (Nieużywane przez B<qmail-queue>, ale możliwe do użycia przez programy oferujące ten sam interfejs.)

source: All other B<qmail-queue> error codes indicate temporary errors:
pl: Wszystkie pozostałe kody błędów zwracane przez B<qmail-queue> wskazują na błędy tymczasowe:

source: Out of memory.
pl: Brak pamięci.

source: Timeout.
pl: Przekroczony czas oczekiwania.

source: Write error; e.g., disk full.
pl: Błąd zapisu, np. brak miejsca na dysku.

source: Unable to read the message or envelope.
pl: Nie można odczytać wiadomości lub koperty.

source: Unable to read a configuration file. (Not used by B<qmail-queue>.)
pl: Nie można odczytać pliku konfiguracyjnego. (Nieużywane przez B<qmail-queue>.)

source: Problem making a network connection from this host. (Not used by B<qmail-queue>.)
pl: Problem w ustanawianiu połączenia sieciowego z tego hosta. (Nieużywane przez B<qmail-queue>.)

source: Problem with the qmail home directory.
pl: Problem z katalogiem domowym qmail.

source: Problem with the queue directory.
pl: Problem z katalogiem kolejki wiadomości.

source: Problem with queue/pid.
pl: Problem z queue/pid.

source: Problem with queue/mess.
pl: Problem z queue/mess.

source: Problem with queue/intd.
pl: Problem z queue/intd.

source: Problem with queue/todo.
pl: Problem z queue/todo.

source: Mail server temporarily refuses to send the message to any recipients. (Not used by B<qmail-queue>.)
pl: Serwer poczty tymczasowo odmawia przesłania wiadomości to jakiegokolwiek odbiorcy. (Nieużywane przez B<qmail-queue>.)

source: Connection to mail server timed out. (Not used by B<qmail-queue>.)
pl: Przekroczony czas oczekiwania na połączenie z serwerem poczty. (Nieużywane przez B<qmail-queue>.)

source: Connection to mail server rejected. (Not used by B<qmail-queue>.)
pl: Odmowa połączenia ze strony serwera poczty. (Nieużywane przez B<qmail-queue>.)

source: Connection to mail server succeeded, but communication failed. (Not used by B<qmail-queue>.)
pl: Połączenie z serwerem ustanowione poprawnie, ale wystąpił błąd w komunikacji. (Nieużywane przez B<qmail-queue>.)

source: Internal bug; e.g., segmentation fault.
pl: Usterka wewnętrzna, np. błąd segmentacji.

source: Envelope format error.
pl: Błąd w formacie koperty.

source: SEE ALSO
pl: ZOBACZ TAKŻE
