Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/qmail-command.8.po
Languages: pl

source: NAME
pl: NAZWA

source: qmail-command - user-specified mail delivery program
pl: qmail-command - podawany przez użytkownika program dostarczający pocztę

source: SYNOPSIS
pl: SKŁADNIA

source: in B<.qmail>I<ext>: B<|>I<command>
pl: w B<.qmail>I<dod> : B<|>I<polecenie>

source: DESCRIPTION
pl: OPIS

source: B<qmail-local> will, upon your request, feed each incoming mail message through a program of your choice.
pl: B<qmail-local> będzie, na żądanie, przepuszczał każdą nadchodzącą wiadomość pocztową przez wybrany program.

source: When a mail message arrives, B<qmail-local> runs B<sh -c >I<command> in your home directory. It makes the message available on I<command>'s standard input.
pl: Gdy nadejdzie wiadomość pocztowa, B<qmail-local> wykona B<sh -c >I<polecenie> w Twoim katalogu domowym. Wiadomość będzie udostępniona na standardowym wejściu I<polecenia>.

source: B<WARNING:> The mail message does not begin with B<qmail-local>'s usual B<Return-Path> and B<Delivered-To> lines.
pl: B<OSTRZEŻENIE:> Wiadomość pocztowa nie zaczyna się od zwyczajowo należących do B<qmail-local> linii B<Return-Path> czy też B<Delivered-To>.

source: Note that B<qmail-local> uses the same file descriptor for every delivery in your B<.qmail> file, so it is not safe for I<command> to fork a child that reads the message in the background while the parent exits.
pl: Proszę zauważyć, że B<qmail-local> używa tego samego deskryptora pliku dla każdego dostarczania podanego w pliku B<.qmail>, tak więc nie jest to bezpieczne, aby I<polecenie> tworzyło proces potomny, który czyta wiadomość w tle, podczas gdy rodzic kończy pracę.

source: EXIT CODES
pl: KODY ZAKOŃCZENIA

source: I<command>'s exit codes are interpreted as follows: 0 means that the delivery was successful; 99 means that the delivery was successful, but that B<qmail-local> should ignore all further delivery instructions; 100 means that the delivery failed permanently (hard error); 111 means that the delivery failed but should be tried again in a little while (soft error).
pl: Kody wyjścia I<polecenia> są interpretowane następująco: 0 oznacza, że dostarczanie się powiodło; 99 oznacza, że dostarczanie się powiodło, lecz B<qmail-local> powinien zignorować dalsze instrukcje doręczania; 100 oznacza, że dostarczanie zawiodło całkowicie (twardy błąd); 111 oznacza, że dostarczanie zawiodło, lecz powinno być jeszcze raz powtórzone za chwilę (miękki błąd).

source: Currently 64, 65, 70, 76, 77, 78, and 112 are considered hard errors, and all other codes are considered soft errors, but I<command> should avoid relying on this.
pl: Obecnie kody 64, 65, 70, 76, 77, 78 i 112 są rozważane jako błędy twarde, a reszta jako błędy miękkie, ale I<polecenie> powinno wstrzymywać się od polegania na tym.

source: ENVIRONMENT VARIABLES
pl: ZMIENNE ŚRODOWISKOWE

source: B<qmail-local> supplies several useful environment variables to I<command>. B<WARNING:> These environment variables are not quoted. They may contain special characters. They are under the control of a possibly malicious remote user.
pl: B<qmail-local> używa różnych użytecznych zmiennych środowiskowych przekazywanych do I<polecenie>. B<OSTRZEŻENIE:> Zmienne te nie są cytowane. Mogą zawierać znaki specjalne. Są pod kontrolą potencjalnie podstępnego zdalnego użytkownika.

source: B<SENDER> is the envelope sender address. B<NEWSENDER> is the forwarding envelope sender address, as described in B<dot-qmail(5)>. B<RECIPIENT> is the envelope recipient address, I<local@domain>. B<USER> is I<user>. B<HOME> is your home directory, I<homedir>. B<HOST> is the I<domain> part of the recipient address. B<LOCAL> is the I<local> part. B<EXT> is the address extension, I<ext>.
pl: B<SENDER> to kopertowy adres nadawcy. B<NEWSENDER> jest kopertowym adresem nadawcy przesyłającego pocztę dalej, tak jak to jest opisane w B<dot-qmail>(5). B<RECIPIENT> jest kopertowym adresem odbiorcy, określanym też w tej pomocy jako I<local@domain> (lokalny@domena). B<USER> to I<użytkownik>. B<HOME> to Twój katalog domowy, określany też w tej pomocy jako I<homedir>. B<HOST> jest I<domenową> częścią adresu odbiorcy. B<LOCAL> jest częścią I<lokalną>. B<EXT> jest rozszerzeniem (dodatkiem do) adresu, I<dod>.

source: B<HOST2> is the portion of B<HOST> preceding the last dot; B<HOST3> is the portion of B<HOST> preceding the second-to-last dot; B<HOST4> is the portion of B<HOST> preceding the third-to-last dot.
pl: B<HOST2> jest częścią zmiennej B<HOST> poprzedzającą ostatnią kropkę; B<HOST3> jest częścią zmiennej B<HOST> poprzedzającą kropkę przedostatnią; B<HOST4> jest częścią zmiennej B<HOST> poprzedzającą kropkę trzecią od końca.

source: B<EXT2> is the portion of B<EXT> following the first dash; B<EXT3> is the portion following the second dash; B<EXT4> is the portion following the third dash. B<DEFAULT> is the portion corresponding to the B<default> part of the B<.qmail->... file name; B<DEFAULT> is not set if the file name does not end with B<default>.
pl: B<EXT2> jest porcją B<EXT> następującą po pierwszym myślniku; B<EXT3> jest porcją po drugim myślniku; B<EXT4> jest porcją po trzecim myślniku; B<DEFAULT> jest porcją odpowiadającą części B<domyślnej (default)> nazwy pliku B<.qmail->...; B<DEFAULT> nie jest ustawiona, jeśli nazwa pliku nie kończy się na B<default>.

source: B<DTLINE> and B<RPLINE> are the usual B<Delivered-To> and B<Return-Path> lines, including newlines. B<UFLINE> is the UUCP-style B<From_> line that B<qmail-local> adds to I<mbox>-format files.
pl: B<DTLINE> i B<RPLINE> są zazwyczaj liniami B<Delivered-To> i B<Return-Path>, włączając w to znaki nowej linii. B<UFLINE> jest linią B<From_> w stylu UUCP, którą B<qmail-local> dodaje do plików I<mbox>-format.

source: SEE ALSO
pl: ZOBACZ TAKŻE
