Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/qmail-remote.8.po
Languages: pl

source: NAME
pl: NAZWA

source: qmail-remote - send mail via SMTP
pl: qmail-remote - wysyła pocztę za pomocą SMTP

source: SYNOPSIS
pl: SKŁADNIA

source: B<qmail-remote> I<host> I<sender> I<recip> [ I<recip ...> ]
pl: B<qmail-remote> I<host> I<nadawca> I<odbiorca> [ I<odbiorca ...> ]

source: DESCRIPTION
pl: OPIS

source: B<qmail-remote> reads a mail message from its input and sends the message to one or more recipients at a remote host.
pl: B<qmail-remote> czyta wiadomość pocztową ze swojego wejścia i wysyła ją do jednego lub większej liczby odbiorców na zdalnym hoście.

source: The remote host is B<qmail-remote>'s first argument, I<host>. B<qmail-remote> sends the message to I<host>, or to a mail exchanger for I<host> listed in the Domain Name System, via the Simple Mail Transfer Protocol (SMTP). I<host> can be either a fully-qualified domain name:
pl: Zdalny host jest pierwszym argumentem wywołania B<qmail-remote>, oznaczonym wcześniej jako I<host>. B<qmail-remote> wysyła wiadomość do komputera podanego jako I<host> lub komputera odpowiedzialnego za zarządzanie pocztą dla I<host> pobranego z Systemu Nazw Domen (ang. DNS) przez Prosty Protokół Przesyłania Poczty (ang. SMTP). I<host> może być zarówno w pełni kwalifikowaną nazwą domenową:

source: silverton.berkeley.edu
pl: serek.arch.pwr.wroc.pl

source: or an IP address enclosed in brackets:
pl: jak i adresem IP ujętym w nawiasy kwadratowe:

source: The envelope recipient addresses are listed as I<recip> arguments to B<qmail-remote>. The envelope sender address is listed as I<sender>.
pl: Kopertowe adresy odbiorców są przedstawiane jako argumenty oznaczone I<odbiorca> podawane przy wywoływaniu B<qmail-remote>. Kopertowy adres nadawcy jest podawany jako argument oznaczony przez I<nadawca>.

source: Note that B<qmail-remote> does not take options and does not follow the B<getopt> standard.
pl: Proszę zauważyć, że B<qmail-remote> nie pobiera opcji i nie jest zgodny za standardem B<getopt>.

source: TRANSPARENCY
pl: PRZEZROCZYSTOŚĆ

source: End-of-file in SMTP is encoded as dot CR LF. A dot at the beginning of a line is encoded as dot dot. It is impossible in SMTP to send a message that does not end with a newline. B<qmail-remote> converts the UNIX newline convention into the SMTP newline convention by inserting CR before each LF.
pl: Znacznik końca pliku (End-of-file) w SMTP jest kodowany za pomocą kombinacji "kropka CR LF". Kropka na początku linii jest kodowana jako "kropka kropka". Nie jest możliwe w SMTP, by przesłać wiadomość, która nie kończy się znakiem nowej linii. B<qmail-remote> konwertuje konwencję nowej linii pochodzącą z systemu UNIX do konwencji SMTP poprzez wstawienie CR przed każdym LF.

source: It is a violation of the SMTP protocol to send a message that contains long lines or non-ASCII characters. However, B<qmail-remote> will happily send such messages. It is the user's responsibility to avoid generating illegal messages.
pl: Wysyłanie wiadomości zawierającej długie linie lub znaki nie będące kodami ASCII jest naruszeniem protokołu SMTP. Jednakże B<qmail-remote> pomyślnie prześle takie wiadomości, gdyż to użytkownik jest odpowiedzialny, by zapobiegać generowaniu niepoprawnych wiadomości.

source: RESULTS
pl: REZULTATY

source: B<qmail-remote> prints some number of I<recipient reports>, followed by a I<message report>. Each report is terminated by a 0 byte. Each report begins with a single letter:
pl: B<qmail-remote> wypisuje pewną liczbę raportów odbiorców zwanych I<recipient reports>, poprzedzoną raportem wiadomości, zwanym I<message report>. Każdy raport jest zakończony bajtem 0. Każdy raport zaczyna się pojedynczą literą:

source: Recipient report: acceptance.
pl: Raport odbiorcy: akceptacja.

source: Recipient report: permanent rejection.
pl: Raport odbiorcy: trwałe odrzucenie.

source: Recipient report: temporary rejection.
pl: Raport odbiorcy: chwilowe odrzucenie.

source: Message report: success. I<host> has taken responsibility for delivering the message to each acceptable recipient.
pl: Raport wiadomości: sukces. I<host> bierze na siebie odpowiedzialność za dostarczenie wiadomości do każdego akceptowalnego odbiorcy.

source: Message report: temporary failure.
pl: Raport wiadomości: tymczasowa awaria.

source: Message report: permanent failure.
pl: Raport wiadomości: trwała awaria.

source: After this letter comes a human-readable description of what happened.
pl: Po tym przychodzi opis tego, co się stało w postaci zrozumiałej dla człowieka.

source: The recipient reports will always be printed in the same order as B<qmail-remote>'s I<recip> arguments. Note that in failure cases there may be fewer recipient reports than I<recip> arguments.
pl: Raporty odbiorców będą zawsze drukowane w takiej samej kolejności, jak kolejne argumenty oznaczone wcześniej jako I<odbiorca> programu B<qmail-remote>. Należy zauważyć, że w przypadkach awarii może być więcej raportów niż argumentów oznaczonych jako I<odbiorca>.

source: B<qmail-remote> always exits zero.
pl: B<qmail-remote> zawsze zwraca zero.

source: CONTROL FILES
pl: PLIKI KONTROLNE

source: Current host name, for use solely in saying hello to the remote SMTP server. Default: I<me>, if that is supplied; otherwise B<qmail-remote> refuses to run.
pl: Obecna nazwa hosta, używana wyłącznie przy przedstawianiu się odległemu serwerowi SMTP. Domyślnie: I<me>, jeśli jest to ustawione; w przeciwnym razie B<qmail-remote> odmawia uruchomienia się.

source: Artificial SMTP routes. Each route has the form I<domain>B<:>I<relay>, without any extra spaces. If I<domain> matches I<host>, B<qmail-remote> will connect to I<relay>, as if I<host> had I<relay> as its only MX. (It will also avoid doing any CNAME lookups on I<recip>.) I<host> may include a colon and a port number to use instead of the normal SMTP port, 25:
pl: Sztuczne trasy SMTP. Każda trasa ma formę I<domena>B<:>I<retransmiter>, bez żadnych dodatkowych spacji. Jeśli I<domena> pasuje do podanego argumentu I<host>, B<qmail-remote> połączy się z komputerem określanym tu jako I<retransmiter>, tak jakby I<host> miał maszynę nazywaną I<retransmiter> jako jedynego wymiennika poczty (MX). (Zapobiega to także wykonywaniu zapytań typu CNAME o komputer domeny I<odbiorcy>.) I<host> może zawierać dwukropek i numer portu przeznaczonego do użycia zamiast normalnego portu SMTP, czyli 25:

source: inside.af.mil:firewall.af.mil:26
pl: inside.pld.org.pl:firewall.pld.org.pl:26

source: I<relay> may be empty; this tells B<qmail-remote> to look up MX records as usual. I<smtproutes> may include wildcards:
pl: I<retransmiter> może być pusty; mówi to programowi B<qmail-remote>, by wykonać zapytanie o rekord MX jak zazwyczaj. I<smtproutes> może zawierać znaki globalne:

source: .af.mil: :heaven.af.mil
pl: .pld.org.pl: :niebo.pld.org.pl

source: Here any address ending with B<.af.mil> (but not B<af.mil> itself) is routed by its MX records; any other address is artificially routed to B<heaven.af.mil>.
pl: Tutaj każdy adres kończący się na B<.pld.org.pl> (lecz nie sam B<pld.org.pl>) jest kierowany przez odpowiednie rekordy MX; każdy inny adres jest sztucznie kierowany do B<niebo.pld.org.pl>.

source: The B<qmail> system does not protect you if you create an artificial mail loop between machines. However, you are always safe using I<smtproutes> if you do not accept mail from the network.
pl: System B<qmail> nie zabezpiecza przed utworzeniem sztucznej pętli pocztowej pomiędzy maszynami. Jednakże I<smtproutes> jest zawsze bezpiecznie używane, jeśli nie jest akceptowana poczta z sieci.

source: Number of seconds B<qmail-remote> will wait for the remote SMTP server to accept a connection. Default: 60. The kernel normally imposes a 75-second upper limit.
pl: Liczba sekund, przez którą B<qmail-remote> będzie czekać na zaakceptowanie połączenia przez zdalny serwer SMTP. Domyślnie: 60. Jądro normalnie przeznacza na to limit najwyżej 75-sekundowy.

source: Number of seconds B<qmail-remote> will wait for each response from the remote SMTP server. Default: 1200.
pl: Liczba sekund, przez którą B<qmail-remote> będzie czekać na każdą odpowiedź od zdalnego serwera SMTP. Domyślnie: 1200.

source: SEE ALSO
pl: ZOBACZ TAKŻE
