Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/qmail-send.8.po
Languages: pl

source: NAME
pl: NAZWA

source: qmail-send - deliver mail messages from the queue
pl: qmail-send - dostarcza skolejkowane wiadomości pocztowe

source: SYNOPSIS
pl: SKŁADNIA

source: DESCRIPTION
pl: OPIS

source: B<qmail-send> handles messages placed into the outgoing queue by B<qmail-queue>. It uses B<qmail-lspawn> to deliver messages to local recipients and B<qmail-rspawn> to deliver messages to remote recipients. If a message is temporarily undeliverable to one or more addresses, B<qmail-send> leaves it in the queue and tries the addresses again later.
pl: B<qmail-send> obsługuje wiadomości umiejscowione w kolejce wyjściowej przy użyciu B<qmail-queue>. Używa B<qmail-lspawn>, by doręczyć wiadomości odbiorcom lokalnym, i B<qmail-rspawn>, by doręczyć wiadomości odbiorcom odległym. Jeśli wiadomość chwilowo nie może być doręczona do jednego lub więcej adresów, B<qmail-send> pozostawia ją w kolejce i spróbuje obsłużyć te adresy później.

source: B<qmail-send> prints a readable record of its activities to descriptor 0. It writes commands to B<qmail-lspawn>, B<qmail-rspawn>, and B<qmail-clean> on descriptors 1, 3, and 5, and reads responses from descriptors 2, 4, and 6. B<qmail-send> is responsible for avoiding deadlock.
pl: B<qmail-send> drukuje odczytywalny rekord swoich działań na deskryptorze 0. Zapisuje komendy do B<qmail-lspawn>, B<qmail-rspawn> i B<qmail-clean> na deskryptorach 1, 3 oraz 5, a czyta odpowiedzi z deskryptorów 2, 4 oraz 6. B<qmail-send> jest odpowiedzialny za zapobieganie blokadom.

source: If B<qmail-send> receives a TERM signal, it will exit cleanly, after waiting (possibly more than a minute) for current delivery attempts to finish.
pl: Jeśli B<qmail-send> odbierze sygnał TERM, to poprawnie zakończy działanie, po odczekaniu (możliwe, że więcej niż minutę) na wysłanie wszystkich obecnie wysyłanych wiadomości.

source: If B<qmail-send> receives an ALRM signal, it will reschedule every message in the queue for immediate delivery.
pl: Jeśli B<qmail-send> odbierze sygnał ALRM, to przeszereguje każdą czekającą wiadomość tak, żeby była dostarczona natychmiast.

source: CONTROL FILES
pl: PLIKI KONTROLNE

source: B<WARNING:> B<qmail-send> reads its control files only when it starts. If you change the control files, you must stop and restart B<qmail-send>. Exception: If B<qmail-send> receives a HUP signal, it will reread I<locals> and I<virtualdomains>.
pl: B<OSTRZEŻENIE:> B<qmail-send> czyta pliki kontrolne tylko podczas startu. Aby zmienić pliki kontrolne, należy zatrzymać i wznowić działanie B<qmail-send>. Wyjątek: Jeśli B<qmail-send> odbierze sygnał HUP, odczyta ponownie pliki I<locals> i I<virtualdomains>.

source: Bounce username. Default: B<MAILER-DAEMON>.
pl: Nazwa użytkownika, którą opatrywane będą wiadomości odbite. Domyślnie: B<MAILER-DAEMON>.

source: Bounce host. Default: I<me>, if that is supplied; otherwise the literal name B<bouncehost>, which is probably not what you want. If a message is permanently undeliverable, B<qmail-send> sends a B<single-bounce> notice back to the message's envelope sender. The notice is B<From: >I<bouncefrom>B<@>I<bouncehost>, although its envelope sender is empty.
pl: Nazwa hosta, którą opatrywane będą wiadomości odbite. Domyślnie: I<me>, jeśli to ustawiono; w przeciwnym razie literalna nazwa B<bouncehost>, która najprawdopodobniej nie jest tym, co powinno być. Jeśli całkowicie niemożliwe jest dostarczenie wiadomości, to B<qmail-send> wysyła powiadomienie B<single-bounce> do kopertowego nadawcy wiadomości. Powiadomienie to jest B<From: >I<bouncefrom>B<@>I<bouncehost>, chyba że kopertowy nadawca jest pusty.

source: Maximum number of simultaneous local delivery attempts. Default: 10. If 0, local deliveries will be put on hold. I<concurrencylocal> is limited at compile time to 120.
pl: Maksymalna liczba niezależnych prób dostarczeń lokalnych. Domyślnie: 10. Jeśli 0, lokalne dostarczenia będą zawieszone. Wartość I<concurrencylocal> jest ograniczona podczas kompilacji do 120.

source: Maximum number of simultaneous remote delivery attempts. Default: 20. If 0, remote deliveries will be put on hold. I<concurrencyremote> is limited at compile time to 120.
pl: Maksymalna liczba niezależnych prób dostarczeń zdalnych. Domyślnie: 20. Jeśli 0, zdalne dostarczenia będą zawieszone. Wartość I<concurrencyremote> jest ograniczona podczas kompilacji do 120.

source: Double-bounce host. Default: I<me>, if that is supplied; otherwise the literal name B<doublebouncehost>, which is probably not what you want.
pl: Nazwa hosta dla podwójnego odbicia. Domyślnie: I<me>, jeśli jest ustawione; w przeciwnym wypadku literalna nazwa B<doublebouncehost>, co pewnie nie jest właściwym zachowaniem.

source: User to receive double-bounces. Default: B<postmaster>. If a single-bounce notice is permanently undeliverable, B<qmail-send> sends a B<double-bounce> notice to I<doublebounceto>B<@>I<doublebouncehost>. (If that bounces, B<qmail-send> gives up.)
pl: Użytkownik odbierający podwójne odbicia. Domyślnie: B<postmaster>. Jeśli dostarczenie informacji o pojedynczym odbiciu jest całkowicie niemożliwe, B<qmail-send> przesyła zawiadomienie określane jako B<podwójne-odbicie> do I<doublebounceto>B<@>I<doublebouncehost>. (Jeśli to też się odbije, B<qmail-send> się poddaje.)

source: Presumed domain name for addresses without @ signs. Default: I<me>, if that is supplied; otherwise the literal name B<envnoathost>, which is probably not what you want. If B<qmail-send> sees an envelope recipient address without an @ sign, it appends B<@>I<envnoathost>.
pl: Przypuszczalna nazwa domeny dla adresów bez znaku @. Domyślnie: I<me>, jeśli plik ten istnieje i jest odpowiednio ustawiony; w przeciwnym razie literalna nazwa B<envnoathost>, która pewnie nie jest tym, co powinno być. Jeśli B<qmail-send> widzi adres kopertowego odbiorcy bez znaku @, to dodaje B<@>I<envnoathost>.

source: List of domain names that the current host receives mail for, one per line. Default: I<me>, if that is supplied; otherwise B<qmail-send> refuses to run. An address I<user@domain> is considered local if I<domain> is listed in I<locals>.
pl: Lista nazw domen, dla których ten host odbiera pocztę, jedna nazwa domeny na linię. Domyślnie: I<me>, jeśli jest to ustawione; w przeciwnym wypadku B<qmail-send> odmawia uruchomienia się. Adres I<użytkownik@domena> jest rozważany jako lokalny, jeśli I<domena> jest podana w pliku I<locals>.

source: List of domain names where the percent hack is applied. If I<domain> is listed in I<percenthack>, any address of the form I<user%fqdn@domain> is rewritten as I<user@fqdn>. I<user> may contain %, so the percent hack may be applied repeatedly. B<qmail-send> handles I<percenthack> before I<locals>.
pl: Lista nazw domen, dla których działa rozbijanie procentów. Jeśli I<domena> jest wyszczególniona w pliku I<percenthack>, to każdy adres w formie I<użytkownik%fqdn@domena> jest przepisywany jako I<użytkownik@fqdn>. I<użytkownik> może zawierać %, więc rozbijanie procentów może być gdzieś potem przeprowadzone ponownie. B<qmail-send> obsługuje plik I<percenthack> przed plikiem I<locals>.

source: Number of seconds a message can stay in the queue. Default: 604800 (one week). After this time expires, B<qmail-send> will try the message once more, but it will treat any temporary delivery failures as permanent failures.
pl: Liczba sekund, przez którą wiadomość może pozostać w kolejce. Domyślnie: 604800 (tydzień). Po tym czasie wiadomość wygasa, B<qmail-send> spróbuje ją jeszcze raz wysłać, ale potraktuje każdą tymczasową awarię dostarczania jako awarię trwałą.

source: List of virtual users or domains, one per line. A virtual user has the form I<user>B<@>I<domain>B<:>I<prepend>, without any extra spaces. When B<qmail-send> sees the recipient address I<user>B<@>I<domain>, it converts it to I<prepend>B<->I<user>B<@>I<domain> and treats it as local.
pl: Lista wirtualnych użytkowników lub domen, jeden wpis na linię. Wirtualny użytkownik ma postać I<użytkownik>B<@>I<domena>B<:>I<dodatek>, bez żadnych dodatkowych spacji. Gdy B<qmail-send> widzi adres odbiorcy I<użytkownik>B<@>I<domena>, to konwertuje go do postaci I<dodatek>B<->I<użytkownik>B<@>I<domena> i traktuje wiadomość jako lokalną.

source: A virtual domain has the form I<domain>B<:>I<prepend>. It applies to any recipient address at I<domain>. For example, if
pl: Wirtualna domena jest w postaci I<domena>B<:>I<dodatek>. Odnosi się do każdego adresu odbiorcy w I<domenie>. Na przykład

source: nowhere.mil:joe-foo
pl: nigdzie.mil:jasiek-foo

source: is in I<virtualdomains>, and a message arrives for B<info@nowhere.mil>, B<qmail-send> will rewrite the recipient address as B<joe-foo-info@nowhere.mil> and deliver the message locally.
pl: istnieje wI<virtualdomains> i wiadomość przybędzie zaadresowana do B<info@nigdzie.mil>, to wtedy B<qmail-send> przepisze adres jej odbiorcy jako B<jasiek-foo-info@nigdzie.mil> i dostarczy wiadomość lokalnie.

source: I<virtualdomains> may contain wildcards:
pl: Plik I<virtualdomains> może zawierać znaki globalne:

source: .fax:uucp-fax :alias-catchall .nowhere.mil:joe-foo-host
pl: .fax:uucp-fax :alias-catchall .nigdzie.mil:jasiek-foo-host

source: I<virtualdomains> may also contain exceptions: an empty I<prepend> means that I<domain> is not a virtual domain.
pl: I<virtualdomains> może też zawierać wyjątki: pusty I<dodatek> oznacza, że I<domena> nie jest domeną wirtualną.

source: B<qmail-send> handles I<virtualdomains> after I<locals>: if a domain is listed in I<locals>, I<virtualdomains> does not apply.
pl: B<qmail-send> obsługuje plik I<virtualdomains> po pliku I<locals>: jeśli więc podana domena jest wpisana do pliku I<locals>, to umieszczenie jej w I<virtualdomains> nie zadziała.

source: SEE ALSO
pl: ZOBACZ TAKŻE
