Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/route.8.po
Languages: pl

source: Linux Programmer's Manual
pl: Podręcznik programisty Linuksa

source: NAME
pl: NAZWA

source: route - show / manipulate the IP routing table
pl: route - pokazuje / obsługuje tablicę trasowania protokołu IP

source: SYNOPSIS
pl: SKŁADNIA

source: [B<-v>] [B<-A> family] B<add> [B<-net>|B<-host>] target [B<netmask> Nm] [B<gw> Gw] [B<metric> N] [B<mss> M] [B<window> W] [B<irtt> I] [B<reject>] [B<mod>] [B<dyn>] [B<reinstate>] [[B<dev>] If]
pl: [B<-v>] [B<-A> I<rodzina>] B<add> [B<-net>|B<-host>] I<cel> [B<netmask> I<maska>] [B<gw> I<brama>] [B<metric> I<metryka>] [B<mss> I<rozmiar>] [B<window> I<okno>] [B<irtt> I<czas>] [B<reject>] [B<mod>] [B<dyn>] [B<reinstate>] [[B<dev>] I<interfejs>]

source: [B<-v>] [B<-A> family] B<del> [B<-net>|B<-host>] target [B<gw> Gw] [B<netmask> Nm] [B<metric> N] [[B<dev>] If]
pl: [B<-v>] [B<-A> I<rodzina>] B<del> [B<-net>|B<-host>] I<cel> [B<gw> I<brama>] [B<netmask> I<maska>] [B<metric> I<metryka>] [[B<dev>] I<urządzenie>]

source: DESCRIPTION
pl: OPIS

source: B<Route> manipulates the kernel's IP routing tables. Its primary use is to set up static routes to specific hosts or networks via an interface after it has been configured with the B<ifconfig>(8) program.
pl: B<Route> obsługuje jądrowe tablice trasowania protokołu IP. Jego podstawowym zadaniem jest ustawianie B<statycznych> tras do określonych stacji lub sieci poprzez interfejs, skonfigurowany programem B<ifconfig>(8).

source: When the B<add> or B<del> options are used, B<route> modifies the routing tables. Without these options, B<route> displays the current contents of the routing tables.
pl: Jeśli wykorzystywane są opcje B<add> lub B<del>, B<route> modyfikuje tablice trasowań. Bez tych opcji program wyświetla obecną zawartość tablic trasowania.

source: OPTIONS
pl: OPCJE

source: B<-A family>
pl: B<-A> I<rodzina>

source: use the specified address family (eg `inet'; use `route --help' for a full list).
pl: używa podanej rodziny adresów (np. "inet"; polecenie "route --help" wyświetli pełną listę).

source: operate on the kernel's FIB (Forwarding Information Base) routing table. This is the default.
pl: działa na jądrowej tablicy trasowania FIB (Forwarding Information Base: Baza Informacji Przerzutowych). Jest to opcja domyślna.

source: operate on the kernel's routing cache.
pl: działa na jądrowym buforze podręcznym trasowania

source: select verbose operation.
pl: wybiera szczegółowe wypisywanie informacji.

source: show numerical addresses instead of trying to determine symbolic host names. This is useful if you are trying to determine why the route to your nameserver has vanished.
pl: pokazuje adresy numeryczne zamiast nazw. Jest to przydatne jeśli próbuje się określić dlaczego trasa do serwera nazw wyparowała.

source: use B<netstat>(8)-format for displaying the routing table. B<-ee> will generate a very long line with all parameters from the routing table.
pl: używa formatu B<netstat>(8) do wyświetlania tablicy trasowania. B<-ee> generuje bardzo długie wiersze ze wszystkimi parametrami z tablicy trasowania.

source: delete a route.
pl: kasuje trasę.

source: add a new route.
pl: dodaje nową trasę.

source: B<target>
pl: B<cel>

source: the destination network or host. You can provide IP addresses in dotted decimal or host/network names.
pl: docelowa sieć lub stacja. Można podać adres IP w notacji kropkowej lub nazwę stacji/sieci.

source: the B<target> is a network.
pl: oznacza, że B<cel> jest siecią

source: the B<target> is a host.
pl: oznacza, że B<cel> jest stacją.

source: B<netmask NM>
pl: B<netmask> I<maska>

source: when adding a network route, the netmask to be used.
pl: podczas dodawania trasy sieciowej używana jest maska-sieci.

source: B<gw GW>
pl: B<gw> I<brama>

source: route packets via a gateway. B<NOTE:> The specified gateway must be reachable first. This usually means that you have to set up a static route to the gateway beforehand. If you specify the address of one of your local interfaces, it will be used to decide about the interface to which the packets should be routed to. This is a BSDism compatibility hack.
pl: trasuje pakiety poprzez bramkę (gateway). B<UWAGA:> Podana bramka musi być wpierw osiągalna. Oznacza to zwykle, że trzeba mieć ustawioną do niej wcześniej statyczną trasę. Jeśli poda się adres jednego ze swoich lokalnych interfejsów, to zostanie on użyty do zdecydowania o interfejsie, do którego trasować pakiety. Jest to kompatybilność w kierunku BSD.

source: B<metric M>
pl: B<metric> I<metryka>

source: set the metric field in the routing table (used by routing daemons) to M.
pl: ustawia pole metric tablicy trasowania (używane przez demony trasowania) na M. [bywa ono używane do obliczania kosztu trasy, zależnego od liczby hostów na drodze i manipulacji administratora--przyp. tłum.]

source: B<mss M>
pl: B<mss> I<rozmiar>

source: set the TCP Maximum Segment Size (MSS) for connections over this route to M bytes. The default is the device MTU minus headers, or a lower MTU when path mtu discovery occurred. This setting can be used to force smaller TCP packets on the other end when path mtu discovery does not work (usually because of misconfigured firewalls that block ICMP Fragmentation Needed)
pl: ustawia dla połączeń na tej trasie maksymalny rozmiar segmentu TCP (MSS) na M bajtów. Domyślną wartością jest MTU minus nagłówki lub niższe MTU, gdy zajdzie ścieżkowe wynalezienie mtu. Ustawienie to może być wykorzystywane do wymuszania mniejszych pakietów TCP na drugim końcu gdy ścieżkowe wynajdowanie mtu nie działa (zwykle z powodu źle skonfigurowanych zapór ogniowych, blokujących ICMP Fragmentation Needed).

source: B<window W>
pl: B<window> I<okno>

source: set the TCP window size for connections over this route to W bytes. This is typically only used on AX.25 networks and with drivers unable to handle back to back frames.
pl: ustawia dla połączeń tej trasy rozmiar okna TCP na W bajtów. Jest to zwykle używane jedynie w sieciach AX.25 i ze sterownikami, nie potrafiącymi obsługiwać ramek back to back.

source: B<irtt I>
pl: B<irtt> I<czas>

source: set the initial round trip time (irtt) for TCP connections over this route to I milliseconds (1-12000). This is typically only used on AX.25 networks. If omitted the RFC 1122 default of 300ms is used.
pl: ustawia początkowy czas przelotu (initial round trip time, irtt) dla połączeń TCP na tej trasie na I milisekund (1-12000). Jest to zwykle wykorzystywane jedynie w sieciach AX.25. Domyślnie przyjmuje się wartość z RFC 1122, 300ms.

source: install a blocking route, which will force a route lookup to fail. This is for example used to mask out networks before using the default route. This is NOT for firewalling.
pl: instaluje trasę blokującą, która wymusza niepowodzenie podejrzenia trasy. Jest to używane na przykład do maskowania sieci przed używaniem trasy domyślnej. Nie jest to zapora ogniowa.

source: B<mod, dyn, reinstate>
pl: B<mod>, B<dyn>, B<reinstate>

source: install a dynamic or modified route. These flags are for diagnostic purposes, and are generally only set by routing daemons.
pl: instaluje trasę dynamiczną lub zmodyfikowaną. Flagi te są przeznaczone dla celów diagnostycznych i ogólnie są ustawiane tylko przez demony trasowania.

source: B<dev If>
pl: B<dev> I<urządzenie>

source: force the route to be associated with the specified device, as the kernel will otherwise try to determine the device on its own (by checking already existing routes and device specifications, and where the route is added to). In most normal networks you won't need this.
pl: wymusza związanie trasy z podanym urządzeniem. W przeciwnym przypadku, jądro spróbuje określić urządzenie samodzielnie (sprawdzając istniejące już trasy i specyfikacje urządzeń). W większości normalnych sieci nie potrzeba tego.

source: If B<dev If> is the last option on the command line, the word B<dev> may be omitted, as it's the default. Otherwise the order of the route modifiers (metric - netmask - gw - dev) doesn't matter.
pl: Jeśli B<dev> I<urządzenie> jest ostatnią opcją linii poleceń, to słowo B<dev> może zostać pominięte, gdyż jest przyjmowane za domyślne. W przeciwnym przypadku, kolejność modyfikatorów trasy (metric - netmask - gw - dev) nie ma znaczenia.

source: EXAMPLES
pl: PRZYKŁADY

source: adds the normal loopback entry, using netmask 255.0.0.0 and associated with the "lo" device (assuming this device was previously set up correctly with B<ifconfig>(8)).
pl: dodaje normalny wpis zapętlenia używający maski sieciowej 255.0.0.0, związany z urządzeniem "lo" (zakładamy, że urządzenie to zostało wcześniej poprawnie skonfigurowane programem B<ifconfig>(8)).

source: adds a route to the local network 192.56.76.x via "eth0". The word "dev" can be omitted here.
pl: dodaje trasę do sieci 192.56.76.x poprzez "eth0". Słowo "dev" można pominąć.

source: deletes the current default route, which is labeled "default" or 0.0.0.0 in the destination field of the current routing table.
pl: usuwa bieżącą trasę domyślną określoną etykietą "default" lub 0.0.0.0 w polu docelowym bieżącej tabeli trasowania.

source: adds a default route (which will be used if no other route matches). All packets using this route will be gatewayed through "mango-gw". The device which will actually be used for that route depends on how we can reach "mango-gw" - the static route to "mango-gw" will have to be set up before.
pl: dodaje domyślną trasę (która będzie używana gdy nie będzie pasować żadna inna trasa). Wszystkie pakiety używające tej trasy będą bramkowane przez "mango-gw". Urządzenie używane do tej trasy zależy od tego, jak osiągamy "mango-gw" - wcześniej należy więc skonfigurować trasę do "mango-gw".

source: Adds the route to the "ipx4" host via the SLIP interface (assuming that "ipx4" is the SLIP host).
pl: Dodaje trasę do stacji "ipx4" poprzez interfejs SLIP (zakładamy, że "ipx4" jest stacją SLIP).

source: This command adds the net "192.57.66.x" to be gatewayed through the former route to the SLIP interface.
pl: Polecenie to dodaje sieć "192.57.66.x" do tras bramkowanych przez poprzednią trasę przez interfejs SLIP.

source: This is an obscure one documented so people know how to do it. This sets all of the class D (multicast) IP routes to go via "eth0". This is the correct normal configuration line with a multicasting kernel.
pl: Jest to bardzo dobrze udokumentowane, więc wszystko powinno być jasne. Ustawiane są wszystkie trasy IP klasy D (grupowe--multicast) na "eth0". Jest to prawidłowa normalna linia konfiguracji dla jądra grupowującego.

source: This installs a rejecting route for the private network "10.x.x.x."
pl: Instaluje to trasę odrzucającą dla sieci prywatnej "10.x.x.x".

source: OUTPUT
pl: WYJŚCIE

source: The output of the kernel routing table is organized in the following columns
pl: Wyprowadzanie tablic trasowania jest organizowane w następujące kolumny

source: The destination network or destination host.
pl: Sieć docelowa lub stacja docelowa.

source: The gateway address or '*' if none set.
pl: Adres bramki lub "*" gdy jej nie ma.

source: The netmask for the destination net; '255.255.255.255' for a host destination and '0.0.0.0' for the B<default> route.
pl: Maska sieci do sieci docelowej; "255.255.255.255" dla celu stacji i "0.0.0.0" dla trasy B<domyślnej>.

source: Possible flags include
pl: Dopuszczalne flagi to

source: B<U> (route is B<up>)
pl: B<U> (trasa jest zestawiona [B<up>])

source: B<H> (target is a B<host>)
pl: B<H> (cel jest stacją [B<host>])

source: B<G> (use B<gateway>)
pl: B<G> (używa bramki [B<gateway>])

source: B<R> (B<reinstate> route for dynamic routing)
pl: B<R> (przywraca trasę na trasowanie dynamiczne [B<reinstate>])

source: B<D> (B<dynamically> installed by daemon or redirect)
pl: B<D> (B<dynamicznie> instalowana przez demona lub przekierowanie)

source: B<M> (B<modified> from routing daemon or redirect)
pl: B<M> (B<modyfikowana> z demona trasowania lub przekierowania)

source: B<A> (installed by B<addrconf>)
pl: B<A> (instalowana przez B<addrconf>)

source: B<C> (B<cache> entry)
pl: B<C> (wpis bufora podręcznego [B<cache>])

source: B<!> (B<reject> route)
pl: B<!> (trasa odrzucenia [B<reject>])

source: The 'distance' to the target (usually counted in hops). It is not used by recent kernels, but may be needed by routing daemons.
pl: "Odległość" do celu (zwykle liczona w przeskokach). Nie jest używana w nowych jądrach, lecz może być wymagana dla demonów trasowania.

source: Number of references to this route. (Not used in the Linux kernel.)
pl: Liczba referencji do tej trasy. (Nie używane w jądrze Linux).

source: Count of lookups for the route. Depending on the use of -F and -C this will be either route cache misses (-F) or hits (-C).
pl: Liczba podglądnięć trasy (lookups). Zależnie od użycia -F i -C będą to chybienia bufora podręcznego trasowania (-F) lub trafienia (-C).

source: Interface to which packets for this route will be sent.
pl: Interfejs, przez który przesyłane są pakiety tej trasy.

source: Default maximum segment size for TCP connections over this route.
pl: Domyślny maksymalny rozmiar segmentu dla połączeń TCP na tej trasie.

source: Default window size for TCP connections over this route.
pl: Domyślny rozmiar okna dla połączeń TCP na tej trasie.

source: Initial RTT (Round Trip Time). The kernel uses this to guess about the best TCP protocol parameters without waiting on (possibly slow) answers.
pl: Początkowy czas przelotu (RTT-Round Trip Time). Jądro używa tego do zgadywania najlepszych parametrów protokołu TCP bez oczekiwania na (powolne) odpowiedzi.

source: B<HH (cached only)>
pl: B<HH> (tylko buforowane)

source: The number of ARP entries and cached routes that refer to the hardware header cache for the cached route. This will be -1 if a hardware address is not needed for the interface of the cached route (e.g. lo).
pl: Liczba wpisów ARP i tras buforowanych, odnoszących się do sprzętowego bufora nagłówkowego (hardware header cache) buforowanej trasy. Będzie to -1 jeśli adres sprzętowy nie jest wymagany dla interfejsu buforowanej trasy (np. lo).

source: B<Arp (cached only)>
pl: B<Arp> (tylko buforowane)

source: Whether or not the hardware address for the cached route is up to date.
pl: Czy adres sprzętowy buforowanej trasy jest aktualny.

source: FILES
pl: PLIKI

source: SEE ALSO
pl: ZOBACZ TAKŻE

source: I<ifconfig(8), netstat(8), arp(8), rarp(8)>
pl: B<ifconfig>(8), B<netstat>(8), B<arp>(8), B<rarp>(8)

source: HISTORY
pl: HISTORIA

source: B<Route> for Linux was originally written by Fred N. van Kempen, E<lt>waltje@uwalt.nl.mugnet.orgE<gt> and then modified by Johannes Stille and Linus Torvalds for pl15. Alan Cox added the mss and window options for Linux 1.1.22. irtt support and merged with netstat from Bernd Eckenfels.
pl: B<Route> do Linuksa zostało napisane pierwotnie przez Freda N. van Kempena, E<lt>waltje@uwalt.nl.mugnet.orgE<gt>, a następnie zostało zmodyfikowane przez Johannesa Stille'a oraz Linusa Torvaldsa do pl15. Alan Cox dodał opcje mss oraz window do Linuksa 1.1.22. Wsparcie irtt i połączenie z netstatem pochodzi od Bernda Eckenfelsa.

source: AUTHOR
pl: AUTOR

source: Currently maintained by Phil Blundell E<lt>Philip.Blundell@pobox.comE<gt> and Bernd Eckenfels E<lt>net-tools@lina.inka.deE<gt>.
pl: Obecnie opiekunem jest Phil Blundell E<lt>Philip.Blundell@pobox.comE<gt> i Bernd Eckenfels E<lt>net-tools@lina.inka.deE<gt>.
