Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/shutdown.8.po
Languages: fr, pl

source: The B<-H> option just sets the I<init> environment variable I<INIT_HALT> to I<HALT>, and the B<-P> option just sets that variable to I<POWEROFF>. The script (usually /etc/init.d/halt) that calls the B<halt>(8) program as the last thing in the shutting down sequence should check this environment variable and call the B<halt>(8) program with the right options for these options to actually have any effect.
fr: L'option B<-H> ne fait que positionner la variable d'environnement I<INIT_HALT> d'I<init> à la valeur I<HALT> et l'option B<-P> la positionne à la valeur I<POWEROFF>. Le script d'extinction (habituellement I</etc/init/halt>) qui appelle B<halt>(8) à la fin de la séquence d'arrêt devrait vérifier cette variable et appeler B<halt>(8) avec les bonnes options pour que ces options aient un effet.

source: FILES
fr: FICHIERS
pl: PLIKI

source: A lot of users forget to give the I<time> argument and are then puzzled by the error message B<shutdown> produces. The I<time> argument is mandatory; in 90 percent of all cases this argument will be the word B<now>.
fr: Beaucoup d'utilisateurs oublient de donner le paramètre I<heure> et sont ensuite intrigués par le message d'erreur produit par B<shutdown>. Le paramètre I<heure> est obligatoire ; dans 90 % des cas, ce sera le mot B<now>.
pl: Wielu użytkowników zapomina o podaniu argumentu I<czas> i jest zakłopotana komunikatem o błędzie dawanym przez B<shutdown>. Argument I<czas> jest obowiązkowy; w 90 procentach przypadków argumentem tym będzie słowo B<now>.

source: Init can only capture CTRL-ALT-DEL and start shutdown in console mode. If the system is running the X window System, the X server processes all key strokes. Some X11 environments make it possible to capture CTRL-ALT-DEL, but what exactly is done with that event depends on that environment.
fr: B<Init> ne peut capturer CTRL-ALT-SUPPR et exécuter B<shutdown> qu'en mode console. Si le système exécute le système X Window, le serveur X gère toutes les frappes au clavier. Certains environnements X11 permettent de capturer CTRL-ALT-SUPPR, mais ce qui est fait exactement dépend de l'environnement.
pl: Init może przechwycić CTRL-ALT-DEL i rozpocząć wyłączenia jedynie w trybie konsolowym. Jeśli działa X Window System, to serwer X przetwarza wszystkie wciskane klawisze. Niektóre środowiska X11 umożliwiają przechwycenie kombinacji CTRL-ALT-DEL, ale to, co dokładnie stanie się po użyciu tej sekwencji, zależy od danego środowiska.

source: Shutdown wasn't designed to be run setuid. /etc/shutdown.allow is not used to find out who is executing shutdown, it ONLY checks who is currently logged in on (one of the) console(s).
fr: B<Shutdown> n'a pas été conçu pour être exécuté dans le mode Setuid. I</etc/shutdown.allow> n'est pas utilisé pour vérifier qui exécute B<shutdown>, il ne fait QUE vérifier qui est actuellement connecté sur la (une des) console(s).
pl: Shutdown nie jest zaprojektowany do działania z setuid. Plik /etc/shutdown.allow nie jest używany w odniesieniu do osoby wykonującej shutdown, sprawdza on JEDYNIE kto jest aktualnie zalogowany na konsoli/jednej z konsol.

source: AUTHOR
fr: AUTEUR
pl: AUTOR

source: SYNOPSIS
pl: SKŁADNIA

source: DESCRIPTION
pl: OPIS

source: OPTIONS
pl: OPCJE

source: Halt or power off after shutdown.
pl: Zatrzymuje lub wyłącza komputer po zamknięciu systemu.

source: Halt action is to turn off the power.
pl: Czynnością podejmowaną przy zatrzymaniu systemu jest wyłączenie komputera.

source: Modifier to the -h flag. Halt action is to halt or drop into boot monitor on systems that support it. Must be used with the -h flag.
pl: Modyfikator do opcji B<-h>. Komputer jest zatrzymywany lub przełącza się do programu monitorującego rozruch (ang. boot monitor), w systemach które to obsługują. Musi być użyte z opcją B<-h>.

source: B<-t> I<sec>
pl: B<-t> I<sek>

source: Tell B<init>(8) to wait I<sec> seconds between sending processes the warning and the kill signal, before changing to another runlevel.
pl: Nakazuje programowi B<init>(8) odczekanie I<sek> sekund pomiędzy wysłaniem procesom ostrzeżenia i sygnału kill a zmianą na inny poziom pracy.

source: The B<-H> option just sets the I<init> environment variable I<INIT_HALT> to I<HALT>, and the B<-P> option just sets that variable to I<POWEROFF>. The shutdown script that calls B<halt>(8) as the last thing in the shutdown sequence should check these environment variables and call B<halt>(8) with the right options for these options to actually have any effect. Debian 3.1 (sarge) supports this.
pl: Opcja B<-H> ustawia jedynie zmienną środowiskową B<INIT_HALT> programu B<init> na B<HALT>, natomiast opcja B<-P> ustawia ją na B<POWEROFF>. Skrypt shutdown, który wywołuje B<halt>(8), jako ostatnią rzecz w sekwencji wyłączającej, powinien sprawdzić te zmienne środowiskowe i wywołać B<halt>(8) z prawidłowymi opcjami, aby miały one jakiekolwiek znaczenie. Debian 3.1 (sarge) obsługuje to.

source: NOTES
pl: UWAGI
