Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/shutdown.8.po
Languages: fr, pl

source: NAME
fr: NOM
pl: NAZWA

source: shutdown - Halt, power-off or reboot the machine
fr: shutdown - Arrêter, éteindre ou redémarrer la machine

source: B<shutdown> [OPTIONS...] [TIME] [WALL...]
fr: B<shutdown> [options...] [heure] [avertissement...]

source: B<shutdown> may be used to halt, power-off or reboot the machine\&.
fr: B<shutdown> peut être utilisé pour arrêter, éteindre ou redémarrer la machine\&.

source: The first argument may be a time string (which is usually "now")\&. Optionally, this may be followed by a wall message to be sent to all logged-in users before going down\&.
fr: Le premier argument peut être une chaîne d’indication d’heure (couramment « now »)\&. Facultativement, il peut être suivi d’un message d’avertissement à envoyer à tous les utilisateurs connectés avant la mise à l’arrêt\&.

source: The time string may either be in the format "hh:mm" for hour/minutes specifying the time to execute the shutdown at, specified in 24h clock format\&. Alternatively it may be in the syntax "+m" referring to the specified number of minutes m from now\&. "now" is an alias for "+0", i\&.e\&. for triggering an immediate shutdown\&. If no time argument is specified, "+1" is implied\&.
fr: La chaîne d’heure peut être précisée, soit dans le format « hh:mm » pour heures/minutes précisant le moment d’exécution, au format 24 h, soit avec la syntaxe « +m » indiquant le nombre I<m> de minutes à partir de maintenant (now)\&. « now » est un alias pour I<+0>, c'est-à-dire un arrêt immédiat\&. Si aucune indication d’heure n’est fournie, I<+1> est implicite\&.

source: Note that to specify a wall message you must specify a time argument, too\&.
fr: Notez que pour indiquer un message d’avertissement, une indication d’heure doit être aussi fournie\&.

source: If the time argument is used, 5 minutes before the system goes down the /run/nologin file is created to ensure that further logins shall not be allowed\&.
fr: Si un argument d’heure est utilisé, cinq minutes avant l’arrêt du système, le fichier I</run/nologin> est créé pour assurer que des connexions futures ne seront pas autorisées\&.

source: The following options are understood:
fr: Les options suivantes sont comprises :

source: Print a short help text and exit\&.
fr: Afficher un aide-mémoire succinct et quitter\&.

source: Halt the machine\&.
fr: Arrêter la machine\&.

source: Power-off the machine (the default)\&.
fr: Mettre hors tension de la machine (comportement par défaut)\&.

source: Reboot the machine\&.
fr: Redémarrer la machine\&.

source: Equivalent to B<--poweroff>, unless B<--halt> is specified\&.
fr: Équivalent à B<--poweroff>, à moins que B<--halt> ne soit précisé\&.

source: Do not halt, power-off, reboot, just write wall message\&.
fr: Ne pas arrêter, éteindre ou redémarrer la machine, écrire seulement un message d’avertissement\&.

source: Do not send wall message before halt, power-off, reboot\&.
fr: Ne pas envoyer de message d’avertissement avant l’arrêt, l’extinction ou le redémarrage\&.

source: Cancel a pending shutdown\&. This may be used to cancel the effect of an invocation of B<shutdown> with a time argument that is not "+0" or "now"\&.
fr: Annuler un arrêt programmé\&. Cela peut être utiliser pour annuler l’effet d’une invocation de B<shutdown> avec un argument de temps qui n’est pas I<+0> ou I<now>\&.

source: EXIT STATUS
fr: CODE DE RETOUR

source: On success, 0 is returned, a non-zero failure code otherwise\&.
fr: En cas de succès, B<0> est renvoyé, autrement, un code d'échec non nul est renvoyé\&.

source: SEE ALSO
fr: VOIR AUSSI
pl: ZOBACZ TAKŻE

source: November 12, 2003
fr: 12 novembre 2003
pl: 12 listopada 2003

source: Linux System Administrator's Manual
fr: Manuel de l’Administrateur de Système Linux
pl: Podręcznik administratora systemu Linux

source: shutdown - bring the system down
fr: shutdown - Arrêter le système
pl: shutdown - wyłącza system

source: B</sbin/shutdown> [B<-akrhPHfFnc>] [B<-t> I<sec>] I<time> [I<warning message>]
fr: B</sbin/shutdown> [B<-akrhPHfFnc>] [B<-t> I<sec>] I<heure> [I<avertissement>]
pl: B</sbin/shutdown> [B<-akrhPHfFnc>] [B<-t> I<sek>] I<czas> [I<ostrzeżenie>]

source: B<shutdown> brings the system down in a secure way. All logged-in users are notified that the system is going down, and B<login>(1) is blocked. It is possible to shut the system down immediately or after a specified delay. All processes are first notified that the system is going down by the signal \s-2SIGTERM\s0. This gives programs like B<vi>(1) the time to save the file being edited, mail and news processing programs a chance to exit cleanly, etc. B<shutdown> does its job by signalling the B<init> process, asking it to change the runlevel. Runlevel B<0> is used to halt the system, runlevel B<6> is used to reboot the system, and runlevel B<1> is used to put to system into a state where administrative tasks can be performed; this is the default if neither the I<-h> or I<-r> flag is given to B<shutdown>. To see which actions are taken on halt or reboot see the appropriate entries for these runlevels in the file I</etc/inittab>.
fr: B<shutdown> arrête le système d'une façon sécurisée. Tous les utilisateurs connectés sont informés que le système va s'arrêter, et B<login>(1) est bloqué. Il est possible d'arrêter le système immédiatement ou après un certain délai. En premier lieu, tous les processus sont informés que le système est en train de s'arrêter par le signal \s-2SIGTERM\s0. Cela donne le temps à des programmes comme B<vi>(1) de sauvegarder le fichier en cours d'édition, la chance à des programmes de traitement de courriels ou de nouvelles de se terminer proprement, etc. B<shutdown> fait son travail en envoyant un signal au processus B<init>, lui demandant de modifier le niveau d'exécution. Le niveau d'exécution B<0> est utilisé pour arrêter le système, le niveau B<6> pour le redémarrer et le niveau B<1> pour le mettre dans un état où des tâches d'administration peuvent être effectuées ; c'est le comportement par défaut si aucune des options I<-h> et I<-r> n'est donnée à B<shutdown>. Pour voir quelles actions sont entreprises durant l'arrêt ou le redémarrage, voyez les entrées appropriées pour ces niveaux d'exécution dans le fichier I</etc/inittab>.
pl: B<shutdown> w bezpieczny sposób wyłącza system. Wszyscy zalogowani użytkownicy powiadamiani są o rozpoczętym wyłączaniu, zaś rozpoczynanie nowych sesji pracy przez B<login>(1) jest blokowane. Możliwe jest zamknięcie i wyłączenie systemu natychmiastowe lub po zadanym czasie. W pierwszej kolejności wszystkie procesy powiadamiane są o wyłączaniu systemu sygnałem \s-2SIGTERM\s0. Daje to programom takim jak B<vi>(1) czas na zachowanie edytowanego pliku, programom przetwarzającym pocztę i grupy dyskusyjne szansę na czyste zakończenie pracy itd. B<shutdown> wykonuje swe zadanie sygnalizując procesowi B<init> prośbę o zmianę poziomu pracy. Poziom pracy (runlevel) B<0> używany jest do zatrzymywania systemu, zaś poziom B<1> służy do przełączenia go w stan, w którym mogą być wykonywane zadania administracyjne i konserwacja systemu; jest to poziom domyślny jeżeli nie podano ani flagi B<-h> ani B<-r> polecenia B<shutdown>. Jakie czynności wykonywane są podczas zatrzymywania bądź przeładowywania systemu możesz zobaczyć przeglądając odpowiednie dla danych poziomów pracy wpisy w pliku I</etc/inittab>.

source: Use B</etc/shutdown.allow>.
fr: Utiliser B</etc/shutdown.allow>.
pl: Używa B</etc/shutdown.allow>.

source: Don't really shutdown; only send the warning messages to everybody.
fr: Ne pas réellement s'arrêter ; uniquement envoyer les messages d'avertissement à tout le monde.
pl: Nie wykonuje faktycznego wyłączenia; wysyła tylko do wszystkich komunikaty ostrzegawcze.

source: Reboot after shutdown.
fr: Redémarrer la machine après l'arrêt du système.
pl: Przeładowuje (ang. reboot) po wyłączeniu systemu.

source: Halt or power off after shutdown. Usually used with the -P or -H flags, depending on whether we want to poweroff or simply stop the operating system.
fr: Arrêt ou extinction après la mise à l’arrêt. Utilisation avec les options B<-P> ou B<-H> pour, soit une mise hors tension, soit un simple arrêt du système d’exploitation.

source: Modifier to the -h flag. Halt action is to turn off the power. Must be used with the -h flag.
fr: Complément de l'option B<-h>. L'action est d'éteindre la machine. Elle doit être utilisée avec l'option B<-h>.

source: Modifier to the -h flag. Halt action is to halt or drop into boot monitor on systems that support it. Must be used with the -h flag. Halting is often used to run through the shutdown process and leave output on the screen for debugging purposes. Or when the user wants the OS to stop, but leave the power on. To power off at the end of the shutdown sequence use the -P modifier instead.
fr: Complément de l'option B<-h>. L'action est d'arrêter la machine ou de passer dans le gestionnaire de démarrage si le système le gère. Elle doit être utilisée avec l'option B<-h>. La mise à l’arrêt est souvent utilisée pour parcourir les étapes d’arrêt et afficher la sortie sur l’écran pour les besoins de débogage, ou quand l’utilisateur veut stopper le système d’exploitation, mais laisser la machine sous tension. Pour éteindre la machine après la mise à l’arrêt, le modificateur B<-P> est à préférer.

source: Skip fsck on reboot.
fr: Ne pas effectuer de vérification du système de fichiers (fsck) lors du redémarrage.
pl: Pomija fsck (sprawdzanie systemów plików) podczas przeładowania.

source: Force fsck on reboot.
fr: Forcer la vérification du système de fichiers lors du redémarrage.
pl: Wymusza fsck przy przeładowaniu.

source: [DEPRECATED] Don't call B<init>(8) to do the shutdown but do it ourself. The use of this option is discouraged, and its results are not always what you'd expect.
fr: [OBSOLÈTE] Ne pas appeler B<init>(8) pour l'arrêt, mais le faire soi-même. L'utilisation de cette option n’est pas recommandée et ses résultats ne sont pas toujours ceux espérés.
pl: [PRZESTARZAŁE] Nie wywołuje B<init>(8) do wykonania wyłączenia, ale robi to samodzielnie. Odradza się używania tej opcji, zaś jej wyniki nie zawsze są zgodne z oczekiwaniami.

source: Cancel a waiting shutdown. ("shutdown now" is no longer waiting.) With this option it is of course not possible to give the time argument, but you can enter explanatory message arguments on the command line that will be sent to all users.
fr: Annuler un B<shutdown> en attente (avec « shutdown now », il n'y a plus d'attente). Avec cette option, il n'est évidemment pas possible de donner de paramètre d'heure, mais vous pouvez entrer des messages d'explication en paramètres sur la ligne de commandes qui seront envoyés à tous les utilisateurs.
pl: Anuluje już rozpoczęte wyłączanie systemu (nie działa z "shutdown now"). Przy tej opcji nie jest, oczywiście, możliwe podanie argumentu I<czas>, ale można wprowadzić w wierszu poleceń komunikat wyjaśniający, który zostanie przesłany do wszystkich użytkowników.

source: Reduce the number of warnings shutdown displays. Usually shutdown displays warnings every 15 minutes and then every minute in the last 10 minutes of the countdown until I<time> is reached. When -q is specified shutdown only warns at 60 minute intervals, at the 10 minute mark, at the 5 minue mark, and when the shutdown process actually happens.
fr: Réduire le nombre de messages d’avertissement d’arrêt. Habituellement, des messages d’avertissement sont affichés toutes les 15 minutes et à chaque minute pendant le décompte des 10 dernières minutes avant l’I<heure> d’arrêt. Lorsque l’option B<-q> est précisée, l’arrêt est signifié toutes les 60 minutes, à 10 minutes de l’échéance, puis à 5 minutes, et quand la mise à l’arrêt s’effectue réellement.

source: Silence warnings prior to shutting down. Usually shutdown displays warnings every 15 minutes and then every minute in the last 10 minutes of the countdown until I<time> is reached. When -Q is specified shutdown only warns when the shutdown process actually happens. All other warning intervals are suppressed.
fr: Omettre les avertissements avant la mise à l’arrêt. Habituellement des messages sont affichés toutes les 15 minutes puis toutes les minutes pendant les 10 dernières avant l’I<heure> d’échéance. Lorsque l’option B<-Q> est indiquée, un avertissement n’est affiché que lorsque la mise à l’arrêt s’effectue réellement. Tous les autres avertissements sont supprimés.

source: Tell B<init>(8) to wait I<sec> seconds between sending all processes the warning (SIGTERM) and the kill signal (SIGKILL), before changing to another runlevel. The default time, if no value is specified, between these two signals is three seconds. Warning: when shutdown calls init to perform the shutdown (the default behaviour), init checks to see if all processes have terminated and will stop waiting early once its children have all terminated. When shutdown is called with the -n flag, it waits the full time specified (or three seconds) even if all other processes have terminated.
fr: Indiquer à B<init>(8) d’attendre I<sec> secondes entre l’envoi à tous les processus de l’avertissement (SIGTERM) et du signal de fin (SIGKILL) avant de changer de niveau d’exécution. Le délai par défaut, entre ces deux signaux est de trois secondes si aucune valeur n’est précisée. Attention : quand B<shutdown> appelle B<init> pour la mise à l’arrêt (comportement par défaut), B<init> vérifie si tous les processus sont terminés et attend que tous leurs enfants soient terminés. Lorsque B<shutdown> est appelé avec l’option B<-n>, il attend la fin du délai indiqué (ou trois secondes) même si tous les processus ont pris fin.

source: I<time>
fr: I<heure>
pl: I<czas>

source: When to shutdown.
fr: Quand effectuer l'arrêt.
pl: Kiedy wyłączyć system.

source: I<warning message>
fr: I<avertissement>
pl: I<ostrzeżenie>

source: Message to send to all users.
fr: Message à envoyer à tous les utilisateurs.
pl: Komunikat ostrzegawczy, jaki ma zostać wysłany do wszystkich użytkowników.

source: The I<time> argument can have different formats. First, it can be an absolute time in the format I<hh:mm>, in which I<hh> is the hour (1 or 2 digits) and I<mm> is the minute of the hour (in two digits). Second, it can be in the format B<+>I<m>, in which I<m> is the number of minutes to wait. The word B<now> is an alias for B<+0>.
fr: L'argument I<heure> peut avoir différents formats. Primo, il peut être dans le format absolu I<hh:mm>, dans lequel I<hh> est l'heure (1 ou 2 chiffres) et I<mm> la minute de l'heure (sur deux chiffres). Secundo, il peut être au format B<+>I<m>, dans lequel I<m> est le nombre de minutes à attendre. Le mot B<now> est un synonyme pour B<+0>.
pl: Argument I<czas> może posiadać różne formaty. Po pierwsze, może to być czas absolutny (ustalona godzina) w formacie I<gg:mm>, gdzie I<gg> jest godziną (1 lub 2 cyfry) a I<mm> minutami godziny (dwucyfrowo). Po drugie, może być w formacie B<+>I<m>, gdzie I<m> jest liczbą minut do odczekania. Słowo B<now> (teraz) jest równoważnikiem B<+0>.

source: If shutdown is called with a delay, it will create the advisory file I</run/nologin> which causes programs such as I<login(1)> to not allow new user logins. This file is created five minutes before the shutdown sequence starts. Shutdown removes this file if it is stopped before it can signal init (i.e. it is cancelled or something goes wrong). It also removes it before calling init to change the runlevel.
fr: Si B<shutdown> est appelé avec un délai, il crée le fichier de mise en garde I</run/nologin> qui indique à des programmes comme I<login>(1) de refuser les nouvelles connexions d'utilisateurs. Ce fichier est créé 5 minutes avant que la séquence d'arrêt ne débute. B<Shutdown> supprime ce fichier s'il a été stoppé avant qu'il ait pu envoyer un signal à B<init> (c'est-à-dire si la séquence a été annulée ou si quelque chose s'est mal passé). Il le supprime également avant d'appeler B<init> pour modifier le niveau d'exécution.
pl: Jeśli shutdown wywoływany jest z czasem opóźnienia, to tworzy plik sygnalizacyjny (advisory file) I</run/nologin> powodujący, że programy takie jak B<login(1)> nie zezwalają na nowe logowania użytkowników. Plik jest tworzony pięć minut przed rozpoczęciem wyłączania systemu. Shutdown usuwa ten plik tylko wtedy, gdy zostanie zatrzymany przed wysłaniem sygnału do init (tj. zostanie anulowany lub coś się nie udało). Usuwa go również przed wywołaniem init do zmiany poziomu pracy.

source: The B<-f> flag means `reboot fast'. This only creates an advisory file I</fastboot> which can be tested by the system when it comes up again. The boot rc file can test if this file is present, and decide not to run B<fsck>(1) since the system has been shut down in the proper way. After that, the boot process should remove I</fastboot>.
fr: L'option B<-f> signifie « redémarrage rapide ». Cela crée uniquement un fichier I</fastboot> qui peut être testé par le système quand il redémarre. Le fichier de démarrage rc peut tester si ce fichier existe et décider de ne pas lancer B<fsck>(1) puisque le système a été arrêté d'une manière propre. Après cela, le processus de démarrage devrait supprimer I</fastboot>.
pl: Flaga B<-f> oznacza "reboot fast" (szybkie przeładowanie). Tworzy plik sygnalizacyjny I</fastboot>, który może być testowany przez system przy ponownym uruchamianiu. Plik startowy rc może sprawdzać, czy powyższy plik istnieje i decydować o zaniechaniu uruchamiania B<fsck>(1), gdyż system został wyłączony prawidłowo. Następnie proces startowy powinien usunąć I</fastboot>.

source: The B<-F> flag means `force fsck'. This only creates an advisory file I</forcefsck> which can be tested by the system when it comes up again. The boot rc file can test if this file is present, and decide to run B<fsck>(1) with a special `force' flag so that even properly unmounted file systems get checked. After that, the boot process should remove I</forcefsck>.
fr: L'option B<-F> signifie « forcer le fsck ». Cela crée uniquement un fichier I</forcefsck> qui peut être testé par le système quand il redémarre. Le fichier de démarrage rc peut tester si ce fichier existe et décider de lancer B<fsck>(1) avec un drapeau spécial d'« obligation » afin que même les systèmes de fichiers correctement démontés soient vérifiés. Après cela, le processus de démarrage devrait supprimer I</forcefsck>.
pl: Flaga B<-F> oznacza "force fsck" (wymuś fsck). Tworzy plik sygnalizacyjny I</forcefsck>, który może być testowany przez system przy ponownym uruchamianiu. Plik startowy rc może sprawdzać, czy powyższy plik istnieje i decydować o uruchomieniu B<fsck>(1) ze specjalną flagą "force", tak by zostały sprawdzone nawet poprawnie odmontowane systemy plików. Następnie proces startowy powinien usunąć I</forcefsck>.

source: The B<-n> flag causes B<shutdown> not to call B<init>, but to kill all running processes itself. B<shutdown> will then turn off quota, accounting, and swapping and unmount all file systems.
fr: L'option B<-n> empêche B<shutdown> d'appeler B<init>, mais lui fait tuer les processus en cours d'exécution lui-même. B<shutdown> désactive ensuite les quotas, les comptes et la mémoire partagée, et démonte tous les systèmes de fichiers.
pl: Flaga B<-n> powoduje, że B<shutdown> nie będzie wywoływać B<init>, ale zabije samodzielnie wszystkie działające procesy. B<shutdown> wyłączy następnie obsługę udziałów (quota), rozliczeń i obszaru wymiany (swap) oraz odmontuje wszystkie systemy plików.

source: ACCESS CONTROL
fr: CONTRÔLE D'ACCÈS
pl: KONTROLA DOSTĘPU

source: B<shutdown> can be called from B<init>(8) when the magic keys B<CTRL-ALT-DEL> are pressed, by creating an appropriate entry in I</etc/inittab>. This means that everyone who has physical access to the console keyboard can shut the system down. To prevent this, B<shutdown> can check to see if an authorized user is logged in on one of the virtual consoles. If B<shutdown> is called with the B<-a> argument (add this to the invocation of shutdown in /etc/inittab), it checks to see if the file I</etc/shutdown.allow> is present. It then compares the login names in that file with the list of people that are logged in on a virtual console (from I</var/run/utmp>). Only if one of those authorized users B<or root> is logged in, it will proceed. Otherwise it will write the message
fr: B<shutdown> peut être appelé à partir d'B<init>(8) quand les touches magiques B<Ctrl-Alt-Suppr> sont pressées, en créant une entrée appropriée dans I</etc/inittab>. Cela signifie que tous ceux qui ont un accès physique au clavier de la console peuvent arrêter le système. Pour empêcher cela, B<shutdown> peut vérifier si un utilisateur autorisé est connecté sur une des consoles virtuelles. Si B<shutdown> est appelé avec l'argument B<-a> (ajoutez-le à l'invocation de B<shutdown> dans I</etc/inittab>), il vérifie si le fichier I</etc/shutdown.allow> est présent. Il compare ensuite les noms de connexion de ce fichier avec la liste des personnes qui sont connectées sur une console virtuelle (à partir de I</var/run/utmp>). Il ne poursuivra son exécution que si l'un des utilisateurs autorisés B<ou le superutilisateur> est connecté. Sinon, il affichera le message :
pl: B<shutdown> może być wywoływane z B<init>(8), gdy zostaną wciśnięte magiczne klawisze B<CTRL-ALT-DEL>, przez utworzenie odpowiedniego wpisu w I</etc/inittab>. Oznacza to, że każdy, kto posiada fizyczny dostęp do klawiatury konsoli może wyłączyć system. By zapobiec takiej sytuacji, B<shutdown> może sprawdzać, czy na jednej z wirtualnych konsoli zalogowany jest upoważniony użytkownik. Jeżeli B<shutdown> zostanie wywołany z argumentem B<-a> (proszę dodać go do wywołania shutdown w /etc/inittab), to sprawdza czy istnieje plik I</etc/shutdown.allow>. Następnie porównuje nazwy użytkowników z tego pliku z listą osób zalogowanych na wirtualnej konsoli (z I</var/run/utmp>). Shutdown będzie kontynuować pracę tylko wtedy, gdy zalogowany jest jeden z upoważnionych użytkowników B<lub root>. W przeciwnym wypadku wyświetli komunikat

source: B<shutdown: no authorized users logged in>
fr: shutdown : aucun utilisateur autorisé connecté
pl: B<shutdown: no authorized users logged in> [shutdown: brak zalogowanych upoważnionych użytkowników]

source: to the (physical) system console. The format of I</etc/shutdown.allow> is one user name per line. Empty lines and comment lines (prefixed by a B<#>) are allowed. Currently there is a limit of 32 users in this file.
fr: sur la console (physique) du système. Le format de I</etc/shutdown.allow> est formé d'un nom d'utilisateur par ligne. Les lignes vides et les lignes de commentaires (commençant par un B<#>) sont autorisées. Actuellement, la limite est de 32 utilisateurs dans ce fichier.
pl: na (fizyczną) konsolę systemową. Plik I</etc/shutdown.allow> zawiera po jednej nazwie (loginname) użytkownika w wierszu. Dozwolone są wiersze puste i wiersze komentarzy (poprzedzone znakiem B<#>). Obecnie dla tego pliku istnieje ograniczenie do 32 użytkowników.

source: Note that if I</etc/shutdown.allow> is not present, the B<-a> argument is ignored.
fr: Notez que si I</etc/shutdown.allow> n'existe pas, l'argument B<-a> est ignoré.
pl: Proszę zauważyć, że jeśli plik I</etc/shutdown.allow> nie istnieje, to argument B<-a> jest ignorowany.

source: HALT OR POWEROFF
fr: HALT OU POWEROFF
pl: ZATRZYMANIE CZY WYŁĄCZENIE
