Repository: krisfremen/manpages-l10n
Catalog: po/*/man8/tunelp.8.po
Languages: pl

source: October 2011
pl: październik 2011

source: System Administration
pl: Administracja systemem

source: NAME
pl: NAZWA

source: tunelp - set various parameters for the lp device
pl: tunelp - ustawia różne parametry urządzenia lp

source: SYNOPSIS
pl: SKŁADNIA

source: B<tunelp> [options] I<device>
pl: B<tunelp> [I<opcje>] I<urządzenie>

source: DESCRIPTION
pl: OPIS

source: B<tunelp> sets several parameters for the /dev/lpI<?> devices, for better performance (or for any performance at all, if your printer won't work without it...) Without parameters, it tells whether the device is using interrupts, and if so, which one. With parameters, it sets the device characteristics accordingly.
pl: B<tunelp> ustawia różne parametry urządzeń /dev/lpI<?>, umożliwiając zrobienie z nich lepszego użytku niż standardowo (lub też jakiegokolwiek użytku, jeśli drukarka bez tego nie chce działać...). Bez parametrów, sprawdza tylko, czy urządzenie używa przerwań, czy nie, a jeśli tak, to których. Z parametrami ustawia odpowiednio charakterystykę urządzenia.

source: OPTIONS
pl: OPCJE

source: specifies the IRQ to use for the parallel port in question. If this is set to something non-zero, -t and -c have no effect. If your port does not use interrupts, this option will make printing stop. The command B<tunelp -i 0> restores non-interrupt driven (polling) action, and your printer should work again. If your parallel port does support interrupts, interrupt-driven printing should be somewhat faster and efficient, and will probably be desirable.
pl: jest numerem IRQ, którego należy używać dla danego portu równoległego. Jeśli jego wartość jest niezerowa, to opcje -t i -c nie mają efektu. Jeśli dany port nie obsługuje przerwań, opcja ta powstrzyma drukowanie. B<tunelp -i 0> odnawia bezprzerwaniową obsługę drukarki i powinna ona wtedy znów działać. Jeśli dany port równoległy wspiera przerwania, to ich użycie przyspieszy pracę.

source: NOTE: This option will have no effect with kernel 2.1.131 or later since the irq is handled by the parport driver. You can change the parport irq for example via I</proc/parport/*/irq>. Read I</usr/src/linux/Documentation/parport.txt> for more details on parport.
pl: UWAGA: Ta opcja nie powoduje żadnych efektów na systemach używających jądra Linuksa w wersji 2.1.131 lub późniejszej, ponieważ przerwania są przechwytywane przez sterownik "parport". Przerwania te można zmieniać na przykład poprzez edycję I</proc/parport/*/irq>. Więcej szczegółów na temat sterownika parport można znaleźć w pliku I</usr/src/linux/Documentation/parport.txt>.

source: B<-t>, B<--time> I<milliseconds>
pl: B<-t>, B<--time> I<milisekundy>

source: is the amount of time in jiffies that the driver waits if the printer doesn't take a character for the number of tries dictated by the -c parameter. 10 is the default value. If you want fastest possible printing, and don't care about system load, you may set this to 0. If you don't care how fast your printer goes, or are printing text on a slow printer with a buffer, then 500 (5 seconds) should be fine, and will give you very low system load. This value generally should be lower for printing graphics than text, by a factor of approximately 10, for best performance.
pl: jest ilością czasu w jiffach, przez którą sterownik czeka jeśli drukarka nie przyjmuje znaku przez określoną liczbę prób, wskazanych przez parametr -c. Wartością domyślną jest 10. Aby uzyskać jak najszybsze drukowanie, bez względu na obciążenie systemu, można ustawić tę wartość na zero. Jeśli szybkość pracy drukarki jest nieistotna, lub jeśli drukuje się tekst na powolnej drukarce, to proszę ustawić wartość na 500 (5 sekund), co spowoduje niskie obciążenie systemu. Wartość ta ogólnie powinna być niższa przy drukowaniu grafiki niż tekstu o współczynnik około 10.

source: B<-c>, B<--chars> I<characters>
pl: B<-c>, B<--chars> I<znaki>

source: is the number of times to try to output a character to the printer before sleeping for -t I<TIME>. It is the number of times around a loop that tries to send a character to the printer. 120 appears to be a good value for most printers in polling mode. 1000 is the default, because there are some printers that become jerky otherwise, but you I<must> set this to `1' to handle the maximal CPU efficiency if you are using interrupts. If you have a very fast printer, a value of 10 might make more sense even if in polling mode. If you have a I<really> old printer, you can increase this further.
pl: jest liczbą prób wydrukowania znaku na drukarce przed zaśnięciem przez okres -t I<CZAS>. Jest to liczba prób pętli, która próbuje wysłać znak na drukarkę. 120 jest dobrą wartością dla większości drukarek. Domyślną wartością jest 1000, ponieważ istnieją drukarki, wymagające tak długiej zwłoki, lecz można to zmienić. Jeśli ma się bardzo szybką drukarkę, sens może mieć wartość 10. Jeśli masz I<naprawdę> starą drukarkę, możesz tę wartość jeszcze zwiększyć.

source: Setting -t I<TIME> to 0 is equivalent to setting -c I<CHARS> to infinity.
pl: Ustawienie -t I<CZAS> na 0 jest równoznaczne z ustawieniem -c I<PRÓBY> na nieskończoność.

source: B<-w>, B<--wait> I<milliseconds>
pl: B<-w>, B<--wait> I<milisekundy>

source: is the number of usec we wait while playing with the strobe signal. While most printers appear to be able to deal with an extremely short strobe, some printers demand a longer one. Increasing this from the default 1 may make it possible to print with those printers. This may also make it possible to use longer cables. It's also possible to decrease this value to 0 if your printer is fast enough or your machine is slow enough.
pl: jest licznikiem zajętych pętli dla sygnału strobe. Podczas gdy większość drukarek zdaje się być w stanie pracować z bardzo krótkim strobe, niektóre drukarki wymagają dłuższego. Zwiększenie tej wartości z domyślnej 0 umożliwi drukowanie na tych drukarkach. Może to też umożliwić drukowanie na dłuższych kablach.

source: B<-a>, B<--abort> I<E<lt>on|offE<gt>>
pl: B<-a>, B<--abort> E<lt>B<on>|B<off>E<gt>

source: This is whether to abort on printer error - the default is not to. If you are sitting at your computer, you probably want to be able to see an error and fix it, and have the printer go on printing. On the other hand, if you aren't, you might rather that your printer spooler find out that the printer isn't ready, quit trying, and send you mail about it. The choice is yours.
pl: Określa to czy przerywać po błędzie drukarki -- domyślnie nie przerywa się. Jeśli jest się przy komputerze, to zapewne chce się widzieć błąd i go naprawić i pozwolić drukarce drukować dalej. Z drugiej strony, jeśli tak nie jest, można raczej chcieć, by spooler zauważył, że drukarka nie jest gotowa i zakończył próby, wysyłając list z informacją. Wybór należy do użytkownika.

source: B<-o>, B<--check-status> I<E<lt>on|offE<gt>>
pl: B<-o>, B<--check-status> E<lt>B<on>|B<off>E<gt>

source: This option is much like -a. It makes any I<open()> of this device check to see that the device is on-line and not reporting any out of paper or other errors. This is the correct setting for most versions of lpd.
pl: Bardzo podobne do -a. Powoduje to, że każde wywołanie funkcji I<open()> tego urządzenia sprawdza, czy jest ono on-line i czy zgłasza jakieś błędy w rodzaju braku papieru. Jest to prawidłowe ustawienie dla większości wersji lpd.

source: B<-C>, B<--careful> I<E<lt>on|offE<gt>>
pl: B<-C>, B<--careful> E<lt>B<on>|B<off>E<gt>

source: This option adds extra ("careful") error checking. When this option is on, the printer driver will ensure that the printer is on-line and not reporting any out of paper or other errors before sending data. This is particularly useful for printers that normally appear to accept data when turned off.
pl: Opcja ta dodaje dodatkowe ("ostrożne") sprawdzanie błędów. Jeśli opcja ta jest włączona, sterownik drukarki będzie upewniał się, że drukarka jest on-line i nie zgłasza żadnych błędów braku papieru przed wysyłaniem do niej danych. Jest to użyteczne dla drukarek, które normalnie przyjmują dane, gdy są wyłączone.

source: NOTE: This option is obsolete because it's the default in 2.1.131 kernel or later.
pl: UWAGA: Ta opcja jest przestarzała, ponieważ jest ona domyślnie włączona w jądrach w wersji 2.1.131 lub wyższej.

source: This option returns the current printer status, both as a decimal number from 0..255, and as a list of active flags. When this option is specified, -q off, turning off the display of the current IRQ, is implied.
pl: Opcja ta zwraca obecny status drukarki, zarówno jako liczbę 0..225, jak i jako listę aktywnych flag. Gdy ta opcja jest podana, implikowane jest -q off, wyłączające wyświetlanie bieżącego IRQ.

source: B<-T>, B<--trust-irq> I<E<lt>on|offE<gt>>
pl: B<-T>, B<--trust-irq> E<lt>B<on>|B<off>E<gt>

source: This option is obsolete. It was added in Linux 2.1.131, and removed again in Linux 2.3.10. The below is for these old kernels only.
pl: Ta opcja jest przestarzała. Została dodana w Linuksie 2.1.131 i ponownie usunięta w wersji 2.3.10. Poniższy opis tyczy jedynie tych starych jąder.

source: This option tells the lp driver to trust or not the IRQ. This option makes sense only if you are using interrupts. If you tell the lp driver to trust the irq, then, when the lp driver will get an irq, it will send the next pending character to the printer unconditionally, even if the printer still claims to be BUSY. This is the only way to sleep on interrupt (and so the handle the irq printing efficiently) at least on Epson Stylus Color Printers. The lp driver automagically detects if you could get improved performance by setting this flag, and in such case it will warn you with a kernel message.
pl: Ta opcja mówi sterownikowi la, czy powinien ufać przerwaniom czy też nie. Opcja ta ma sens tylko wtedy, gdy są używane przerwania. Jeżeli włączy się tę opcję, to kiedy sterownikowi drukarki zostanie dostarczone przerwanie, to wyśle on następny czekający znak do drukarki, nawet wtedy, gdy drukarka ciągle jest w stanie BUSY (zajęty). Jest to jedyny sposób usypiania drukarki (pozwalający efektywnie wykorzystać przerwania drukarki) przynajmniej w wypadu drukarek Epson Stylus Color. Sterownik lp automatycznie wykrywa, czy ustawienie tej opcji poprawiłoby wydajność i w takim wypadku wysyła stosowne ostrzeżenie jako wiadomość jądra.

source: NOTE: Trusting the irq is reported to corrupt the printing on some hardware, you must try to know if your printer will work or not...
pl: UWAGA: Ufanie przerwaniom może popsuć drukowanie na niektórych drukarkach, tak więc trzeba wiedzieć, czy dana drukarka będzie działać czy nie...

source: This option resets the port. It requires a Linux kernel version of 1.1.80 or later.
pl: Opcja ta resetuje port. Wymaga jądra Linuksa w wersji 1.1.80 lub późniejszej.

source: B<-q>, B<--print-irq> I<E<lt>on|offE<gt>>
pl: B<-q>, B<--print-irq> E<lt>B<on>|B<off>E<gt>

source: This option sets printing the display of the current IRQ setting.
pl: Opcja ta włącza wyświetlanie bieżącego ustawienia IRQ.

source: NOTES
pl: UWAGI

source: B<-o>, B<-C>, and B<-s> all require a Linux kernel version of 1.1.76 or later.
pl: B<-o>, B<-C> i B<-s> wymagają jądra Linuksa w wersji 1.1.76 lub wyższej.

source: B<-C> requires a Linux version prior to 2.1.131.
pl: B<-C> wymaga jądra Linuksa w wersji niższej niż 2.1.131.

source: B<-T> requires a Linux version of 2.1.131 or later.
pl: B<-T> wymaga jądra Linuksa w wersji 2.1.131 lub wyższej.

source: BUGS
pl: BŁĘDY

source: By some unfortunate coincidence the ioctl LPSTRICT of 2.0.36 has the same number as the ioctl LPTRUSTIRQ introduced in 2.1.131. So, use of the -T option on a 2.0.36 kernel with an tunelp compiled under 2.1.131 or later may have unexpected effects.
pl: Dziwnym zbiegiem okoliczności ioctl LPSTRICT w jądrze 2.0.36 ma ten sam numer co wprowadzony w jądrze 2.1.131 ioctl LPTRUSTIRQ. Dlatego użycie opcji -T w systemie z jądrem 2.0.36 może przynieść dziwne efekty, jeżeli tunelp został skompilowany na systemie z jądrem 2.1.131 lub wyższym.

source: FILES
pl: PLIKI

source: AVAILABILITY
pl: DOSTĘPNOŚĆ

source: The tunelp command is part of the util-linux package and is available from E<.UR ftp://\:ftp.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Linux Kernel Archive E<.UE .>
pl: Polecenie tunelp jest częścią pakietu util-linux i jest dostępne z E<.UR ftp://\:ftp.kernel.org\:/pub\:/linux\:/utils\:/util-linux/> Archiwum jądra Linux E<.UE .>
