Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man5/raidtab.5.po
Languages: es

source: NAME
es: NOMBRE

source: raidtab - configuration file for md (RAID) devices
es: raidtab - fichero de configuración para dispositivos md (RAID)

source: DESCRIPTION
es: DESCRIPCIÓN

source: B</etc/raidtab> is the default configuration file for the raid tools (B<raidstart> and company). It defines how RAID devices are configured on a system.
es: B</etc/raidtab> es el fichero de configuración por defecto para las herramientas RAID (B<raidadd> y compañía). Define cómo se configuran los dispositivos RAID del sistema.

source: FORMAT
es: FORMATO

source: B</etc/raidtab> has multiple sections, one for each md device which is being configured. Each section begins with the B<raiddev> keyword. The order of items in the file is important. Later B<raiddev> entries can use earlier ones (which allows RAID-10, for example), and the parsing code isn't overly bright, so be sure to follow the ordering in this man page for best results.
es: B</etc/raidtab> tiene varias secciones, una para cada dispositivo md que se configure. Cada sección comienza con la palabra reservada B<raiddev>. El orden de los elementos en el fichero es importante. Una entrada B<raiddev> pueden usar entradas B<raiddev> definidas previamente (lo que permite, por ejemplo, un RAID-10); además, el código de análisis no es excesivamente brillante, por lo que asegúrese de seguir el orden que aparece en esta página de manual para obtener los mejores resultados.

source: Here's a sample md configuration file:
es: Aquí tiene un ejemplo de fichero de configuración de md:

source: Here is more information on the directives which are in raid configuration files; the options are listen in this file in the same order they should appear in the actual configuration file.
es: A continuación tiene más información sobre las directivas que aparecen en los ficheros de configuración RAID; las opciones se muestran aquí en el mismo orden en que deberían aparecer en el fichero de configuración real.

source: B<raiddev >I<device>
es: B<raiddev >I<dispositivo>

source: This introduces the configuration section for the stated device.
es: Esto introduce la información de configuración para el dispositivo indicado.

source: B<nr-raid-disks >I<count>
es: B<nr-raid-disks >I<número>

source: B<nr-spare-disks >I<count>
es: B<nr-spare-disks >I<número>

source: B<parity-algorithm >I<which>
es: B<parity-algorithm >I<algoritmo>

source: B<chunk-size >I<size>
es: B<chunk-size >I<tamaño>

source: B<device >I<devpath>
es: B<device >I<dispositivo>

source: B<raid-disk >I<index>
es: B<raid-disk >I<índice>

source: The most recently defined B<device> is inserted at position I<index> in the raid array.
es: El B<device> definido más recientemente se inserta en la posición I<índice> del array RAID.

source: B<spare-disk >I<index>
es: B<spare-disk >I<índice>

source: The most recently defined B<device> is inserted at position I<index> in the spare disk array.
es: El B<device> definido más recientemente se inserta en la posición I<índice> del array de discos de repuesto.

source: B<parity-disk >I<index>
es: B<parity-disk >I<índice>

source: The most recently defined B<device> is moved to the end of the raid array, which forces it to be used for parity.
es: El B<device> definido más recientemente se mueve al final del array RAID, lo que le obliga a ser usado para paridad.

source: B<failed-disk >I<index>
es: B<failed-disk >I<índice>

source: NOTES
es: NOTAS

source: The raidtools are derived from the md-tools and raidtools packages, which were originally written by Marc Zyngier, Miguel de Icaza, Gadi Oxman, Bradley Ward Allen, and Ingo Molnar.
es: El paquete raidtools deriva de los paquetes md-tools y raidtools, que originalmente fueron escritos pr Marc Zyngier, Miguel de Icaza, Gadi Oxman, Bradley Ward Allen e Ingo Molnar.

source: SEE ALSO
es: VÉASE TAMBIÉN
