Repository: krisfremen/manpages-l10n
Catalog: po/*/man5/coredump.conf.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: coredump.conf, coredump.conf.d - Core dump storage configuration files
de: coredump.conf, coredump.conf.d - Konfigurationsdateien für die Speicherung von Speicherauszügen

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: These files configure the behavior of B<systemd-coredump>(8), a handler for core dumps invoked by the kernel\&. Whether B<systemd-coredump> is used is determined by the kernel\*(Aqs I<kernel\&.core_pattern> B<sysctl>(8) setting\&. See B<systemd-coredump>(8) and B<core>(5) pages for the details\&.
de: Diese Dateien konfigurieren das Verhalten von B<systemd-coredump>(8), ein vom Kernel aufgerufenes Steuerungsprogramm für Speicherauszüge\&. Ob B<systemd-coredump> verwandt wird, hängt von der Einstellung I<kernel\&.core_pattern> B<sysctl>(8) des Kernels ab\&. Siehe die Seiten B<systemd-coredump>(8) und B<core>(5) für die Details\&.

source: CONFIGURATION DIRECTORIES AND PRECEDENCE
de: KONFIGURATIONSVERZEICHNISSE UND RANGFOLGE

source: The default configuration is set during compilation, so configuration is only needed when it is necessary to deviate from those defaults\&. Initially, the main configuration file in /etc/systemd/ contains commented out entries showing the defaults as a guide to the administrator\&. Local overrides can be created by editing this file or by creating drop-ins, as described below\&. Using drop-ins for local configuration is recommended over modifications to the main configuration file\&.
de: Die Standardkonfiguration wird während der Kompilierung gesetzt\&. Daher wird eine Konfiguration nur benötigt, wenn von diesen Vorgaben abgewichen werden muss\&. Anfänglich enthält die Hauptkonfigurationsdatei in /etc/systemd/ die Vorgaben als auskommentierten Hinweis für den Administrator\&. Lokal können diese Einstellungen außer Kraft gesetzt werden, indem diese Datei bearbeitet wird oder durch die Erstellung von Ergänzungen, wie nachfolgend beschrieben\&. Es wird empfohlen, Ergänzungen für lokale Konfiguration zu verwenden, statt die Hauptkonfigurationsdatei zu verändern\&.

source: In addition to the "main" configuration file, drop-in configuration snippets are read from /usr/lib/systemd/*\&.conf\&.d/, /usr/local/lib/systemd/*\&.conf\&.d/, and /etc/systemd/*\&.conf\&.d/\&. Those drop-ins have higher precedence and override the main configuration file\&. Files in the *\&.conf\&.d/ configuration subdirectories are sorted by their filename in lexicographic order, regardless of in which of the subdirectories they reside\&. When multiple files specify the same option, for options which accept just a single value, the entry in the file sorted last takes precedence, and for options which accept a list of values, entries are collected as they occur in the sorted files\&.
de: Zusätzlich zu der »Haupt«-Konfigurationsdatei, werden Ergänzungs-Konfigurationsschnipsel aus /usr/lib/systemd/*\&.conf\&.d/, /usr/local/lib/systemd/*\&.conf\&.d/ und /etc/systemd/*\&.conf\&.d/ gelesen\&. Diese Ergänzungen haben Vorrang vor der Hauptkonfigurationsdatei und setzen diese außer Kraft\&. Dateien in den Konfigurationsunterverzeichnissen *\&.conf\&.d/ werden in lexikographischer Reihenfolge nach ihrem Dateinamen sortiert, unabhängig davon, in welchem Unterverzeichnis sie sich befinden\&. Bei Optionen, die nur einen einzelnen Wert akzeptieren, hat der Eintrag in der Datei, die als letztes in der Sortierung folgt, Vorrang, falls mehrere Dateien die gleiche Option angeben\&. Bei Optionen, die eine Liste von Werten akzeptieren, werden Einträge gesammelt, wie sie in den sortierten Dateien auftauchen\&.

source: When packages need to customize the configuration, they can install drop-ins under /usr/\&. Files in /etc/ are reserved for the local administrator, who may use this logic to override the configuration files installed by vendor packages\&. Drop-ins have to be used to override package drop-ins, since the main configuration file has lower precedence\&. It is recommended to prefix all filenames in those subdirectories with a two-digit number and a dash, to simplify the ordering of the files\&.
de: Wenn Pakete die Konfiguration anpassen müssen, können sie Ergänzungen unter /usr/ installieren\&. Dateien in /etc/ sind für den lokalen Administrator reserviert, der diese Logik verwenden kann, um die durch die Lieferantenpakete bereitgestellten Konfigurationsdateien außer Kraft zu setzen\&. Um Ergänzungen der Pakete außer Kraft zu setzen, müssen Ergänzungen verwandt werden, da die Hauptkonfigurationsdatei die niedrigste Priorität hat\&. Es wird empfohlen, allen Dateinamen in diesen Unterverzeichnissen eine zweistellige Zahl und einen Bindestrich voranzustellen, um die Sortierung der Dateien zu vereinfachen\&.

source: To disable a configuration file supplied by the vendor, the recommended way is to place a symlink to /dev/null in the configuration directory in /etc/, with the same filename as the vendor configuration file\&.
de: Um eine vom Lieferanten bereitgestellte Konfigurationsdatei zu deaktivieren, wird empfohlen, einen Symlink nach /dev/null in dem Konfigurationsverzeichnis in /etc/ mit dem gleichen Dateinamen wie die Konfigurationsdatei des Lieferanten abzulegen\&.

source: OPTIONS
de: OPTIONEN

source: All options are configured in the [Coredump] section:
de: Alle Optionen werden im Abschnitt »[Coredump]« konfiguriert:

source: Controls where to store cores\&. One of "none", "external", and "journal"\&. When "none", the core dumps may be logged (including the backtrace if possible), but not stored permanently\&. When "external" (the default), cores will be stored in /var/lib/systemd/coredump/\&. When "journal", cores will be stored in the journal and rotated following normal journal rotation patterns\&.
de: Steuert, wo die Speicherauszüge gespeichert werden\&. Entweder »none«, »external« oder »journal«\&. Wenn »none«, können die Speicherauszüge protokolliert werden (einschließlich der Ablaufverfolgung (Backtrace) falls möglich), allerdings erfolgt keine dauerhafte Speicherung\&. Bei (der Vorgabe) »external« werden die Speicherauszüge in /var/lib/systemd/coredump/ gespeichert\&. Bei »journal« werden die Speicherauszüge im Journal gespeichert und diese werden gemäß den normalen Journal-Rotationsmustern rotiert\&.

source: When cores are stored in the journal, they might be compressed following journal compression settings, see B<journald.conf>(5)\&. When cores are stored externally, they will be compressed by default, see below\&.
de: Wenn die Speicherauszüge im Journal gespeichert werden, können sie gemäß der Journal-Kompressionseinstellungen komprimiert werden, siehe B<journald.conf>(5)\&. Wenn Speicherauszüge extern gespeichert werden, werden sie standardmßig komprimiert, siehe unten\&.

source: Controls compression for external storage\&. Takes a boolean argument, which defaults to "yes"\&.
de: Steuert die Komprimierung für externe Speicherung\&. Akzeptiert ein logisches Argument, standardmäßig »yes«\&.

source: The maximum size in bytes of a core which will be processed\&. Core dumps exceeding this size may be stored, but the backtrace will not be generated\&. Like other sizes in this same config file, the usual suffixes to the base of 1024 are allowed (B, K, M, G, T, P, and E)\&.
de: Die maximale Größe in Byte von Speicherauszügen, die verarbeitet werden\&. Speicherauszüge, die diese Größe überschreiten, können gespeichert werden, aber Backtraces werden nicht erzeugt\&. Wie bei anderen Größen in der gleichen Konfigurationsdatei sind die gewöhnlichen Endungen zur Basis 1024 erlaubt (B, K, M, G, T, P und E)\&.

source: Setting I<Storage=none> and I<ProcessSizeMax=0> disables all coredump handling except for a log entry\&.
de: Durch Setzen von I<Storage=none> und I<ProcessSizeMax=0> wird sämtliche Handhabung von Speicherauszügen außer dem Protokolleintrag deaktiviert\&.

source: The maximum (compressed or uncompressed) size in bytes of a core to be saved\&. Unit suffixes are allowed just as in B<ProcessSizeMax=>\&.
de: Die maximale (komprimierte oder unkomprimierte) Größe eines zu speichernden Speicherauszugs in Byte\&. Wie in B<ProcessSizeMax=> sind Einheitengrößen erlaubt\&.

source: Enforce limits on the disk space, specified in bytes, taken up by externally stored core dumps\&. Unit suffixes are allowed just as in B<ProcessSizeMax=>\&. B<MaxUse=> makes sure that old core dumps are removed as soon as the total disk space taken up by core dumps grows beyond this limit (defaults to 10% of the total disk size)\&. B<KeepFree=> controls how much disk space to keep free at least (defaults to 15% of the total disk size)\&. Note that the disk space used by core dumps might temporarily exceed these limits while core dumps are processed\&. Note that old core dumps are also removed based on time via B<systemd-tmpfiles>(8)\&. Set either value to 0 to turn off size-based cleanup\&.
de: Erzwingt Plattenplatz-Beschränkungen für extern gespeicherte Speicherauszüge, gemessen in Byte\&. Wie in B<ProcessSizeMax=> sind Einheiten-Endungen erlaubt\&. B<MaxUse=> stellt sicher, dass alte Speicherauszüge entfernt werden, sobald der von Speicherauszügen belegte Gesamtplattenplatz über diese Beschränkung wächst (standardmäßig 10% des Gesamtplattenplatzes)\&. B<KeepFree=> steuert, wieviel Plattenplatz mindestens freigehalten werden muss (standardmäßig 15% der Gesamtplattengröße)\&. Beachten Sie, dass der von Speicherauszügen verwandte Plattenplatz vorübergehend diese Beschränkung überschreiten kann, während die Speicherauszüge verarbeitet werden\&. Beachten Sie, dass alte Speicherauszüge auch mittels B<systemd-tmpfiles>(8) zeitbasiert entfernt werden\&. Setzen Sie einen der Werte auf 0, um größenbasierte Bereinigung zu deaktivieren\&.

source: The defaults for all values are listed as comments in the template /etc/systemd/coredump\&.conf file that is installed by default\&.
de: Die Vorgaben für alle Werte werden in Kommentaren in der Vorlagendatei /etc/systemd/coredump\&.conf, die standardmäßig installiert wird, aufgeführt\&.

source: SEE ALSO
de: SIEHE AUCH

source: These files configure the behavior of B<systemd-coredump>(8), a handler for core dumps invoked by the kernel\&. Whether B<systemd-coredump> is used is determined by the kernel\*(Aqs I<kernel\&.core_pattern>\ \&B<sysctl>(8) setting\&. See B<systemd-coredump>(8) and B<core>(5) pages for the details\&.
de: Diese Dateien konfigurieren das Verhalten von B<systemd-coredump>(8), ein vom Kernel aufgerufenes Steuerungsprogramm für Speicherauszüge\&. Ob B<systemd-coredump> verwandt wird, hängt von der Einstellung I<kernel\&.core_pattern>\ \&B<sysctl>(8) des Kernels ab\&. Siehe die Seiten B<systemd-coredump>(8) und B<core>(5) für die Details\&.

source: The default configuration is defined during compilation, so a configuration file is only needed when it is necessary to deviate from those defaults\&. By default, the configuration file in /etc/systemd/ contains commented out entries showing the defaults as a guide to the administrator\&. This file can be edited to create local overrides\&.
de: Die Standardkonfiguration wird während der Kompilierung definiert\&. Daher wird eine Konfigurationsdatei nur benötigt, wenn von diesen Vorgaben abgewichen werden muss\&. Standardmäßig enthält die Konfigurationsdatei in /etc/systemd/ die Vorgaben als auskommentierten Hinweis für den Administrator\&. Diese Datei kann bearbeitet werden, um lokal Einstellungen zu ändern\&.

source: When packages need to customize the configuration, they can install configuration snippets in /usr/lib/systemd/*\&.conf\&.d/ or /usr/local/lib/systemd/*\&.conf\&.d/\&. The main configuration file is read before any of the configuration directories, and has the lowest precedence; entries in a file in any configuration directory override entries in the single configuration file\&. Files in the *\&.conf\&.d/ configuration subdirectories are sorted by their filename in lexicographic order, regardless of in which of the subdirectories they reside\&. When multiple files specify the same option, for options which accept just a single value, the entry in the file with the lexicographically latest name takes precedence\&. For options which accept a list of values, entries are collected as they occur in files sorted lexicographically\&.
de: Wenn Pakete die Konfiguration anpassen müssen, können sie Konfigurationsschnipsel in /usr/lib/systemd/*\&.conf\&.d/ oder /usr/local/lib/systemd/*\&.conf\&.d/ installieren\&. Die Hauptkonfigurationsdatei wird vor jeder anderen aus den Konfigurationsverzeichnissen gelesen und hat die niedrigste Priorität; Einträge in einer Datei in jedem der Konfigurationsverzeichnisse setzen Einträge in der einzelnen Konfigurationsdatei außer Kraft\&. Dateien in den Konfigurationsunterverzeichnissen *\&.conf\&.d/ werden in lexikographischer Reihenfolge nach ihrem Dateinamen sortiert, unabhängig davon, in welchem Unterverzeichnis sie sich befinden\&. Bei Optionen, die nur einen einzelnen Wert akzeptieren, hat der Eintrag in der Datei mit dem lexikographisch letzten Namen Vorrang, falls mehrere Dateien die gleiche Option angeben\&. Bei Optionen, die eine Liste von Werten akzeptieren, werden Einträge zusammengefasst, wie sie in den lexikographisch sortierten Dateien auftauchen\&.

source: Files in /etc/ are reserved for the local administrator, who may use this logic to override the configuration files installed by vendor packages\&. It is recommended to prefix all filenames in those subdirectories with a two-digit number and a dash, to simplify the ordering of the files\&.
de: Dateien in /etc/ sind für den lokalen Administrator reserviert, der diese Logik verwenden kann, um die durch die Lieferantenpakete bereitgestellten Konfigurationsdateien außer Kraft zu setzen\&. Es wird empfohlen, allen Dateinamen in diesen Unterverzeichnissen eine zweistellige Zahl und einen Bindestrich voranzustellen, um die Sortierung der Dateien zu vereinfachen\&.

source: The maximum size in bytes of a core which will be processed\&. Core dumps exceeding this size may be stored, but the backtrace will not be generated\&.
de: Die maximale Größe in Byte von Speicherauszügen, die verarbeitet werden\&. Speicherauszüge, die diese Größe überschreiten, können gespeichert werden, aber Backtraces werden nicht erzeugt\&.

source: The maximum (uncompressed) size in bytes of a core to be saved\&.
de: Die maximale (unkomprimierte) Größe eines zu speichernden Speicherauszugs in Byte\&.

source: Enforce limits on the disk space taken up by externally stored core dumps\&. B<MaxUse=> makes sure that old core dumps are removed as soon as the total disk space taken up by core dumps grows beyond this limit (defaults to 10% of the total disk size)\&. B<KeepFree=> controls how much disk space to keep free at least (defaults to 15% of the total disk size)\&. Note that the disk space used by core dumps might temporarily exceed these limits while core dumps are processed\&. Note that old core dumps are also removed based on time via B<systemd-tmpfiles>(8)\&. Set either value to 0 to turn off size-based clean-up\&.
de: Erzwingt Plattenplatz-Beschränkungen für extern gespeicherte Speicherauszüge\&. B<MaxUse=> stellt sicher, dass alte Speicherauszüge entfernt werden, sobald der von Speicherauszügen belegte Gesamtplattenplatz über diese Beschränkung wächst (standardmäßig 10% des Gesamtplattenplatzes)\&. B<KeepFree=> steuert, wieviel Plattenplatz mindestens freigehalten werden muss (standardmäßig 15% der Gesamtplattengröße)\&. Beachten Sie, dass der von Speicherauszügen verwandte Plattenplatz vorübergehend diese Beschränkung überschreiten kann, während die Speicherauszüge verarbeitet werden\&. Beachten Sie, dass alte Speicherauszüge auch mittels B<systemd-tmpfiles>(8) zeitbasiert entfernt werden\&. Setzen Sie einen der Werte auf 0, um größenbasierte Bereinigung zu deaktivieren\&.

source: The maximum size in bytes of a core which will be processed\&. Core dumps exceeding this size may be stored, but the backtrace will not be generated\&. Like other sizes in this same config file, the usual suffixes to the base of 1024 are allowed (B, K, M, G, T, P, and E\&.)
de: Die maximale Größe in Byte von Speicherauszügen, die verarbeitet werden\&. Speicherauszüge, die diese Größe überschreiten, können gespeichert werden, aber Backtraces werden nicht erzeugt\&. Wie bei anderen Größen in der gleichen Konfigurationsdatei sind die gewöhnlichen Endungen zur Basis 1024 erlaubt (B, K, M, G, T, P und E)\&.

source: The maximum (uncompressed) size in bytes of a core to be saved\&. Unit suffixes are allowed just as in B<ProcessSizeMax=> \&. .RE
de: Die maximale (unkomprimierte) Größe eines zu speichernden Speicherauszugs in Byte\&. Wie in B<ProcessSizeMax=> sind Einheitengrößen erlaubt\&.

source: Enforce limits on the disk space, specified in bytes, taken up by externally stored core dumps\&. Unit suffixes are allowed just as in B<ProcessSizeMax=>\&. B<MaxUse=> makes sure that old core dumps are removed as soon as the total disk space taken up by core dumps grows beyond this limit (defaults to 10% of the total disk size)\&. B<KeepFree=> controls how much disk space to keep free at least (defaults to 15% of the total disk size)\&. Note that the disk space used by core dumps might temporarily exceed these limits while core dumps are processed\&. Note that old core dumps are also removed based on time via B<systemd-tmpfiles>(8)\&. Set either value to 0 to turn off size-based clean-up\&.
de: Erzwingt Plattenplatz-Beschränkungen für extern gespeicherte Speicherauszüge, gemessen in Byte\&. Wie in B<ProcessSizeMax=> sind Einheiten-Endungen erlaubt\&. B<MaxUse=> stellt sicher, dass alte Speicherauszüge entfernt werden, sobald der von Speicherauszügen belegte Gesamtplattenplatz über diese Beschränkung wächst (standardmäßig 10% des Gesamtplattenplatzes)\&. B<KeepFree=> steuert, wieviel Plattenplatz mindestens freigehalten werden muss (standardmäßig 15% der Gesamtplattengröße)\&. Beachten Sie, dass der von Speicherauszügen verwandte Plattenplatz vorübergehend diese Beschränkung überschreiten kann, während die Speicherauszüge verarbeitet werden\&. Beachten Sie, dass alte Speicherauszüge auch mittels B<systemd-tmpfiles>(8) zeitbasiert entfernt werden\&. Setzen Sie einen der Werte auf 0, um größenbasierte Bereinigung zu deaktivieren\&.
