Repository: krisfremen/manpages-l10n
Catalog: po/*/man5/qmail-users.5.po
Languages: pl

source: NAME
pl: NAZWA

source: qmail-users - assign mail addresses to users
pl: qmail-users - przypisania adresów pocztowych do użytkowników

source: OVERVIEW
pl: PRZEGLĄD

source: The file B</var/lib/qmail/users/assign> assigns addresses to users. For example,
pl: Plik B</var/lib/qmail/users/assign> przypisuje adresy do użytkowników. Na przykład:

source: =joe.shmoe:joe:503:78:/home/joe:::
pl: =big.siefczyk:big:503:78:/home/big:::

source: says that mail for B<joe.shmoe> should be delivered to user B<joe>, with uid 503 and gid 78, as specified by B</home/joe/.qmail>.
pl: mówi, że cała poczta dla użytkownika B<big.siefczyk> powinna być dostarczana do użytkownika B<big>, z wartościami uid 503 i gid 78, według reguł dostarczania określonych w pliku B</home/big/.qmail> oczywiście.

source: Assignments fed to B<qmail-newu> will be used by B<qmail-lspawn> to control B<qmail-local>'s deliveries. See B<qmail-newu>(8). A change to B</var/lib/qmail/users/assign> will have no effect until B<qmail-newu> is run.
pl: Przypisania przetworzone przez program B<qmail-newu> będą użyte przez B<qmail-lspawn>, by kontrolować dostarczanie poczty przez B<qmail-local>. Patrz B<qmail-newu>(8). Zmiany w pliku B</var/lib/qmail/users/assign> nie przyniosą efektów, dopóki program B<qmail-newu> nie zostanie wywołany.

source: STRUCTURE
pl: STRUKTURA

source: B</var/lib/qmail/users/assign> is a series of assignments, one per line. It ends with a line containing a single dot. Lines must not contain NUL.
pl: B</var/lib/qmail/users/assign> jest serią przypisań, jedno na linię. Kończy się linią zawierającą pojedynczą kropkę. Linie nie mogą zawierać znaków NUL.

source: SIMPLE ASSIGNMENTS
pl: PROSTE PRZYPISANIA

source: A simple assignment is a line of the form
pl: Przypisaniem prostym jest linia w stylu

source: =local:user:uid:gid:homedir:dash:ext:
pl: =lokalny:użytkownik:uid:gid:katalogdomowy:kreska:dod:

source: Here I<local> is an address; I<user>, I<uid>, and I<gid> are the account name, uid, and gid of the user in charge of I<local>; and messages to I<local> will be controlled by I<homedir>B</.qmail>I<dashext>.
pl: Gdzie I<lokalny> to adres; I<użytkownik>, I<uid> i I<gid> to nazwa konta, UID i GID użytkownika zwanego I<lokalny>; a wiadomości do I<lokalnego> właśnie będą kontrolowane przez jego plik I<katalogdomowy>B</.qmail>I<kreskadod>.

source: If there are several assignments for the same I<local> address, B<qmail-lspawn> will use the first one.
pl: Jeśli wystąpi więcej przypisań dla tego samego I<lokalnego> adresu, B<qmail-lspawn> użyje pierwszego.

source: I<local> is interpreted without regard to case.
pl: I<lokalny> jest interpretowany bez względu na wielkość liter.

source: WILDCARD ASSIGNMENTS
pl: PRZYPISANIA OGÓLNE

source: A wildcard assignment is a line of the form
pl: Przypisaniem ogólnym (meta-przypisaniem) jest linia w stylu

source: +loc:user:uid:gid:homedir:dash:pre:
pl: +lok:użytkownik:uid:gid:katalogdomowy:kreska:przed:

source: This assignment applies to any address beginning with I<loc>, including I<loc> itself. It means the same as
pl: Przypisanie to odnosi się do każdego adresu rozpoczynającego się na I<lok>, włączając samo I<lok>. Oznacza to samo, co

source: =locext:user:uid:gid:homedir:dash:preext:
pl: =lokdod:użytkownik:uid:gid:katalogdomowy:kreska:przeddod:

source: for every string I<ext>.
pl: dla każdego możliwego ciągu wstawionego w miejsce I<dod>.

source: A more specific wildcard assignment overrides a less specific assignment, and a simple assignment overrides any wildcard assignment. For example:
pl: Bardziej precyzyjne przypisania ogólne przesłaniają mniej specyficzne przypisania, a przypisanie proste przesłania jakiekolwiek przypisanie ogólne. Na przykład:

source: The address B<joe> is handled by the third line; the address B<joe-direct> is handled by the second line; the address B<bill> is handled by the first line.
pl: Adres B<big> jest obsługiwany przez linię trzecią; adres B<big-direct> przez drugą; adres B<bill> przez linię pierwszą.

source: SEE ALSO
pl: ZOBACZ TAKŻE
