Repository: krisfremen/manpages-l10n
Catalog: po/*/man5/timesyncd.conf.5.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: timesyncd.conf, timesyncd.conf.d - Network Time Synchronization configuration files
de: timesyncd.conf, timesyncd.conf.d - Konfigurationsdateien für die Netzwerkzeitsynchronisierung

source: SYNOPSIS
de: ÜBERSICHT

source: DESCRIPTION
de: BESCHREIBUNG

source: These configuration files control NTP network time synchronization\&. See B<systemd.syntax>(7) for a general description of the syntax\&.
de: Diese Konfigurationsdateien steuern die NTP-Netzwerkzeitsynchronisation\&. Siehe B<systemd.syntax>(7) für eine allgemeine Beschreibung der Syntax\&.

source: CONFIGURATION DIRECTORIES AND PRECEDENCE
de: KONFIGURATIONSVERZEICHNISSE UND RANGFOLGE

source: The default configuration is set during compilation, so configuration is only needed when it is necessary to deviate from those defaults\&. Initially, the main configuration file in /etc/systemd/ contains commented out entries showing the defaults as a guide to the administrator\&. Local overrides can be created by editing this file or by creating drop-ins, as described below\&. Using drop-ins for local configuration is recommended over modifications to the main configuration file\&.
de: Die Standardkonfiguration wird während der Kompilierung gesetzt\&. Daher wird eine Konfiguration nur benötigt, wenn von diesen Vorgaben abgewichen werden muss\&. Anfänglich enthält die Hauptkonfigurationsdatei in /etc/systemd/ die Vorgaben als auskommentierten Hinweis für den Administrator\&. Lokal können diese Einstellungen außer Kraft gesetzt werden, indem diese Datei bearbeitet wird oder durch die Erstellung von Ergänzungen, wie nachfolgend beschrieben\&. Es wird empfohlen, Ergänzungen für lokale Konfiguration zu verwenden, statt die Hauptkonfigurationsdatei zu verändern\&.

source: In addition to the "main" configuration file, drop-in configuration snippets are read from /usr/lib/systemd/*\&.conf\&.d/, /usr/local/lib/systemd/*\&.conf\&.d/, and /etc/systemd/*\&.conf\&.d/\&. Those drop-ins have higher precedence and override the main configuration file\&. Files in the *\&.conf\&.d/ configuration subdirectories are sorted by their filename in lexicographic order, regardless of in which of the subdirectories they reside\&. When multiple files specify the same option, for options which accept just a single value, the entry in the file sorted last takes precedence, and for options which accept a list of values, entries are collected as they occur in the sorted files\&.
de: Zusätzlich zu der »Haupt«-Konfigurationsdatei, werden Ergänzungs-Konfigurationsschnipsel aus /usr/lib/systemd/*\&.conf\&.d/, /usr/local/lib/systemd/*\&.conf\&.d/ und /etc/systemd/*\&.conf\&.d/ gelesen\&. Diese Ergänzungen haben Vorrang vor der Hauptkonfigurationsdatei und setzen diese außer Kraft\&. Dateien in den Konfigurationsunterverzeichnissen *\&.conf\&.d/ werden in lexikographischer Reihenfolge nach ihrem Dateinamen sortiert, unabhängig davon, in welchem Unterverzeichnis sie sich befinden\&. Bei Optionen, die nur einen einzelnen Wert akzeptieren, hat der Eintrag in der Datei, die als letztes in der Sortierung folgt, Vorrang, falls mehrere Dateien die gleiche Option angeben\&. Bei Optionen, die eine Liste von Werten akzeptieren, werden Einträge gesammelt, wie sie in den sortierten Dateien auftauchen\&.

source: When packages need to customize the configuration, they can install drop-ins under /usr/\&. Files in /etc/ are reserved for the local administrator, who may use this logic to override the configuration files installed by vendor packages\&. Drop-ins have to be used to override package drop-ins, since the main configuration file has lower precedence\&. It is recommended to prefix all filenames in those subdirectories with a two-digit number and a dash, to simplify the ordering of the files\&.
de: Wenn Pakete die Konfiguration anpassen müssen, können sie Ergänzungen unter /usr/ installieren\&. Dateien in /etc/ sind für den lokalen Administrator reserviert, der diese Logik verwenden kann, um die durch die Lieferantenpakete bereitgestellten Konfigurationsdateien außer Kraft zu setzen\&. Um Ergänzungen der Pakete außer Kraft zu setzen, müssen Ergänzungen verwandt werden, da die Hauptkonfigurationsdatei die niedrigste Priorität hat\&. Es wird empfohlen, allen Dateinamen in diesen Unterverzeichnissen eine zweistellige Zahl und einen Bindestrich voranzustellen, um die Sortierung der Dateien zu vereinfachen\&.

source: To disable a configuration file supplied by the vendor, the recommended way is to place a symlink to /dev/null in the configuration directory in /etc/, with the same filename as the vendor configuration file\&.
de: Um eine vom Lieferanten bereitgestellte Konfigurationsdatei zu deaktivieren, wird empfohlen, einen Symlink nach /dev/null in dem Konfigurationsverzeichnis in /etc/ mit dem gleichen Dateinamen wie die Konfigurationsdatei des Lieferanten abzulegen\&.

source: OPTIONS
de: OPTIONEN

source: The following settings are configured in the [Time] section:
de: Die folgenden Einstellungen werden im Abschnitt »[Time]« konfiguriert:

source: A space-separated list of NTP server host names or IP addresses\&. During runtime this list is combined with any per-interface NTP servers acquired from B<systemd-networkd.service>(8)\&. B<systemd-timesyncd> will contact all configured system or per-interface servers in turn, until one responds\&. When the empty string is assigned, the list of NTP servers is reset, and all prior assignments will have no effect\&. This setting defaults to an empty list\&.
de: Eine durch Leerzeichen getrennte Liste von NTP-Server-Rechnernamen oder IP-Adressen\&. Während der Laufzeit wird diese Liste mit allen schnittstellenbezogenen NTP-Servern, die von B<systemd-networkd.service>(8) erlangt wurden, kombiniert\&. B<systemd-timesyncd> wird alle konfigurierten System- oder schnittstellenbezogenen Server der Reihe nach kontaktieren, bis eine antwortet\&. Wird die leere Zeichenkette zugewiesen, wird die Liste der NTP-Server zurückgesetzt und alle vorherigen Zuweisungen haben keinen Effekt\&. Diese Einstellung ist standardmäßig die leere Liste\&.

source: A space-separated list of NTP server host names or IP addresses to be used as the fallback NTP servers\&. Any per-interface NTP servers obtained from B<systemd-networkd.service>(8) take precedence over this setting, as do any servers set via I<NTP=> above\&. This setting is hence only relevant if no other NTP server information is known\&. When the empty string is assigned, the list of NTP servers is reset, and all prior assignments will have no effect\&. If this option is not given, a compiled-in list of NTP servers is used\&.
de: Eine durch Leerzeichen getrennte Liste von NTP-Server-Rechnernamen oder IP-Adressen, die als Ausweich-NTP-Server verwandt werden sollen\&. Alle schnittstellenbezogenen NTP-Server, die von B<systemd-networkd.service>(8) besorgt wurden, haben vor dieser Einstellung Vorrang, sowie auch die oben mittels I<NTP=> gesetzten Server\&. Diese Einstellung ist daher nur relevant, wenn keine anderen NTP-Serverinformationen bekannt sind\&. Wird die leere Zeichenkette zugewiesen, wird die Liste der NTP-Server zurückgesetzt und alle vorherigen Zuweisungen haben keinen Effekt\&. Falls diese Option nicht angegeben ist, wird eine einkompilierte Liste von NTP-Servern verwandt\&.

source: Maximum acceptable root distance, i\&.e\&. the maximum estimated time required for a packet to travel to the server we are connected to from the server with the reference clock\&. If the current server does not satisfy this limit, B<systemd-timesyncd> will switch to a different server\&.
de: Maximal akzeptierbare Wurzeldistanz, d\&.h\&. die maximale geschätzte Zeit, die für ein Paket benötigt wird, um von dem mit uns verbundenen Server zum dem Server mit der Referenzuhr zu reisen\&. Falls der aktuelle Server diese Beschränkung nicht erfüllt, wird B<systemd-timesyncd> auf einen anderen Server umschalten\&.

source: Takes a time span value\&. The default unit is seconds, but other units may be specified, see B<systemd.time>(5)\&. Defaults to 5 seconds\&.
de: Akzeptiert einen Wert für eine Zeitdauer\&. Die Vorgabeeinheit ist Sekunden, aber andere Einheiten dürfen angegeben werden, siehe B<systemd.time>(5)\&. Standardmäßig 5 Sekunden\&.

source: The minimum and maximum poll intervals for NTP messages\&. Polling starts at the minimum poll interval, and is adjusted within the specified limits in response to received packets\&.
de: Die minimale und maximale Abfrageintervalle für NTP-Nachrichten\&. Abfragen beginnen bei dem minimalen Abfrageintervall und werden innerhalb der festgelegten Begrenzungen, abhängig von den empfangenen Paketen, angepasst\&.

source: Each setting takes a time span value\&. The default unit is seconds, but other units may be specified, see B<systemd.time>(5)\&. I<PollIntervalMinSec=> defaults to 32 seconds and must not be smaller than 16\ \&seconds\&. I<PollIntervalMaxSec=> defaults to 34\ \&min\ \&8\ \&s (2048\ \&seconds) and must be larger than I<PollIntervalMinSec=>\&.
de: Jede Einstellung akzeptiert einen Wert für eine Zeitdauer\&. Die Vorgabeeinheit ist Sekunden, aber andere Einheiten dürfen angegeben werden, siehe B<systemd.time>(5)\&. I<PollIntervalMinSec=> ist standardmäßig 32 Sekunden, darf aber nicht kleiner als 16\ \&Sekunden sein\&. I<PollIntervalMaxSec=> ist standardmäßig 34\ \&min\ \&8\&s (2048\ \&Sekunden) und muss größer als I<PollIntervalMinSec=> sein\&.

source: Specifies the minimum delay before subsequent attempts to contact a new NTP server are made\&.
de: Legt die minimale Verzögerung vor nachfolgenden Versuchen, einen neuen NTP-Server zu kontaktieren, fest\&.

source: Takes a time span value\&. The default unit is seconds, but other units may be specified, see B<systemd.time>(5)\&. Defaults to 30 seconds and must not be smaller than 1 second\&.
de: Akzeptiert einen Wert für eine Zeitdauer\&. Die Vorgabeeinheit ist Sekunden, aber andere Einheiten dürfen angegeben werden, siehe B<systemd.time>(5)\&. Standardmäßig 30 Sekunden und darf nicht kleiner als 1 Sekunde sein\&.

source: SEE ALSO
de: SIEHE AUCH

source: These configuration files control NTP network time synchronization\&. See B<systemd.syntax>(5) for a general description of the syntax\&.
de: Diese Konfigurationsdateien steuern die NTP-Netzwerkzeitsynchronisation\&. Siehe B<systemd.syntax>(5) für eine allgemeine Beschreibung der Syntax\&.

source: The default configuration is defined during compilation, so a configuration file is only needed when it is necessary to deviate from those defaults\&. By default, the configuration file in /etc/systemd/ contains commented out entries showing the defaults as a guide to the administrator\&. This file can be edited to create local overrides\&.
de: Die Standardkonfiguration wird während der Kompilierung definiert\&. Daher wird eine Konfigurationsdatei nur benötigt, wenn von diesen Vorgaben abgewichen werden muss\&. Standardmäßig enthält die Konfigurationsdatei in /etc/systemd/ die Vorgaben als auskommentierten Hinweis für den Administrator\&. Diese Datei kann bearbeitet werden, um lokal Einstellungen zu ändern\&.

source: When packages need to customize the configuration, they can install configuration snippets in /usr/lib/systemd/*\&.conf\&.d/ or /usr/local/lib/systemd/*\&.conf\&.d/\&. Files in /etc/ are reserved for the local administrator, who may use this logic to override the configuration files installed by vendor packages\&. The main configuration file is read before any of the configuration directories, and has the lowest precedence; entries in a file in any configuration directory override entries in the single configuration file\&. Files in the *\&.conf\&.d/ configuration subdirectories are sorted by their filename in lexicographic order, regardless of which of the subdirectories they reside in\&. When multiple files specify the same option, for options which accept just a single value, the entry in the file with the lexicographically latest name takes precedence\&. For options which accept a list of values, entries are collected as they occur in files sorted lexicographically\&. It is recommended to prefix all filenames in those subdirectories with a two-digit number and a dash, to simplify the ordering of the files\&.
de: Wenn Pakete die Konfiguration anpassen müssen, können sie Konfigurationsschnipsel in /usr/lib/systemd/*\&.conf\&.d/ oder /usr/local/lib/systemd/*\&.conf\&.d/ installieren\&. Dateien in /etc/ sind für den lokalen Administrator reserviert, der diese Logik dazu verwenden kann, die von Lieferantenpaketen installierten Konfigurationsdateien außer Kraft zu setzen\&. Die Hauptkonfigurationsdatei wird vor jeder anderen aus den Konfigurationsverzeichnissen gelesen und hat die niedrigste Priorität; Einträge in einer Datei in jedem der Konfigurationsverzeichnisse setzen Einträge in der einzelnen Konfigurationsdatei außer Kraft\&. Dateien in den Konfigurationsunterverzeichnissen *\&.conf\&.d/ werden in lexikographischer Reihenfolge nach ihrem Dateinamen sortiert, unabhängig davon, in welchem Unterverzeichnis sie sich befinden\&. Bei Optionen, die nur einen einzelnen Wert akzeptieren, hat der Eintrag in der Datei mit dem lexikographisch letzten Namen Vorrang, falls mehrere Dateien die gleiche Option festlegen\&. Bei Optionen, die eine Liste von Werten akzeptieren, werden Einträge zusammengefasst, wie sie in den lexikographisch sortierten Dateien auftauchen\&. Es wird empfohlen, allen Dateinamen in diesen Unterverzeichnissen eine zweistellige Zahl und einen Bindestrich voranzustellen, um die Anordnung der Dateien zu vereinfachen\&.

source: The following settings are configured in the "[Time]" section:
de: Die folgenden Einstellungen werden im Abschnitt »[Time]« konfiguriert:

source: A space-separated list of NTP server host names or IP addresses\&. During runtime this list is combined with any per-interface NTP servers acquired from B<systemd-networkd.service>(8)\&. systemd-timesyncd will contact all configured system or per-interface servers in turn until one is found that responds\&. When the empty string is assigned, the list of NTP servers is reset, and all assignments prior to this one will have no effect\&. This setting defaults to an empty list\&.
de: Eine durch Leerzeichen getrennte Liste von NTP-Server-Rechnernamen oder IP-Adressen\&. Während der Laufzeit wird diese Liste mit allen schnittstellenbezogenen NTP-Servern, die von B<systemd-networkd.service>(8) erlangt wurden, kombiniert\&. systemd-timesyncd wird alle konfigurierten System- oder schnittstellenbezogenen Server der Reihe nach kontaktieren, bis einer gefunden wird, der antwortet\&. Wird die leere Zeichenkette zugewiesen, wird die Liste der NTP-Server zurückgesetzt und alle Zuweisungen vor dieser haben keinen Effekt\&. Diese Einstellung ist standardmäßig die leere Liste\&.

source: A space-separated list of NTP server host names or IP addresses to be used as the fallback NTP servers\&. Any per-interface NTP servers obtained from B<systemd-networkd.service>(8) take precedence over this setting, as do any servers set via I<NTP=> above\&. This setting is hence only used if no other NTP server information is known\&. When the empty string is assigned, the list of NTP servers is reset, and all assignments prior to this one will have no effect\&. If this option is not given, a compiled-in list of NTP servers is used instead\&.
de: Eine durch Leerzeichen getrennte Liste von NTP-Server-Rechnernamen oder IP-Adressen, die als Ausweich-NTP-Server verwandt werden sollen\&. Alle schnittstellenbezogenen NTP-Server, die von B<systemd-networkd.service>(8) besorgt wurden, haben vor dieser Einstellung Vorrang, sowie auch die oben mittels I<NTP=> gesetzten Server\&. Diese Einstellung wird daher nur verwandt, wenn keine anderen NTP-Serverinformationen bekannt sind\&. Wird die leere Zeichenkette zugewiesen, wird die Liste der NTP-Server zurückgesetzt und alle Zuweisungen vor dieser haben keinen Effekt\&. Falls diese Option nicht angegeben ist, wird stattdessen eine einkompilierte Liste von NTP-Servern verwandt\&.

source: Maximum acceptable root distance\&. Takes a time value (in seconds)\&. Defaults to 5 seconds\&.
de: Maximal akzeptierbare Wurzeldistanz\&. Akzeptiert einen Zeitwert (in Sekunden)\&. Standardmäßig 5 Sekunden\&.

source: The minimum and maximum poll intervals for NTP messages\&. Each setting takes a time value (in seconds)\&. I<PollIntervalMinSec=> must not be smaller than 16 seconds\&. I<PollIntervalMaxSec=> must be larger than I<PollIntervalMinSec=>\&. I<PollIntervalMinSec=> defaults to 32 seconds, and I<PollIntervalMaxSec=> defaults to 2048 seconds\&.
de: Die minimalen und maximalen Abfrageintervalle für NTP-Nachrichten\&. Jede Einstellung akzeptiert einen Zeitwert (in Sekunden)\&. I<PollIntervalMinSec=> darf nicht kleiner als 16 Sekunden sein\&. I<PollIntervalMaxSec=> muss größer als I<PollIntervalMinSec=> sein\&. I<PollIntervalMinSec=> ist standardmäßig 32 Sekunden und I<PollIntervalMaxSec=> ist standardmäßig 2048 Sekunden\&.

source: When packages need to customize the configuration, they can install configuration snippets in /usr/lib/systemd/*\&.conf\&.d/ or /usr/local/lib/systemd/*\&.conf\&.d/\&. The main configuration file is read before any of the configuration directories, and has the lowest precedence; entries in a file in any configuration directory override entries in the single configuration file\&. Files in the *\&.conf\&.d/ configuration subdirectories are sorted by their filename in lexicographic order, regardless of in which of the subdirectories they reside\&. When multiple files specify the same option, for options which accept just a single value, the entry in the file with the lexicographically latest name takes precedence\&. For options which accept a list of values, entries are collected as they occur in files sorted lexicographically\&.
de: Wenn Pakete die Konfiguration anpassen müssen, können sie Konfigurationsschnipsel in /usr/lib/systemd/*\&.conf\&.d/ oder /usr/local/lib/systemd/*\&.conf\&.d/ installieren\&. Die Hauptkonfigurationsdatei wird vor jeder anderen aus den Konfigurationsverzeichnissen gelesen und hat die niedrigste Priorität; Einträge in einer Datei in jedem der Konfigurationsverzeichnisse setzen Einträge in der einzelnen Konfigurationsdatei außer Kraft\&. Dateien in den Konfigurationsunterverzeichnissen *\&.conf\&.d/ werden in lexikographischer Reihenfolge nach ihrem Dateinamen sortiert, unabhängig davon, in welchem Unterverzeichnis sie sich befinden\&. Bei Optionen, die nur einen einzelnen Wert akzeptieren, hat der Eintrag in der Datei mit dem lexikographisch letzten Namen Vorrang, falls mehrere Dateien die gleiche Option angeben\&. Bei Optionen, die eine Liste von Werten akzeptieren, werden Einträge zusammengefasst, wie sie in den lexikographisch sortierten Dateien auftauchen\&.

source: Files in /etc/ are reserved for the local administrator, who may use this logic to override the configuration files installed by vendor packages\&. It is recommended to prefix all filenames in those subdirectories with a two-digit number and a dash, to simplify the ordering of the files\&.
de: Dateien in /etc/ sind für den lokalen Administrator reserviert, der diese Logik verwenden kann, um die durch die Lieferantenpakete bereitgestellten Konfigurationsdateien außer Kraft zu setzen\&. Es wird empfohlen, allen Dateinamen in diesen Unterverzeichnissen eine zweistellige Zahl und einen Bindestrich voranzustellen, um die Sortierung der Dateien zu vereinfachen\&.
