Repository: krisfremen/manpages-l10n
Catalog: po/*/man5/vlock-plugins.5.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: vlock-plugins - plugin support for vlock
de: vlock-plugins - Unterstützung für Erweiterungen für Vlock

source: DESCRIPTION
de: BESCHREIBUNG

source: If vlock-main(8) is compiled with plugin support its default features are very limited: it can only lock the current session and ask for authenticiaton. However it is possible to extend this functions through plugins. These plugins are loaded when vlock-main starts and can provide hooks that are called at certain points during the lifetime of the vlock-main process.
de: Falls B<vlock-main>(8) mit Unterstützung für Erweiterungen kompiliert wurde, sind seine Standardfunktionalitäten recht eingeschränkt: Es kann nur die aktuelle Sitzung sperren und um die Authentifizierung bitten. Es ist allerdings möglich, diese Funktionen durch Erweiterungen zu erweitern. Diese Erweiterungen werden beim Start von Vlock-Main geladen und können Einhängepunkte bereitstellen, die an bestimmten Punkten während der Lebensdauer des Vlock-Main-Prozesses aufgerufen werden.

source: DEFAULT PLUGINS
de: STANDARD-ERWEITERUNGEN

source: The following plugins are provided when installing vlock with default options:
de: Die folgenden Erweiterungen werden bereitgestellt, wenn B<vlock>(1) mit den Standardoptionen installiert wird:

source: This plugin locks all sessions by disabling console switching. It is also loaded when giving the B<-a,--all> option to vlock(1).
de: Diese Erweiterung sperrt alle Sitzungen, indem das Konsole-Umschalten deaktiviert wird. Sie wird auch geladen, wenn die Option B<-a,--all> an B<vlock>(1) übergeben wird.

source: This plugin switches to a new virtual console before disabling console switching through the "all" plugin. It is also loaded when giving the B<-n,--new> option to vlock(1).
de: Diese Erweiterung schaltet auf eine neue virtuelle Konsole, bevor sie das Konsole-Umschalten über die Erweiterung »all« deaktiviert. Sie wird auch geladen, wenn die Option B<-n,--new> an B<vlock>(1) übergeben wird.

source: Linux only. This plugin disables the Linux SysRQ mechanism before the console switching is locked by the "all" plugin. It is also loaded when giving the B<-s,--disable-sysrq> option to vlock(1).
de: Nur Linux. Diese Erweiterung deaktiviert den Linux-SysRQ-Mechanismus, bevor die Konsoleumschaltung über die Erweiterung »all« deaktiviert wird. Sie wird auch geladen, wenn die Option B<-s,--disable-sysrq> an B<vlock>(1) übergeben wird.

source: ADDITIONAL PLUGINS
de: ZUSÄTZLICHE ERWEITERUNGEN

source: The following plugins are only available if explicitly selected at build time:
de: Die folgenden Erweiterungen sind nur verfügbar, falls sie zum Bauzeitpunkt explizit ausgewählt wurden:

source: This plugin runs a random libcaca screensaver when the screen is locked.
de: Diese Erweiterung führt einen zufälligen Libcaca-Bildschirmschoner aus, wenn der Bildschirm gesperrt ist.

source: WRITING PLUGINS
de: ERWEITERUNGEN SCHREIBEN

source: For information about writing plugins see the PLUGINS file in the vlock source distribution.
de: Lesen Sie die Datei PLUGINS in der Vlock-Quelldistribution bezüglich Informationen zum Schreiben von Erweiterungen.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN
