Repository: krisfremen/manpages-l10n
Catalog: po/*/man7/sysvipc.7.po
Languages: fr

source: Linux Programmer's Manual
fr: Manuel du programmeur Linux

source: NAME
fr: NOM

source: sysvipc - System V interprocess communication mechanisms
fr: sysvipc – Mécanismes System V de communication entre processus

source: System V IPC is the name given to three interprocess communication mechanisms that are widely available on UNIX systems: message queues, semaphore, and shared memory.
fr: IPC System V est le nom donné à trois mécanismes de communication interprocessus qui sont largement utilisés sur les systèmes UNIX : file de messages, sémaphore et mémoire partagée.

source: Message queues
fr: Files de messages

source: System V message queues allow data to be exchanged in units called messages. Each messages can have an associated priority, POSIX message queues provide an alternative API for achieving the same result; see B<mq_overview>(7).
fr: Les files de messages de System V permettent d’échanger des données entre des éléments appelés messages. À chaque message peut être associée une priorité. Les files de messages POSIX fournissent une autre API possible pour obtenir le même résultat. Consultez B<mq_overview>(7).

source: The System V message queue API consists of the following system calls:
fr: L’API de file de messages de System V se compose des appels suivants :

source: Create a new message queue or obtain the ID of an existing message queue. This call returns an identifier that is used in the remaining APIs.
fr: Création d’une nouvelle file de messages ou obtention de l’identifiant d’une file de messages existante. Cet appel renvoie un identifiant utilisé dans les API restantes.

source: Add a message to a queue.
fr: Ajout d’un message à une file de messages.

source: Remove a message from a queue.
fr: Suppression d’un message d’une file de messages.

source: Perform various control operations on a queue, including deletion.
fr: Réalisation de diverses opérations de contrôle sur une file de messages, y compris une suppression.

source: Semaphore sets
fr: Jeux de sémaphores

source: System V semaphores allow processes to synchronize their actions System V semaphores are allocated in groups called sets; each semaphore in a set is a counting semaphore. POSIX semaphores provide an alternative API for achieving the same result; see B<sem_overview>(7).
fr: Les sémaphores de System V permettent aux processus de synchroniser leurs actions. Ces sémaphores sont alloués dans des groupes appelés ensembles. Chaque sémaphore dans un ensemble est un sémaphore de décompte. Les sémaphores POSIX fournissent une autre API possible pour obtenir le même résultat. Consultez B<sem_overview>(7).

source: The System V semaphore API consists of the following system calls:
fr: L’API de sémaphores de System V se compose des appels système suivants :

source: Create a new set or obtain the ID of an existing set. This call returns an identifier that is used in the remaining APIs.
fr: Création d’un nouvel ensemble ou obtention de l’identifiant d’un ensemble existant. Cet appel renvoie un identifiant qui est utilisé par les API restantes.

source: Perform operations on the semaphores in a set.
fr: Réalisation d’opérations sur les sémaphores d’un ensemble.

source: Perform various control operations on a set, including deletion.
fr: Réalisation de diverses opérations de contrôle sur un ensemble, y compris une suppression.

source: Shared memory segments
fr: Segments de mémoire partagée

source: System V shared memory allows processes to share a region a memory (a "segment"). POSIX shared memory is an alternative API for achieving the same result; see B<shm_overview>(7).
fr: La mémoire partagée de System V permet aux processus de partager une région de mémoire (un « segment »). La mémoire partagée de POSIX fournit une autre API possible pour obtenir le même résultat. Consultez B<shm_overview>(7).

source: The System V shared memory API consists of the following system calls:
fr: L’API de mémoire partagée de System V se compose des appels système suivants :

source: Create a new segment or obtain the ID of an existing segment. This call returns an identifier that is used in the remaining APIs.
fr: Création d’un nouveau segment ou obtention de l’identifiant d’un segment existant. Cet appel renvoie un identifiant qui est utilisé par les API restantes.

source: Attach an existing shared memory object into the calling process's address space.
fr: Attachement d’un objet existant de mémoire partagée dans l’espace d’adresses du processus appelant.

source: Detach a segment from the calling process's address space.
fr: Détachement d’un segment dans l’espace d’adresses du processus appelant.

source: Perform various control operations on a segment, including deletion.
fr: Réalisation de diverses opérations de contrôle sur un segment, y compris une suppression.

source: IPC namespaces
fr: Espaces de noms IPC

source: For a discussion of the interaction of System V IPC objects and IPC namespaces, see B<ipc_namespaces>(7).
fr: Pour en savoir plus sur les interactions entre les objets IPC de System V et les espaces de noms IPC, consultez B<ipc_namespaces>(7).

source: SEE ALSO
fr: VOIR AUSSI

source: This page is part of release 5.11 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.11 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This manual page refers to the Linux implementation of the System V interprocess communication (IPC) mechanisms: message queues, semaphore sets, and shared memory segments. In the following, the word I<resource> means an instantiation of one among such mechanisms.
fr: Cette page de manuel documente l'implémentation sous Linux des mécanismes de communication interprocessus de System V (IPC : « InterProcess Communication »)\ : files de messages, ensembles de sémaphores et segments de mémoire partagée. Par la suite, le mot I<ressource> se rapportera à une instanciation de l'un de ces mécanismes.

source: Resource access permissions
fr: Autorisations d'accès aux ressources

source: For each resource, the system uses a common structure of type I<struct ipc_perm> to store information needed in determining permissions to perform an IPC operation. The I<ipc_perm> structure includes the following members:
fr: Pour chaque ressource, le système utilise une structure commune, de type I<struct ipc_perm>, pour enregistrer les informations permettant de déterminer les autorisations concernant les opérations IPC. La structure I<ipc_perm> comporte les membres suivants :

source: struct ipc_perm { uid_t cuid; /* creator user ID */ gid_t cgid; /* creator group ID */ uid_t uid; /* owner user ID */ gid_t gid; /* owner group ID */ unsigned short mode; /* r/w permissions */ };
fr: struct ipc_perm { uid_t cuid; /* UID du créateur */ gid_t cgid; /* GID du créateur */ uid_t uid; /* UID du propriétaire */ gid_t gid; /* GID du propriétaire */ unsigned short mode; /* autorisations lect/écriture */ };

source: The I<mode> member of the I<ipc_perm> structure defines, with its lower 9 bits, the access permissions to the resource for a process executing an IPC system call. The permissions are interpreted as follows:
fr: Le membre I<mode> de la structure I<ipc_perm> définit, sur ses 9 bits de poids faible, les permissions d'accès à la ressource pour un processus effectuant un appel système IPC. Les permissions sont interprétées ainsi\ :

source: 0400 Read by user. 0200 Write by user. 0040 Read by group. 0020 Write by group. 0004 Read by others. 0002 Write by others.
fr: 0400 lecture pour l’utilisateur 0200 écriture pour l’utilisateur 0040 lecture pour le groupe 0020 écriture pour le groupe 0004 lecture pour les autres 0002 écriture pour les autres

source: Bits 0100, 0010, and 0001 (the execute bits) are unused by the system. Furthermore, "write" effectively means "alter" for a semaphore set.
fr: Les bits 0100, 0010 et 0001 (bits exécution) ne sont pas utilisés par le système. De plus, «\ écriture\ » signifie de fait «\ modification\ » pour un ensemble de sémaphores.

source: The same system header file also defines the following symbolic constants:
fr: Le même fichier d'en-tête définit également les constantes symboliques suivantes\ :

source: Create entry if key doesn't exist.
fr: Créer une entrée si la clé n'existe pas.

source: Fail if key exists.
fr: Échouer si la clé existe.

source: Error if request must wait.
fr: Retourner une erreur si la requête doit attendre.

source: Private key.
fr: Clé privée.

source: Remove resource.
fr: Supprimer la ressource.

source: Set resource options.
fr: Positionner les options concernant la ressource.

source: Get resource options.
fr: Obtenir les options concernant la ressource.

source: Note that B<IPC_PRIVATE> is a I<key_t> type, while all the other symbolic constants are flag fields and can be OR'ed into an I<int> type variable.
fr: Notez que B<IPC_PRIVATE> est du type I<key_t> alors que les autres constantes symboliques sont des champs d'indicateurs qui peuvent être regroupés avec un OU logique dans une variable de type I<int>.

source: A message queue is uniquely identified by a positive integer (its I<msqid>) and has an associated data structure of type I<struct msqid_ds>, defined in I<E<lt>sys/msg.hE<gt>>, containing the following members:
fr: Une file de messages est définie uniquement par un entier positif (son I<msqid>) et dispose d'une structure de données associée de type I<struct msqid_ds>, définie dans I<E<lt>sys/msg.hE<gt>>, qui contient les membres suivants :

source: struct msqid_ds { struct ipc_perm msg_perm; msgqnum_t msg_qnum; /* no of messages on queue */ msglen_t msg_qbytes; /* bytes max on a queue */ pid_t msg_lspid; /* PID of last msgsnd(2) call */ pid_t msg_lrpid; /* PID of last msgrcv(2) call */ time_t msg_stime; /* last msgsnd(2) time */ time_t msg_rtime; /* last msgrcv(2) time */ time_t msg_ctime; /* last change time */ };
fr: struct msqid_ds { struct ipc_perm msg_perm; msgqnum_t msg_qnum; /* nb de messages dans la file */ msglen_t msg_qbytes; /* nb max d’octets dans la file */ pid_t msg_lspid; /* PID du dernier appel à msgsnd(2) */ pid_t msg_lrpid; /* PID du dernier appel à msgrcv(2) */ time_t msg_stime; /* heure du dernier appel à msgsnd(2) */ time_t msg_rtime; /* heure du dernier appel à msgrcv(2) */ time_t msg_ctime; /* heure de dernière modification */ };

source: I<ipc_perm> structure that specifies the access permissions on the message queue.
fr: Structure I<ipc_perm> qui indique les permissions d'accès sur la file de messages.

source: Number of messages currently on the message queue.
fr: Nombre de messages actuellement dans la file de messages.

source: Maximum number of bytes of message text allowed on the message queue.
fr: Nombre maximal d'octets de texte de message autorisés dans la file de messages.

source: ID of the process that performed the last B<msgsnd>(2) system call.
fr: Identifiant du processus qui a effectué le dernier appel système B<msgsnd>(2).

source: ID of the process that performed the last B<msgrcv>(2) system call.
fr: Identifiant du processus qui a effectué le dernier appel système B<msgrcv>(2).

source: Time of the last B<msgsnd>(2) system call.
fr: Heure du dernier appel système B<msgsnd>(2).

source: Time of the last B<msgrcv>(2) system call.
fr: Heure du dernier appel système B<msgrcv>(2).

source: Time of the last system call that changed a member of the I<msqid_ds> structure.
fr: Heure du dernier appel système qui a modifié un membre de la structure I<msqid_ds>.

source: A semaphore set is uniquely identified by a positive integer (its I<semid>) and has an associated data structure of type I<struct semid_ds>, defined in I<E<lt>sys/sem.hE<gt>>, containing the following members:
fr: Un ensemble de sémaphores est défini uniquement par un entier positif (son I<semid>) et dispose d'une structure de données associée de type I<struct semid_ds>, définie dans I<E<lt>sys/sem.hE<gt>>, qui contient les membres suivants :

source: struct semid_ds { struct ipc_perm sem_perm; time_t sem_otime; /* last operation time */ time_t sem_ctime; /* last change time */ unsigned long sem_nsems; /* count of sems in set */ };
fr: struct semid_ds { struct ipc_perm sem_perm; time_t sem_otime; /* heure dernière opération */ time_t sem_ctime; /* heure dernière modification */ unsigned long sem_nsems; /* nb sémaphores de l’ensemble */ };

source: I<ipc_perm> structure that specifies the access permissions on the semaphore set.
fr: Structure I<ipc_perm> qui indique les permissions d'accès sur l'ensemble de sémaphores.

source: Time of last B<semop>(2) system call.
fr: Heure du dernier appel système B<semop>(2).

source: Time of last B<semctl>(2) system call that changed a member of the above structure or of one semaphore belonging to the set.
fr: Heure du dernier appel système B<semctl>(2) qui a modifié un membre de la structure ci-dessus ou l'état d'un sémaphore de l'ensemble.

source: Number of semaphores in the set. Each semaphore of the set is referenced by a nonnegative integer ranging from B<0> to I<sem_nsems-1>.
fr: Nombre de sémaphores dans l'ensemble. Chaque sémaphore est référencé par un entier positif ou nul, compris dans l'intervalle B<0> à I<sem_nsems-1>.

source: A semaphore is a data structure of type I<struct sem> containing the following members:
fr: Un sémaphore est une structure de données de type I<struct sem> contenant les membres suivants :

source: struct sem { int semval; /* semaphore value */ int sempid; /* PID of process that last modified */ };
fr: struct sem { int semval; /* valeur du sémaphore */ int sempid; /* PID du dernier processus modificateur */ };

source: Semaphore value: a nonnegative integer.
fr: Valeur du sémaphore\ : entier positif ou nul.

source: PID of the last process that modified the value of this semaphore.
fr: PID du dernier processus ayant modifié la valeur de ce sémaphore.

source: A shared memory segment is uniquely identified by a positive integer (its I<shmid>) and has an associated data structure of type I<struct shmid_ds>, defined in I<E<lt>sys/shm.hE<gt>>, containing the following members:
fr: Un segment de mémoire partagée est défini uniquement par un entier positif (son I<shmid>) et dispose d'une structure de données associée de type I<struct shmid_ds>, définie dans I<E<lt>sys/shm.hE<gt>>, qui contient les membres suivants :

source: struct shmid_ds { struct ipc_perm shm_perm; size_t shm_segsz; /* size of segment */ pid_t shm_cpid; /* PID of creator */ pid_t shm_lpid; /* PID, last operation */ shmatt_t shm_nattch; /* no. of current attaches */ time_t shm_atime; /* time of last attach */ time_t shm_dtime; /* time of last detach */ time_t shm_ctime; /* time of last change */ };
fr: struct shmid_ds { struct ipc_perm shm_perm; size_t shm_segsz; /* taille du segment */ pid_t shm_cpid; /* PID du créateur */ pid_t shm_lpid; /* PID, dernière opération */ shmatt_t shm_nattch; /* nb d'attachements actuel */ time_t shm_atime; /* heure dernier attachement */ time_t shm_dtime; /* heure dernier détachement */ time_t shm_ctime; /* heure dernière modification */ };

source: I<ipc_perm> structure that specifies the access permissions on the shared memory segment.
fr: Structure I<ipc_perm> qui indique les permissions d'accès sur le segment de mémoire partagée.

source: Size in bytes of the shared memory segment.
fr: Taille en octets du segment de mémoire partagée.

source: ID of the process that created the shared memory segment.
fr: PID du processus ayant créé le segment de mémoire partagée.

source: ID of the last process that executed a B<shmat>(2) or B<shmdt>(2) system call.
fr: ID du processus ayant effectué le dernier appel système B<shmat>(2) ou B<shmdt>(2).

source: Number of current alive attaches for this shared memory segment.
fr: Nombre d'attachements en cours pour ce segment de mémoire partagée.

source: Time of the last B<shmat>(2) system call.
fr: Heure du dernier appel système B<shmat>(2).

source: Time of the last B<shmdt>(2) system call.
fr: Heure du dernier appel système B<shmdt>(2).

source: Time of the last B<shmctl>(2) system call that changed I<shmid_ds>.
fr: Heure du dernier appel système B<shmctl>(2) qui a modifié I<shmid_ds>.

source: This page is part of release 5.04 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.04 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.

source: This page is part of release 5.10 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%https://www.kernel.org/doc/man-pages/.
fr: Cette page fait partie de la publication 5.10 du projet I<man-pages> Linux. Une description du projet et des instructions pour signaler des anomalies et la dernière version de cette page peuvent être trouvées à l'adresse \%https://www.kernel.org/doc/man-pages/.
