Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/access.1.po
Languages: hu

source: NAME
hu: NÉV

source: access - determine whether a file can be accessed
hu: access - eldönti egy fájlról, hogy elérhető-e

source: SYNOPSIS
hu: ÁTTEKINTÉS

source: B<access> I<-mode> I<file>
hu: B<access> I<-mód> I<fájl>

source: DESCRIPTION
hu: LEÍRÁS

source: Exit successfully if I<file> can be accessed with the specified mode. I<mode> is one or more letters of I<rwx>, where I<r> is for readable, I<w> is for writable, and I<x> is for executable.
hu: Igaz értékkel tér vissza, ha a megadott I<fájl> a megadott módon elérhető. A I<mód> az I<rwx> betűk egyikével adható meg, ahol az I<r> az olvashatóságot, a I<w> az írhatóságot, és az I<x> a végrehajthatóságot jelenti.

source: The difference between B<access> and B<test> is that the latter looks at the permission bits, while the former checks using the B<access>(2) system call. This makes a difference when file systems have been mounted read-only.
hu: A különbség az B<access> és a B<test> között az, hogy ez utóbbi a fájlra vonatkozó jogosultságbiteket vizsgálja, míg az utóbbi az B<access>(2) rendszerhívás segítségével vizsgálja az elérhetőséget. Ennek például csak olvasható módban csatolt fájlrendszereknél van jelentősége.

source: OPTIONS
hu: OPCIÓK

source: B<access> accepts the following additional options:
hu: Az B<access> elfogadja még a következő opciókat:

source: Print help message and exit.
hu: Kiírja a használattal kapcsolatos segítő információkat és kilép.

source: SEE ALSO
hu: LÁSD MÉG
