Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/cdp.1.po
Languages: es

source: 10 Nov 1995
es: 10 de noviembre de 1995

source: Audio CD Player
es: Reproductor de CDs de Audio

source: NAME
es: NOMBRE

source: cdplay -- an interactive text-mode program for controlling and playing audio CD Roms under Linux.
es: cdplay -- un programa interactivo en modo texto para controlar y reproducirCDs de audio bajo Linux.

source: SYNOPSIS
es: SINOPSIS

source: B<cdp> [ -h | -l | -n | -s ] [play E<lt>track-numE<gt>]
es: B<cdp> [ -h | -l | -n | -s ] [reproduce E<lt>pista-numE<gt>]

source: B<cdplay> [ -h | -l | -n | -s ] [play E<lt>numE<gt>] [stop] [table]
es: B<cdplay> [ -h | -l | -n | -s ] [reproduce E<lt>numE<gt>] [para] [tabla]

source: -s : Start in silent mode
es: -s : Comienza en modo silencioso

source: -h : help
es: -h : ayuda

source: -n : No autoplay
es: -n : Desactiva la reproducción automática

source: -l : slow start (wait for init)
es: -l : comienzo lento (espera por init)

source: play E<lt>numE<gt> : autoplay from E<lt>numE<gt> track of CD
es: play E<lt>numE<gt> : reproducción automática desde la pista E<lt>numE<gt> del CD

source: stop : Stop the CD.
es: stop : Detiene el CD.

source: table : display CD table of contents from database
es: table : muestra la tabla de contenidos del CD desde la base de datos

source: Type B<cdp> to start program. Engage the NUM LOCK on your keypad. From inside cdp pressing DEL on numeric keypad will display a help menu. While running, B<cdp> will display the current track number and both total CD elapsed time and current track elapsed time. Note that total CD elapsed time includes times for non-audio data tracks in addition to playable tracks.
es: Escribe B<cdp> para iniciar el programa. Habilita el NUM LOCK de tu teclado numérico. Desde el programa cdp, al pulsar la tecla DEL del teclado numérico se muestra un menú de ayuda. Mientras se está ejecutando, el programa B<cdp> muestra el número de pista en reproducción y el tiempo total de duración del CD y de la pista actual reproducidos hasta ese momento. Nótese que el tiempo total de CD reproducido incluye todas las pistas del CD, contengan audio o no.

source: Use B<cdplay> to use the non-iteractive version of cdp.
es: Usa B<cdplay> para usar la versión de cdp no interactiva.

source: DESCRIPTION
es: DESCRIPCIÓN

source: B<cdp> is an interactive TEXT-MODE program for playing audio CDs under Linux. It is based on WorkBone, which in turn is based on the modules "hardware.c", "database.c" and "struct.c" from the elaborate X11 CD program known as WorkMan. B<cdp> Display CD databases, as generated by WorkMan. It also enable editing this information.
es: B<cdp> es un programa interactivo en modo texto para reproducir CDs de audio bajo Linux. Se basa en WorkBone, que a su vez se basa en los módulos "hardware.c", "database.c" y "struct.c" del avanzado reproductor de CDs para X11 conocido como WorkMan. B<cdp> muestra las bases de datos de CDs generadas por Workman. Permite también editar esta información.

source: B<cdp> expects to find the device: /dev/cdrom . If you don't have this device, change to /dev and soft link your current cd rom device to 'cdrom'. For example, if you currently call your cdrom device 'mcd0', then do the following:
es: B<cdp> espera encontrar el dispositivo /dev/cdrom. Si no tienes este dispositivo, cambia a /dev y haz un enlace simbólico entre tu dispositivo y 'cdrom'. Por ejemplo, si tu dispositivo lector de CDs se llama 'mcd0', entonces haz lo siguiente:

source: Alternatively, just edit 'hardware.c' to reflect the name of your cdrom device and recompile.
es: Otra alternativa sería editar el archivo 'hardware.c' para que figure el nombre de tu dispositivo lector de CDs y recompilar el programa.

source: B<cdp> uses the numeric keypad as a control panel to allow you to move track to track, play, pause, stop, and resume playing of audio CDs. Make sure you have your NUM LOCK engaged when using B<cdp.> A graphical template is displayed to guide you. Running times are also continuously updated and displayed.
es: B<cdp> usa el teclado numérico como panel de control para permitirte cambiar de pista, reproducir, hacer pausa, parar y continuar reproduciendo CDs de audio. Asegúrate de que la luz de NUM LOCK está encendida al usar B<cdp>. Se muestra un esquema gráfico en pantalla a manera de guía. Los tiempos de ejecución se actualizan y muestran también continuamente.

source: +---- number pad -----+
es: +- teclado numérico --+

source: the '9' key on the keypad is "play"
es: la tecla '9' del teclado numérico es "reproducir"

source: the '8' key on the keypad is "pause/resume"
es: la tecla '8' del teclado numérico es "pausa/continuar"

source: the '7' key on the keypad is "stop"
es: la tecla '7' del teclado numérico es "parar"

source: the '6' key on the keypad is "next"
es: la tecla '6' del teclado numérico es "pista siguiente"

source: the '5' key on the keypad is "replay"
es: la tecla '5' del teclado numérico es "volver a reproducir"

source: the 4 key on the keypad is "previous"
es: la tecla '4' del teclado numérico es "pista anterior"

source: the '3' key on the keypad is "go forward 15 seconds"
es: la tecla '3' del teclado numérico es "avanzar 15 segundos"

source: the '2' key on the keypad is "hard abort" (music stops)
es: la tecla '2' del teclado numérico es "parar en seco" (la música para)

source: the '1' key on the keypad is "go backward 15 seconds"
es: la tecla '1' del teclado numérico es "retroceder 15 segundos"

source: the '0' key on the keypad is "soft exit" (music continues)
es: la tecla '0' del teclado numérico es "salida suave" (la música continúa)

source: the '.' key on the keypad is "help"
es: la tecla '.' del teclado numérico es "ayuda"

source: the 'enter' key is edit current song.
es: la tecla 'enter (o intro)' del teclado numérico es "editar la canción actual"

source: the 'a' key is edit artist name
es: la tecla 'a' es "editar el nombre del artista"

source: the 'c' key is edit CD name
es: la tecla 'c' es "editar el nombre del CD"

source: COPYING
es: COPIADO

source: B<cdp> is B<copyrighted> free software provided WITHOUT warranty of any kind, NOT EVEN the implied warranty of merchantablilty or fitness for any particular purpose. Use at your own risk. B<cdp> may be used in any way you wish so long as you comply with the provisions of the Free Software Foundation B<GNU General Public License > version 2. This software should have come with a copy of the GNU General Public License. You may obtain a copy of this license by writing to:
es: El programa B<cdp> tiene B<copyright> de software libre desprovisto de garantía de cualquier tipo, NI SIQUIERA la garantía implícita de ser apto para su distribución comercial ni destinado a un uso en particular. Úsalo bajo tu propia responsabilidad. B<cdp> puede usarse de la manera que se quiera siempre y cuando se cumplan las disposiciones B<GNU General Public License > version 2 de la Free Software Foundation. Este software debería venir acompañado de una copia de la Licencia Pública General GNU. Puedes obtener una copia de esta licencia escribiendo a:

source: BUGS
es: FALLOS

source: It is doubtful that I will do much development of B<cdp.> I extended WorkBone 0.1 to support WorkMan CD databases. This program is a further extension of WorkBoneII 0.2 to support CD database editing. Please e-mail any bug fixes or improvements that you might have. B<cdp> works with my Mitsumi FX001D CD Rom drive, but your mileage with other drives may vary. Only generic calls and functions are used as per WorkMan proper itself. Unlike WorkBone cdp uses ncurses for displaying its screen. If anyone is interested in porting it to other platforms please email me.
es: Es improbable que desarrolle más el programa B<cdp>. Amplié WorkBone 0.1 para que diese soporte a las bases de datos de Workman. Este programa es una extensión a mayores de WorkBone II 0.2 con soporte de edición de bases de datos. Por favor, hazme saber cualquier solución a un fallo o posterior desarrollo del programa que puedas llevar a cabo. B<cdp> funciona con un lector de CDRom Mitsumi FX001D, pero las cantidades mostradas por el programa pueden variar con respecto a otros aparatos. Sólo se usan llamadas y rutinas genéricas del mismo modo que lo hace WorkMan. A diferencia de WorkBone, cdp usa ncurses para mostrar su pantalla. Si alguien está interesado en portar el programa a otras plataformas, por favor mandadme un e-mail.

source: enjoy.
es: ¡que disfrutéis!
