Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: %x comment foo %% int line_num = 1; int comment_caller;
es: %x comentario foo %% int num_linea = 1; int invocador_comentario;

source: "/*" { comment_caller = INITIAL; BEGIN(comment); }
es: "/*" { invocador_comentario = INITIAL; BEGIN(comentario); }

source: E<lt>fooE<gt>"/*" { comment_caller = foo; BEGIN(comment); }
es: E<lt>fooE<gt>"/*" { invocador_comentario = foo; BEGIN(comentario); }

source: E<lt>commentE<gt>[^*\en]* /* eat anything that's not a '*' */ E<lt>commentE<gt>"*"+[^*/\en]* /* eat up '*'s not followed by '/'s */ E<lt>commentE<gt>\en ++line_num; E<lt>commentE<gt>"*"+"/" BEGIN(comment_caller);
es: E<lt>comentarioE<gt>[^*\en]* /* se come cualquier cosa que no sea un '*' */ E<lt>comentarioE<gt>"*"+[^*/\en]* /* se come '*'s que no continuen con '/'s */ E<lt>comentarioE<gt>\en ++num_linea; E<lt>comentarioE<gt>"*"+"/" BEGIN(invocador_comentario);

source: Furthermore, you can access the current start condition using the integer-valued B<YY_START> macro. For example, the above assignments to I<comment_caller> could instead be written
es: Además, puede acceder a la condición de arranque actual usando la macro de valor entero B<YY_START.> Por ejemplo, las asignaciones anteriores a I<invocador_comentario> podrían escribirse en su lugar como

source: comment_caller = YY_START;
es: invocador_comentario = YY_START;

source: Flex provides B<YYSTATE> as an alias for B<YY_START> (since that is what's used by AT&T I<lex).>
es: Flex ofrece B<YYSTATE> como un alias para B<YY_START> (ya que es lo que usa I<lex> de AT&T).

source: Note that start conditions do not have their own name-space; %s's and %x's declare names in the same fashion as #define's.
es: Fíjese que las condiciones de arranque no tienen su propio espacio de nombres; los %s's y %x's declaran nombres de la misma manera que con #define's.

source: Finally, here's an example of how to match C-style quoted strings using exclusive start conditions, including expanded escape sequences (but not including checking for a string that's too long):
es: Finalmente, aquí hay un ejemplo de cómo emparejar cadenas entre comillas al estilo de C usando condiciones de arranque exclusivas, incluyendo secuencias de escape expandidas (pero sin incluir la comprobación de cadenas que son demasiado largas):

source: E<lt>strE<gt>\e" { /* saw closing quote - all done */ BEGIN(INITIAL); *string_buf_ptr = '\e0'; /* return string constant token type and * value to parser */ }
es: E<lt>strE<gt>\e" { /* se vio la comilla que cierra - todo está hecho */ BEGIN(INITIAL); *string_buf_ptr = '\e0'; /* devuelve un tipo de token de cadena constante y * el valor para el analizador sintáctico */ }

source: E<lt>strE<gt>\en { /* error - unterminated string constant */ /* generate error message */ }
es: E<lt>strE<gt>\en { /* error - cadena constante sin finalizar */ /* genera un mensaje de error */ }

source: E<lt>strE<gt>\e\e[0-7]{1,3} { /* octal escape sequence */ int result;
es: E<lt>strE<gt>\e\e[0-7]{1,3} { /* secuencia de escape en octal */ int resultado;

source: (void) sscanf( yytext + 1, "%o", &result );
es: (void) sscanf( yytext + 1, "%o", &resultado );

source: if ( result E<gt> 0xff ) /* error, constant is out-of-bounds */
es: if ( resultado E<gt> 0xff ) /* error, constante fuera de rango */

source: *string_buf_ptr++ = result; }
es: *string_buf_ptr++ = resultado; }

source: E<lt>strE<gt>\e\e[0-9]+ { /* generate error - bad escape sequence; something * like '\e48' or '\e0777777' */ }
es: E<lt>strE<gt>\e\e[0-9]+ { /* genera un error - secuencia de escape errónea; * algo como '\e48' o '\e0777777' */ }

source: Often, such as in some of the examples above, you wind up writing a whole bunch of rules all preceded by the same start condition(s). Flex makes this a little easier and cleaner by introducing a notion of start condition I<scope.> A start condition scope is begun with:
es: A menudo, como en alguno de los ejemplos anteriores, uno acaba escribiendo un buen número de reglas todas precedidas por la(s) misma(s) condición(es) de arranque. Flex hace esto un poco más fácil y claro introduciendo la noción de I<ámbito> de la condición de arranque. Un ámbito de condición de arranque comienza con:

source: where I<SCs> is a list of one or more start conditions. Inside the start condition scope, every rule automatically has the prefix I<E<lt>SCsE<gt>> applied to it, until a I<'}'> which matches the initial I<'{'.> So, for example,
es: Donde I<SCs> es una lista de una o más condiciones de arranque. Dentro del ámbito de la condición de arranque, cada regla automáticamente tiene el prefijo I<E<lt>SCsE<gt>> aplicado a esta, hasta un I<'}'> que corresponda con el I<'{'> inicial. Así, por ejemplo,

source: is equivalent to:
es: es equivalente a:

source: Start condition scopes may be nested.
es: Los ámbitos de las condiciones de arranque pueden anidarse.

source: Three routines are available for manipulating stacks of start conditions:
es: Están disponibles tres rutinas para manipular pilas de condiciones de arranque:

source: pushes the current start condition onto the top of the start condition stack and switches to I<new_state> as though you had used B<BEGIN new_state> (recall that start condition names are also integers).
es: empuja la condición de arranque actual al tope de la pila de las condiciones de arranque y cambia a I<new_state> como si hubiera utilizado B<BEGIN new_state> (recuerde que los nombres de las condiciones de arranque también son enteros).

source: pops the top of the stack and switches to it via B<BEGIN.>
es: extrae el tope de la pila y cambia a este mediante un B<BEGIN.>

source: returns the top of the stack without altering the stack's contents.
es: devuelve el tope de la pila sin alterar el contenido de la pila.

source: The start condition stack grows dynamically and so has no built-in size limitation. If memory is exhausted, program execution aborts.
es: La pila de las condiciones de arranque crece dinámicamente y por ello no tiene asociada ninguna limitación de tamaño. Si la memoria se agota, se aborta la ejecución del programa.

source: To use start condition stacks, your scanner must include a B<%option stack> directive (see Options below).
es: Para usar pilas de condiciones de arranque, su analizador debe incluir una directiva B<%option stack> (ver Opciones más abajo).

source: MULTIPLE INPUT BUFFERS
es: MÚLTIPLES BUFFERS DE ENTRADA

source: Some scanners (such as those which support "include" files) require reading from several input streams. As I<flex> scanners do a large amount of buffering, one cannot control where the next input will be read from by simply writing a B<YY_INPUT> which is sensitive to the scanning context. B<YY_INPUT> is only called when the scanner reaches the end of its buffer, which may be a long time after scanning a statement such as an "include" which requires switching the input source.
es: Algunos analizadores (tales como aquellos que aceptan ficheros "incluidos") requieren la lectura de varios flujos de entrada. Ya que los analizadores de I<flex> hacen mucho uso de buffers, uno no puede controlar de dónde será leída la siguiente entrada escribiendo símplemente un B<YY_INPUT> que sea sensible al contexto del análisis. A B<YY_INPUT> sólo se le llama cuando el analizador alcanza el final de su buffer, que podría ser bastante tiempo después de haber analizado una sentencia como un "include" que requiere el cambio de la fuente de entrada.

source: To negotiate these sorts of problems, I<flex> provides a mechanism for creating and switching between multiple input buffers. An input buffer is created by using:
es: Para solventar este tipo de problemas, I<flex> provee un mecanismo para crear y conmutar entre varios buffers de entrada. Un buffer de entrada se crea usando:

source: which takes a I<FILE> pointer and a size and creates a buffer associated with the given file and large enough to hold I<size> characters (when in doubt, use B<YY_BUF_SIZE> for the size). It returns a B<YY_BUFFER_STATE> handle, which may then be passed to other routines (see below). The B<YY_BUFFER_STATE> type is a pointer to an opaque B<struct yy_buffer_state> structure, so you may safely initialize YY_BUFFER_STATE variables to B<((YY_BUFFER_STATE) 0)> if you wish, and also refer to the opaque structure in order to correctly declare input buffers in source files other than that of your scanner. Note that the I<FILE> pointer in the call to B<yy_create_buffer> is only used as the value of I<yyin> seen by B<YY_INPUT;> if you redefine B<YY_INPUT> so it no longer uses I<yyin,> then you can safely pass a nil I<FILE> pointer to B<yy_create_buffer.> You select a particular buffer to scan from using:
es: que toma un puntero a I<FILE> y un tamaño "size" y crea un buffer asociado con el fichero dado y lo suficientemente grande para mantener I<size> caracteres (cuando dude, use B<YY_BUF_SIZE> para el tamaño). Este devuelve un handle B<YY_BUFFER_STATE,> que podría pasarse a otras rutinas (ver más abajo). El tipo de B<YY_BUFFER_STATE> es un puntero a una estructura opaca B<struct yy_buffer_state,> de manera que podría inicializar de forma segura variables YY_BUFFER_STATE a B<((YY_BUFFER_STATE) 0)> si lo desea, y también hacer referencia a la estructura opaca para declarar correctamente buffers de entrada en otros ficheros fuente además de los de su analizador. Fíjese que el puntero a I<FILE> en la llamada a B<yy_create_buffer> se usa solamente como el valor de I<yyin> visto por B<YY_INPUT;> si usted redefine B<YY_INPUT> de manera que no use más a I<yyin,> entonces puede pasar de forma segura un puntero I<FILE> nulo a B<yy_create_buffer.> Se selecciona un buffer en particular a analizar utilizando:

source: switches the scanner's input buffer so subsequent tokens will come from I<new_buffer.> Note that B<yy_switch_to_buffer()> may be used by yywrap() to set things up for continued scanning, instead of opening a new file and pointing I<yyin> at it. Note also that switching input sources via either B<yy_switch_to_buffer()> or B<yywrap()> does I<not> change the start condition.
es: conmuta el buffer de entrada del analizador de manera que los tokens posteriores provienen de I<nuevo_buffer.> Fíjese que B<yy_switch_to_buffer()> podría usarlo yywrap() para arreglar las cosas para un análisis continuo, en lugar de abrir un nuevo fichero y que I<yyin> apunte a este. Fíjese también que cambiar las fuentes de entrada ya sea por medio de B<yy_switch_to_buffer()> o de B<yywrap()> I<no> cambia la condición de arranque.

source: is used to reclaim the storage associated with a buffer. ( B<buffer> can be nil, in which case the routine does nothing.) You can also clear the current contents of a buffer using:
es: se usa para recuperar el almacenamiento asociado a un buffer. (El B<buffer> puede ser nulo, en cuyo caso la rutina no hace nada.) Puede también limpiar el contenido actual de un buffer usando:

source: This function discards the buffer's contents, so the next time the scanner attempts to match a token from the buffer, it will first fill the buffer anew using B<YY_INPUT.>
es: Esta función descarta el contenido del buffer, de manera que la próxima vez que el analizador intente emparejar un token desde el buffer, este primero rellenará el buffer utilizando B<YY_INPUT.>

source: B<yy_new_buffer()> is an alias for B<yy_create_buffer(),> provided for compatibility with the C++ use of I<new> and I<delete> for creating and destroying dynamic objects.
es: B<yy_new_buffer()> es un alias de B<yy_create_buffer(),> que se ofrece por compatibilidad con el uso en C++ de I<new> y I<delete> para crear y destruir objetos dinámicos.

source: Finally, the B<YY_CURRENT_BUFFER> macro returns a B<YY_BUFFER_STATE> handle to the current buffer.
es: Finalmente, la macro B<YY_CURRENT_BUFFER> retorna un handle B<YY_BUFFER_STATE> al buffer actual.

source: Here is an example of using these features for writing a scanner which expands include files (the B<E<lt>E<lt>EOFE<gt>E<gt>> feature is discussed below):
es: Aquí hay un ejemplo del uso de estas propiedades para escribir un analizador que expande ficheros incluidos (la propiedad B<E<lt>E<lt>EOFE<gt>E<gt>> se comenta más abajo):

source: /* the "incl" state is used for picking up the name * of an include file */ %x incl
es: /* el estado "incl" se utiliza para obtener el nombre * del fichero a incluir. */ %x incl

source: E<lt>inclE<gt>[ \et]* /* eat the whitespace */ E<lt>inclE<gt>[^ \et\en]+ { /* got the include file name */ if ( include_stack_ptr E<gt>= MAX_INCLUDE_DEPTH ) { fprintf( stderr, "Includes nested too deeply" ); exit( 1 ); }
es: E<lt>inclE<gt>[ \et]* /* se come los espacios en blanco */ E<lt>inclE<gt>[^ \et\en]+ { /* obtiene el nombre de fichero a incluir */ if ( include_stack_ptr E<gt>= MAX_INCLUDE_DEPTH ) { fprintf( stderr, "Demasiados include anidados" ); exit( 1 ); }

source: Three routines are available for setting up input buffers for scanning in-memory strings instead of files. All of them create a new input buffer for scanning the string, and return a corresponding B<YY_BUFFER_STATE> handle (which you should delete with B<yy_delete_buffer()> when done with it). They also switch to the new buffer using B<yy_switch_to_buffer(),> so the next call to B<yylex()> will start scanning the string.
es: Se dispone de tres rutinas para preparar buffers de entrada para el análisis de cadenas en memoria en lugar de archivos. Todas estas crean un nuevo buffer de entrada para analizar la cadena, y devuelven el correspondiente handle B<YY_BUFFER_STATE> (que usted debería borrar con B<yy_delete_buffer()> cuando termine con él). Estas también conmutan el nuevo buffer usando B<yy_switch_to_buffer(),> de manera que la próxima llamada a B<yylex()> comenzará analizando la cadena.

source: scans a NUL-terminated string.
es: analiza una cadena terminada en nulo.

source: scans I<len> bytes (including possibly NUL's) starting at location I<bytes.>
es: analiza I<len> bytes (incluyendo posibles NUL's) comenzando desde el punto I<bytes.>

source: Note that both of these functions create and scan a I<copy> of the string or bytes. (This may be desirable, since B<yylex()> modifies the contents of the buffer it is scanning.) You can avoid the copy by using:
es: Fíjese que ambas de estas funciones crean y analizan una I<copia> de la cadena o bytes. (Esto podría ser deseable, ya que B<yylex()> modifica el contenido del buffer que está analizado.) Usted puede evitar la copia utilizando:

source: which scans in place the buffer starting at I<base,> consisting of I<size> bytes, the last two bytes of which I<must> be B<YY_END_OF_BUFFER_CHAR> (ASCII NUL). These last two bytes are not scanned; thus, scanning consists of B<base[0]> through B<base[size-2],> inclusive.
es: que analiza in situ el buffer comenzando en I<base,> que consiste de I<size> bytes, donde los dos últimos bytes I<deben> ser B<YY_END_OF_BUFFER_CHAR> (ASCII NUL). Estos dos últimos bytes no se analizan; así, el análisis consta de B<base[0]> hasta B<base[size-2],> inclusive.

source: If you fail to set up I<base> in this manner (i.e., forget the final two B<YY_END_OF_BUFFER_CHAR> bytes), then B<yy_scan_buffer()> returns a nil pointer instead of creating a new input buffer.
es: Si se equivoca al disponer I<base> de esta manera (es decir, olvidar los dos B<YY_END_OF_BUFFER_CHAR> bytes finales), entonces B<yy_scan_buffer()> devuelve un puntero nulo en lugar de crear un nuevo buffer de entrada.

source: The type B<yy_size_t> is an integral type to which you can cast an integer expression reflecting the size of the buffer.
es: El tipo B<yy_size_t> es un tipo entero con el que puede hacer una conversión a una expresión entera para reflejar el tamaño del buffer.

source: END-OF-FILE RULES
es: REGLAS DE FIN-DE-FICHERO

source: The special rule "E<lt>E<lt>EOFE<gt>E<gt>" indicates actions which are to be taken when an end-of-file is encountered and yywrap() returns non-zero (i.e., indicates no further files to process). The action must finish by doing one of four things:
es: La regla especial "E<lt>E<lt>EOFE<gt>E<gt>" indica las acciones que deben tomarse cuando se encuentre un fin-de-fichero e yywrap() retorne un valor distinto de cero (es decir, indica que no quedan ficheros por procesar). La acción debe finalizar haciendo una de estas cuatro cosas:

source: assigning I<yyin> to a new input file (in previous versions of flex, after doing the assignment you had to call the special action B<YY_NEW_FILE;> this is no longer necessary);
es: asignando a I<yyin> un nuevo fichero de entrada (en versiones anteriores de flex, después de hacer la asignación debía llamar a la acción especial B<YY_NEW_FILE;> esto ya no es necesario);

source: executing a I<return> statement;
es: ejecutando una sentencia I<return;>

source: executing the special B<yyterminate()> action;
es: ejecutando la acción especial B<yyterminate();>

source: or, switching to a new buffer using B<yy_switch_to_buffer()> as shown in the example above.
es: o, conmutando a un nuevo buffer usando B<yy_switch_to_buffer()> como se mostró en el ejemplo anterior.

source: E<lt>E<lt>EOFE<gt>E<gt> rules may not be used with other patterns; they may only be qualified with a list of start conditions. If an unqualified E<lt>E<lt>EOFE<gt>E<gt> rule is given, it applies to I<all> start conditions which do not already have E<lt>E<lt>EOFE<gt>E<gt> actions. To specify an E<lt>E<lt>EOFE<gt>E<gt> rule for only the initial start condition, use
es: Las reglas E<lt>E<lt>EOFE<gt>E<gt> no deberían usarse con otros patrones; estas deberían calificarse con una lista de condiciones de arranque. Si se da una regla E<lt>E<lt>EOFE<gt>E<gt> sin calificar, esta se aplica a I<todas> las condiciones de arranque que no tengan ya acciones E<lt>E<lt>EOFE<gt>E<gt>. Para especificar una regla E<lt>E<lt>EOFE<gt>E<gt> solamente para la condición de arranque inicial, use

source: These rules are useful for catching things like unclosed comments. An example:
es: Estas reglas son útiles para atrapar cosas tales como comentarios sin final. Un ejemplo:

source: %x quote %%
es: %x comilla %%

source: ...other rules for dealing with quotes...
es: ...otras reglas que tengan que ver con comillas...

source: E<lt>quoteE<gt>E<lt>E<lt>EOFE<gt>E<gt> { error( "unterminated quote" ); yyterminate(); } E<lt>E<lt>EOFE<gt>E<gt> { if ( *++filelist ) yyin = fopen( *filelist, "r" ); else yyterminate(); }
es: E<lt>comillaE<gt>E<lt>E<lt>EOFE<gt>E<gt> { error( "comilla sin cerrar" ); yyterminate(); } E<lt>E<lt>EOFE<gt>E<gt> { if ( *++filelist ) yyin = fopen( *filelist, "r" ); else yyterminate(); }

source: MISCELLANEOUS MACROS
es: MACROS MISCELÁNEAS

source: The macro B<YY_USER_ACTION> can be defined to provide an action which is always executed prior to the matched rule's action. For example, it could be #define'd to call a routine to convert yytext to lower-case. When B<YY_USER_ACTION> is invoked, the variable I<yy_act> gives the number of the matched rule (rules are numbered starting with 1). Suppose you want to profile how often each of your rules is matched. The following would do the trick:
es: La macro B<YY_USER_ACTION> puede definirse para indicar una acción que siempre se ejecuta antes de la acción de la regla emparejada. Por ejemplo, podría declararse con #define para que llame a una rutina que convierta yytext a minúsculas. Cuando se invoca a B<YY_USER_ACTION,> la variable I<yy_act> da el número de la regla emparejada (las reglas están numeradas comenzando en 1). Suponga que quiere medir la frecuencia con la que sus reglas son emparejadas. Lo que viene a continuación podría hacer este truco:

source: where I<ctr> is an array to hold the counts for the different rules. Note that the macro B<YY_NUM_RULES> gives the total number of rules (including the default rule, even if you use B<-s),> so a correct declaration for I<ctr> is:
es: donde I<ctr> en un vector que mantiene la cuenta para las diferentes reglas. Fíjese que la macro B<YY_NUM_RULES> da el número total de reglas (incluyendo la regla por defecto, incluso si usted usa B<-s),> así que una declaración correcta para I<ctr> es:

source: The macro B<YY_USER_INIT> may be defined to provide an action which is always executed before the first scan (and before the scanner's internal initializations are done). For example, it could be used to call a routine to read in a data table or open a logging file.
es: La macro B<YY_USER_INIT> podría definirse para indicar una acción que siempre se ejecuta antes del primer análisis (y antes de que se haga la inicialización interna del analizador). Por ejemplo, este podría usarse para llamar a una rutina que lea una tabla de datos o abrir un fichero de registro.

source: The macro B<yy_set_interactive(is_interactive)> can be used to control whether the current buffer is considered I<interactive.> An interactive buffer is processed more slowly, but must be used when the scanner's input source is indeed interactive to avoid problems due to waiting to fill buffers (see the discussion of the B<-I> flag below). A non-zero value in the macro invocation marks the buffer as interactive, a zero value as non-interactive. Note that use of this macro overrides B<%option always-interactive> or B<%option never-interactive> (see Options below). B<yy_set_interactive()> must be invoked prior to beginning to scan the buffer that is (or is not) to be considered interactive.
es: La macro B<yy_set_interactive(is_interactive)> se puede usar para controlar si el buffer actual se considera I<interactivo.> Un buffer interactivo se procesa más lentamente, pero debe usarse cuando la fuente de entrada del analizador es realmente interactiva para evitar problemas debidos a la espera para el llenado de los buffers (ver el comentario de la bandera B<-I> más abajo). Un valor distinto de cero en la invocación de la macro marcará el buffer como interactivo, un valor de cero como no-interactivo. Fíjese que el uso de esta macro no tiene en cuenta B<%option always-interactive> o B<%option never-interactive> (ver Opciones más abajo). B<yy_set_interactive()> debe invocarse antes del comienzo del análisis del buffer que es considerado (o no) interactivo.

source: The macro B<yy_set_bol(at_bol)> can be used to control whether the current buffer's scanning context for the next token match is done as though at the beginning of a line. A non-zero macro argument makes rules anchored with
es: La macro B<yy_set_bol(at_bol)> puede usarse para controlar si el contexto del buffer de análisis actual para el próximo emparejamiento de token se hace como si se encontrara al principio de una línea. Un argumento de la macro distinto de cero hace activas a las reglas sujetas a '^', mientras que un argumento igual a cero hacer inactivas a las reglas con '^'.

source: The macro B<YY_AT_BOL()> returns true if the next token scanned from the current buffer will have '^' rules active, false otherwise.
es: La macro B<YY_AT_BOL()> devuelve verdadero si el próximo token analizado a partir del buffer actual tendrá activas las reglas '^', de otra manera falso.
