Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: April 1995
es: Abril 1995

source: Version 2.5
es: Versión 2.5

source: NAME
es: NOMBRE

source: flex - fast lexical analyzer generator
es: flex - generador de analizadores léxicos rápidos

source: SYNOPSIS
es: SINOPSIS

source: B<flex> B<[-bcdfhilnpstvwBFILTV78+? -C[aefFmr] -ooutput -Pprefix -Sskeleton]> B<[--help --version]> I<[filename ...]>
es: B<flex> B<[-bcdfhilnpstvwBFILTV78+? -C[aefFmr] -osalida -Pprefijo -Sesqueleto]> B<[--help --version]> I<[nombrefichero ...]>

source: OVERVIEW
es: INTRODUCCIÓN

source: This manual describes I<flex,> a tool for generating programs that perform pattern-matching on text. The manual includes both tutorial and reference sections:
es: Este manual describe I<flex,> una herramienta para la generación de programas que realizan concordancia de patrones en texto. El manual incluye a la vez secciones de tutorial y de referencia:

source: Description a brief overview of the tool
es: Descripción una breve introducción a la herramienta

source: Some Simple Examples
es: Algunos Ejemplos Simples

source: Format Of The Input File
es: Formato del Fichero de Entrada

source: Patterns the extended regular expressions used by flex
es: Patrones las expresiones regulares extendidas que utiliza flex

source: How The Input Is Matched the rules for determining what has been matched
es: Cómo se Empareja la Entrada las reglas para determinar lo que ha concordado

source: Actions how to specify what to do when a pattern is matched
es: Acciones cómo especificar qué hacer cuando concuerde un patrón

source: The Generated Scanner details regarding the scanner that flex produces; how to control the input source
es: El Escáner Generado detalles respecto al escáner que produce flex; cómo controlar la fuente de entrada

source: Start Conditions introducing context into your scanners, and managing "mini-scanners"
es: Condiciones de Arranque la introdución de contexto en sus escáneres, y conseguir "mini-escáneres"

source: Multiple Input Buffers how to manipulate multiple input sources; how to scan from strings instead of files
es: Múltiples Buffers de Entrada cómo manipular varias fuentes de entrada; cómo analizar cadenas en lugar de ficheros.

source: End-of-file Rules special rules for matching the end of the input
es: Reglas de Fin-de-Fichero reglas especiales para reconocer el final de la entrada

source: Miscellaneous Macros a summary of macros available to the actions
es: Macros Misceláneas un sumario de macros disponibles para las acciones

source: Values Available To The User a summary of values available to the actions
es: Valores Disponibles para el Usuario un sumario de valores disponibles para las acciones

source: Interfacing With Yacc connecting flex scanners together with yacc parsers
es: Interfaz con Yacc conectando escáneres de flex junto con analizadores de yacc

source: Options flex command-line options, and the "%option" directive
es: Opciones opciones de línea de comando de flex, y la directiva "%option"

source: Performance Considerations how to make your scanner go as fast as possible
es: Consideraciones de Rendimiento cómo hacer que sus analizadores vayan tan rápido como sea posible

source: Generating C++ Scanners the (experimental) facility for generating C++ scanner classes
es: Generando Escáneres en C++ la facilidad (experimental) para generar analizadores léxicos como clases de C++

source: Incompatibilities With Lex And POSIX how flex differs from AT&T lex and the POSIX lex standard
es: Incompatibilidades con Lex y POSIX cómo flex difiere del lex de AT&T y del lex estándar de POSIX

source: Diagnostics those error messages produced by flex (or scanners it generates) whose meanings might not be apparent
es: Diagnósticos esos mensajes de error producidos por flex (o por los escáneres que este genera) cuyo significado podría no ser evidente

source: Files files used by flex
es: Ficheros los ficheros usados por flex

source: Deficiencies / Bugs known problems with flex
es: Deficiencias / Errores problemas de flex conocidos

source: See Also other documentation, related tools
es: Ver También otra documentación, herramientas relacionadas

source: Author includes contact information
es: Autor incluye información de contacto

source: DESCRIPTION
es: DESCRIPCIÓN

source: I<flex> is a tool for generating I<scanners:> programs which recognized lexical patterns in text. I<flex> reads the given input files, or its standard input if no file names are given, for a description of a scanner to generate. The description is in the form of pairs of regular expressions and C code, called I<rules. flex> generates as output a C source file, B<lex.yy.c,> which defines a routine B<yylex().> This file is compiled and linked with the B<-lfl> library to produce an executable. When the executable is run, it analyzes its input for occurrences of the regular expressions. Whenever it finds one, it executes the corresponding C code.
es: I<flex> es una herramienta para generar I<escáneres:> programas que reconocen patrones léxicos en un texto. I<flex> lee los ficheros de entrada dados, o la entrada estándar si no se le ha indicado ningún nombre de fichero, con la descripción de un escáner a generar. La descripción se encuentra en forma de parejas de expresiones regulares y código C, denominadas I<reglas. flex> genera como salida un fichero fuente en C, B<lex.yy.c,> que define una rutina B<yylex().> Este fichero se compila y se enlaza con la librería B<-lfl> para producir un ejecutable. Cuando se arranca el fichero ejecutable, este analiza su entrada en busca de casos de las expresiones regulares. Siempre que encuentra uno, ejecuta el código C correspondiente.

source: SOME SIMPLE EXAMPLES
es: ALGUNOS EJEMPLOS SIMPLES

source: First some simple examples to get the flavor of how one uses I<flex.> The following I<flex> input specifies a scanner which whenever it encounters the string "username" will replace it with the user's login name:
es: En primer lugar veremos algunos ejemplos simples para una toma de contacto con el uso de I<flex.> La siguiente entrada de I<flex> especifica un escáner que siempre que encuentre la cadena "username" la reemplazará por el nombre de entrada al sistema del usuario:

source: By default, any text not matched by a I<flex> scanner is copied to the output, so the net effect of this scanner is to copy its input file to its output with each occurrence of "username" expanded. In this input, there is just one rule. "username" is the I<pattern> and the "printf" is the I<action.> The "%%" marks the beginning of the rules.
es: Por defecto, cualquier texto que no reconozca el analizador léxico de I<flex> se copia a la salida, así que el efecto neto de este escáner es copiar su fichero de entrada a la salida con cada aparición de "username" expandida. En esta entrada, hay solamente una regla. "username" es el I<patrón> y el "printf" es la I<acción.> El "%%" marca el comienzo de las reglas.

source: Here's another simple example:
es: Aquí hay otro ejemplo simple:

source: This scanner counts the number of characters and the number of lines in its input (it produces no output other than the final report on the counts). The first line declares two globals, "num_lines" and "num_chars", which are accessible both inside B<yylex()> and in the B<main()> routine declared after the second "%%". There are two rules, one which matches a newline ("\en") and increments both the line count and the character count, and one which matches any character other than a newline (indicated by the "." regular expression).
es: Este analizador cuenta el número de caracteres y el número de líneas en su entrada (no produce otra salida que el informe final de la cuenta). La primera línea declara dos variables globales, "num_lineas" y "num_caracteres", que son visibles al mismo tiempo dentro de B<yylex()> y en la rutina B<main()> declarada después del segundo "%%". Hay dos reglas, una que empareja una línea nueva ("\en") e incrementa la cuenta de líneas y la cuenta de caracteres, y la que empareja cualquier caracter que no sea una línea nueva (indicado por la expresión regular ".").

source: A somewhat more complicated example:
es: Un ejemplo algo más complicado:

source: /* scanner for a toy Pascal-like language */
es: /* escáner para un lenguaje de juguete al estilo de Pascal */

source: %{ /* need this for the call to atof() below */ #include E<lt>math.hE<gt> %}
es: %{ /* se necesita esto para la llamada a atof() más abajo */ #include E<lt>math.hE<gt> %}

source: DIGIT [0-9] ID [a-z][a-z0-9]*
es: DIGITO [0-9] ID [a-z][a-z0-9]*

source: {DIGIT}+ { printf( "An integer: %s (%d)\en", yytext, atoi( yytext ) ); }
es: {DIGITO}+ { printf( "Un entero: %s (%d)\en", yytext, atoi( yytext ) ); }

source: {DIGIT}+"."{DIGIT}* { printf( "A float: %s (%g)\en", yytext, atof( yytext ) ); }
es: {DIGITO}+"."{DIGITO}* { printf( "Un real: %s (%g)\en", yytext, atof( yytext ) ); }

source: if|then|begin|end|procedure|function { printf( "A keyword: %s\en", yytext ); }
es: if|then|begin|end|procedure|function { printf( "Una palabra clave: %s\en", yytext ); }

source: {ID} printf( "An identifier: %s\en", yytext );
es: {ID} printf( "Un identificador: %s\en", yytext );

source: "+"|"-"|"*"|"/" printf( "An operator: %s\en", yytext );
es: "+"|"-"|"*"|"/" printf( "Un operador: %s\en", yytext );

source: "{"[^}\en]*"}" /* eat up one-line comments */
es: "{"[^}\en]*"}" /* se come una linea de comentarios */

source: [ \et\en]+ /* eat up whitespace */
es: [ \et\en]+ /* se come los espacios en blanco */

source: . printf( "Unrecognized character: %s\en", yytext );
es: . printf( "Caracter no reconocido: %s\en", yytext );

source: main( argc, argv ) int argc; char **argv; { ++argv, --argc; /* skip over program name */ if ( argc E<gt> 0 ) yyin = fopen( argv[0], "r" ); else yyin = stdin;
es: main( argc, argv ) int argc; char **argv; { ++argv, --argc; /* se salta el nombre del programa */ if ( argc E<gt> 0 ) yyin = fopen( argv[0], "r" ); else yyin = stdin;

source: This is the beginnings of a simple scanner for a language like Pascal. It identifies different types of I<tokens> and reports on what it has seen.
es: Esto podría ser los comienzos de un escáner simple para un lenguaje como Pascal. Este identifica diferentes tipos de I<tokens> e informa a cerca de lo que ha visto.

source: The details of this example will be explained in the following sections.
es: Los detalles de este ejemplo se explicarán en las secciones siguientes.

source: FORMAT OF THE INPUT FILE
es: FORMATO DEL FICHERO DE ENTRADA

source: The I<flex> input file consists of three sections, separated by a line with just B<%%> in it:
es: El fichero de entrada de I<flex> está compuesto de tres secciones, separadas por una línea donde aparece únicamente un B<%%> en esta:

source: definitions %% rules %% user code
es: definiciones %% reglas %% código de usuario

source: The I<definitions> section contains declarations of simple I<name> definitions to simplify the scanner specification, and declarations of I<start conditions,> which are explained in a later section.
es: La sección de I<definiciones> contiene declaraciones de definiciones de I<nombres> sencillas para simplificar la especificación del escáner, y declaraciones de I<condiciones de arranque,> que se explicarán en una sección posterior.

source: Name definitions have the form:
es: Las definiciones de nombre tienen la forma:

source: name definition
es: nombre definición

source: The "name" is a word beginning with a letter or an underscore ('_') followed by zero or more letters, digits, '_', or '-' (dash). The definition is taken to begin at the first non-white-space character following the name and continuing to the end of the line. The definition can subsequently be referred to using "{name}", which will expand to "(definition)". For example,
es: El "nombre" es una palabra que comienza con una letra o un subrayado ('_') seguido por cero o más letras, dígitos, '_', o '-' (guión). La definición se considera que comienza en el primer caracter que no sea un espacio en blanco siguiendo al nombre y continuando hasta el final de la línea. Posteriormente se puede hacer referencia a la definición utilizando "{nombre}", que se expandirá a "(definición)". Por ejemplo,

source: defines "DIGIT" to be a regular expression which matches a single digit, and "ID" to be a regular expression which matches a letter followed by zero-or-more letters-or-digits. A subsequent reference to
es: define "DIGITO" como una expresión regular que empareja un dígito sencillo, e "ID" como una expresión regular que empareja una letra seguida por cero o más letras o dígitos. Una referencia posterior a

source: {DIGIT}+"."{DIGIT}*
es: {DIGITO}+"."{DIGITO}*

source: is identical to
es: es idéntica a

source: and matches one-or-more digits followed by a '.' followed by zero-or-more digits.
es: y empareja uno o más dígitos seguido por un '.' seguido por cero o más dígitos.

source: The I<rules> section of the I<flex> input contains a series of rules of the form:
es: La sección de I<reglas> en la entrada de I<flex> contiene una serie de reglas de la forma:

source: pattern action
es: patrón acción

source: where the pattern must be unindented and the action must begin on the same line.
es: donde el patrón debe estar sin sangrar y la acción debe comenzar en la misma línea.

source: See below for a further description of patterns and actions.
es: Ver más abajo para una descripción más amplia sobre patrones y acciones.

source: Finally, the user code section is simply copied to B<lex.yy.c> verbatim. It is used for companion routines which call or are called by the scanner. The presence of this section is optional; if it is missing, the second B<%%> in the input file may be skipped, too.
es: Finalmente, la sección de código de usuario simplemente se copia a B<lex.yy.c> literalmente. Esta sección se utiliza para rutinas de complemento que llaman al escáner o son llamadas por este. La presencia de esta sección es opcional; Si se omite, el segundo B<%%> en el fichero de entrada se podría omitir también.

source: In the definitions and rules sections, any I<indented> text or text enclosed in B<%{> and B<%}> is copied verbatim to the output (with the %{}'s removed). The %{}'s must appear unindented on lines by themselves.
es: En las secciones de definiciones y reglas, cualquier texto I<sangrado> o encerrado entre B<%{> y B<%}> se copia íntegramente a la salida (sin los %{}'s). Los %{}'s deben aparecer sin sangrar en líneas ocupadas únicamente por estos.

source: In the rules section, any indented or %{} text appearing before the first rule may be used to declare variables which are local to the scanning routine and (after the declarations) code which is to be executed whenever the scanning routine is entered. Other indented or %{} text in the rule section is still copied to the output, but its meaning is not well-defined and it may well cause compile-time errors (this feature is present for I<POSIX> compliance; see below for other such features).
es: En la sección de reglas, cualquier texto o %{} sangrado que aparezca antes de la primera regla podría utilizarse para declarar variables que son locales a la rutina de análisis y (después de las declaraciones) al código que debe ejecutarse siempre que se entra a la rutina de análisis. Cualquier otro texto sangrado o %{} en la sección de reglas sigue copiándose a la salida, pero su significado no está bien definido y bien podría causar errores en tiempo de compilación (esta propiedad se presenta para conformidad con I<POSIX> ; ver más abajo para otras características similares).

source: In the definitions section (but not in the rules section), an unindented comment (i.e., a line beginning with "/*") is also copied verbatim to the output up to the next "*/".
es: En la sección de definiciones (pero no en la sección de reglas), un comentario sin sangría (es decir, una línea comenzando con "/*") también se copia literalmente a la salida hasta el próximo "*/".

source: PATTERNS
es: PATRONES

source: The patterns in the input are written using an extended set of regular expressions. These are:
es: Los patrones en la entrada se escriben utilizando un conjunto extendido de expresiones regulares. Estas son:

source: x match the character 'x' . any character (byte) except newline [xyz] a "character class"; in this case, the pattern matches either an 'x', a 'y', or a 'z' [abj-oZ] a "character class" with a range in it; matches an 'a', a 'b', any letter from 'j' through 'o', or a 'Z' [^A-Z] a "negated character class", i.e., any character but those in the class. In this case, any character EXCEPT an uppercase letter. [^A-Z\en] any character EXCEPT an uppercase letter or a newline r* zero or more r's, where r is any regular expression r+ one or more r's r? zero or one r's (that is, "an optional r") r{2,5} anywhere from two to five r's r{2,} two or more r's r{4} exactly 4 r's {name} the expansion of the "name" definition (see above) "[xyz]\e"foo" the literal string: [xyz]"foo \eX if X is an 'a', 'b', 'f', 'n', 'r', 't', or 'v', then the ANSI-C interpretation of \ex. Otherwise, a literal 'X' (used to escape operators such as '*') \e0 a NUL character (ASCII code 0) \e123 the character with octal value 123 \ex2a the character with hexadecimal value 2a (r) match an r; parentheses are used to override precedence (see below)
es: x empareja el caracter 'x' . cualquier caracter (byte) excepto una línea nueva [xyz] una "clase de caracteres"; en este caso, el patrón empareja una 'x', una 'y', o una 'z' [abj-oZ] una "clase de caracteres" con un rango; empareja una 'a', una 'b', cualquier letra desde la 'j' hasta la 'o', o una 'Z' [^A-Z] una "clase de caracteres negada", es decir, cualquier caracter menos los que aparecen en la clase. En este caso, cualquier caracter EXCEPTO una letra mayúscula. [^A-Z\en] cualquier caracter EXCEPTO una letra mayúscula o una línea nueva r* cero o más r's, donde r es cualquier expresión regular r+ una o más r's r? cero o una r (es decir, "una r opcional") r{2,5} donde sea de dos a cinco r's r{2,} dos o más r's r{4} exactamente 4 r's {nombre} la expansión de la definición de "nombre" (ver más abajo) "[xyz]\e"foo" la cadena literal: [xyz]"foo \eX si X es una 'a', 'b', 'f', 'n', 'r', 't', o 'v', entonces la interpretación ANSI-C de \ex. En otro caso, un literal 'X' (usado para indicar operadores tales como '*') \e0 un caracter NUL (código ASCII 0) \e123 el caracter con valor octal 123 \ex2a el caracter con valor hexadecimal 2a (r) empareja una r; los paréntesis se utilizan para anular la precedencia (ver más abajo)

source: rs the regular expression r followed by the regular expression s; called "concatenation"
es: rs la expresión regular r seguida por la expresión regular s; se denomina "concatenación"

source: r|s either an r or an s
es: r|s bien una r o una s

source: r/s an r but only if it is followed by an s. The text matched by s is included when determining whether this rule is the "longest match", but is then returned to the input before the action is executed. So the action only sees the text matched by r. This type of pattern is called trailing context". (There are some combinations of r/s that flex cannot match correctly; see notes in the Deficiencies / Bugs section below regarding "dangerous trailing context".) ^r an r, but only at the beginning of a line (i.e., which just starting to scan, or right after a newline has been scanned). r$ an r, but only at the end of a line (i.e., just before a newline). Equivalent to "r/\en".
es: r/s una r pero sólo si va seguida por una s. El texto emparejado por s se incluye cuando se determina si esta regla es el "emparejamiento más largo", pero se devuelve entonces a la entrada antes que se ejecute la acción. Así que la acción sólo ve el texto emparejado por r. Este tipo de patrones se llama "de contexto posterior". (Hay algunas combinaciones de r/s que flex no puede emparejar correctamente; vea las notas en la sección Deficiencias / Errores más abajo respecto al "contexto posterior peligroso".) ^r una r, pero sólo al comienzo de una línea (es decir, justo al comienzo del análisis, o a la derecha después de que se haya analizado una línea nueva). r$ una r, pero sólo al final de una línea (es decir, justo antes de una línea nueva). Equivalente a "r/\en".

source: Note that flex's notion of "newline" is exactly whatever the C compiler used to compile flex interprets '\en' as; in particular, on some DOS systems you must either filter out \er's in the input yourself, or explicitly use r/\er\en for "r$".
es: Fíjese que la noción de flex de una "línea nueva" es exáctamente lo que el compilador de C utilizado para compilar flex interprete como '\en'; en particular, en algunos sistemas DOS debe filtrar los \er's de la entrada used mismo, o explícitamente usar r/\er\en para "r$".

source: E<lt>sE<gt>r an r, but only in start condition s (see below for discussion of start conditions) E<lt>s1,s2,s3E<gt>r same, but in any of start conditions s1, s2, or s3 E<lt>*E<gt>r an r in any start condition, even an exclusive one.
es: E<lt>sE<gt>r una r, pero sólo en la condición de arranque s (ver más abajo para una discusión sobre las condiciones de arranque) E<lt>s1,s2,s3E<gt>r lo mismo, pero en cualquiera de las condiciones de arranque s1, s2, o s3 E<lt>*E<gt>r una r en cualquier condición de arranque, incluso una exclusiva.

source: E<lt>E<lt>EOFE<gt>E<gt> an end-of-file E<lt>s1,s2E<gt>E<lt>E<lt>EOFE<gt>E<gt> an end-of-file when in start condition s1 or s2
es: E<lt>E<lt>EOFE<gt>E<gt> un fin-de-fichero E<lt>s1,s2E<gt>E<lt>E<lt>EOFE<gt>E<gt> un fin-de-fichero en una condición de arranque s1 o s2

source: Note that inside of a character class, all regular expression operators lose their special meaning except escape ('\e') and the character class operators, '-', ']', and, at the beginning of the class, '^'.
es: Fíjese que dentro de una clase de caracteres, todos los operadores de expresiones regulares pierden su significado especial excepto el caracter de escape ('\e') y los operadores de clase de caracteres, '-',

source: The regular expressions listed above are grouped according to precedence, from highest precedence at the top to lowest at the bottom. Those grouped together have equal precedence. For example,
es: Las expresiones regulares en el listado anterior están agrupadas de acuerdo a la precedencia, desde la precedencia más alta en la cabeza a la más baja al final. Aquellas agrupadas conjuntamente tienen la misma precedencia. Por ejemplo,

source: is the same as
es: es lo mismo que

source: since the '*' operator has higher precedence than concatenation, and concatenation higher than alternation ('|'). This pattern therefore matches I<either> the string "foo" I<or> the string "ba" followed by zero-or-more r's. To match "foo" or zero-or-more "bar"'s, use:
es: ya que el operador '*' tiene mayor precedencia que la concatenación, y la concatenación más alta que el operador '|'. Este patrón por lo tanto empareja I<bien> la cadena "foo" I<o> la cadena "ba" seguida de cero o más r's. Para emparejar "foo" o, cero o más "bar"'s, use:

source: and to match zero-or-more "foo"'s-or-"bar"'s:
es: y para emparejar cero o más "foo"'s o "bar"'s:
