Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: Note, however, that unless you generate your scanner using the B<-Cf> or B<-CF> table compression options, use of B<-7> will save only a small amount of table space, and make your scanner considerably less portable. I<Flex's> default behavior is to generate an 8-bit scanner unless you use the B<-Cf> or B<-CF,> in which case I<flex> defaults to generating 7-bit scanners unless your site was always configured to generate 8-bit scanners (as will often be the case with non-USA sites). You can tell whether flex generated a 7-bit or an 8-bit scanner by inspecting the flag summary in the B<-v> output as described above.
es: Fíjese, sin embargo, que a menos que genere su analizador utilizando las opciones de compresión de tablas B<-Cf> o B<-CF,> el uso de B<-7> ahorrará solamente una pequeña cantidad de espacio en la tabla, y hará su analizador considerablemente menos portable. El comportamiento por defecto de I<flex> es generar un analizador de 8-bits a menos que use B<-Cf> o B<-CF,> en cuyo caso I<flex> por defecto genera analizadores de 7-bits a menos que su sistema siempre esté configurado para generar analizadores de 8-bits (a menudo este será el caso de los sistemas fuera de EEUU). Puede decir si flex generó un analizador de 7 u 8 bits inspeccionando el sumario de banderas en la salida de B<-v> como se describió anteriormente.

source: Note that if you use B<-Cfe> or B<-CFe> (those table compression options, but also using equivalence classes as discussed see below), flex still defaults to generating an 8-bit scanner, since usually with these compression options full 8-bit tables are not much more expensive than 7-bit tables.
es: Fíjese que si usa B<-Cfe> o B<-CFe> (esas opciones de compresión de tablas, pero también el uso de clases de equivalencia como se comentará más abajo), flex genera aún por defecto un analizador de 8-bits, ya que normalmente con estas opciones de compresión las tablas de 8-bits completas no son mucho más caras que las tablas de 7-bits.

source: instructs I<flex> to generate an 8-bit scanner, i.e., one which can recognize 8-bit characters. This flag is only needed for scanners generated using B<-Cf> or B<-CF,> as otherwise flex defaults to generating an 8-bit scanner anyway.
es: ordena a I<flex> que genere un analizador de 8-bits, es decir, uno que puede reconocer caracteres de 8-bits. Esta bandera sólo es necesaria para analizadores generados usando B<-Cf> o B<-CF,> ya que de otra manera flex por defecto genera un analizador de 8-bits de todas formas.

source: See the discussion of B<-7> above for flex's default behavior and the tradeoffs between 7-bit and 8-bit scanners.
es: Vea el comentario sobre B<-7> más arriba a cerca del comportamiento por defecto de flex y la discusión entre los analizadores de 7-bits y 8-bits.

source: specifies that you want flex to generate a C++ scanner class. See the section on Generating C++ Scanners below for details.
es: especifica que quiere que flex genere un analizador como una clase de C++. Vea la sección Generando Escáners en C++ más abajo para los detalles.

source: controls the degree of table compression and, more generally, trade-offs between small scanners and fast scanners.
es: controla el grado de compresión de la tabla y, más generalmente, el compromiso entre analizadores pequeños y analizadores rápidos.

source: B<-Ca> ("align") instructs flex to trade off larger tables in the generated scanner for faster performance because the elements of the tables are better aligned for memory access and computation. On some RISC architectures, fetching and manipulating longwords is more efficient than with smaller-sized units such as shortwords. This option can double the size of the tables used by your scanner.
es: B<-Ca> ("alinea") ordena a flex que negocie tablas más grandes en el analizador generado para un comportamiento más rápido porque los elementos de las tablas están mejor alineados para el acceso a memoria y computación. En algunas arquitecturas RISC, la búsqueda y manipulación de palabras largas es más eficiente que con unidades más pequeñas tales como palabras cortas. Esta opción puede doblar el tamaño de las tablas usadas en su analizador.

source: B<-Ce> directs I<flex> to construct I<equivalence classes,> i.e., sets of characters which have identical lexical properties (for example, if the only appearance of digits in the I<flex> input is in the character class "[0-9]" then the digits '0', '1', ..., '9' will all be put in the same equivalence class). Equivalence classes usually give dramatic reductions in the final table/object file sizes (typically a factor of 2-5) and are pretty cheap performance-wise (one array look-up per character scanned).
es: B<-Ce> ordena a I<flex> que construya I<clases de equivalencia,> es decir, conjunto de caracteres que tienen identicas propiedades léxicas (por ejemplo, si la única aparición de dígitos en la entrada de I<flex> es en la clase de caracteres "[0-9]" entonces los dígitos '0', '1', ..., '9' se pondrán todos en la misma clase de equivalencia). Las clases de equivalencia normalmente ofrecen notables reducciones en los tamaños de los ficheros finales de tabla/objeto (típicamente un factor de 2-5) y son juiciosamente bastante baratos en cuanto al rendimiento (una localización en un vector por caracter analizado).

source: B<-Cf> specifies that the I<full> scanner tables should be generated - I<flex> should not compress the tables by taking advantages of similar transition functions for different states.
es: B<-Cf> especifica que se deben generar las tablas del analizador I<completas> - I<flex> no debería comprimir las tablas tomando ventaja de las funciones de transición similares para diferentes estados.

source: B<-CF> specifies that the alternate fast scanner representation (described above under the B<-F> flag) should be used. This option cannot be used with B<-+.>
es: B<-CF> especifica que debería usarse la representación del analizador rápido alternativo (descrito anteriormente en la bandera B<-F> ) Esta opción no puede usarse con B<-+.>

source: B<-Cm> directs I<flex> to construct I<meta-equivalence classes,> which are sets of equivalence classes (or characters, if equivalence classes are not being used) that are commonly used together. Meta-equivalence classes are often a big win when using compressed tables, but they have a moderate performance impact (one or two "if" tests and one array look-up per character scanned).
es: B<-Cm> ordena a I<flex> a que construya I<clases de meta-equivalencias,> que son conjuntos de clases de equivalencia (o caracteres, si las clases de equivalencia no se están usando) que comunmente se usan de forma conjunta. Las clases de meta-equivalencias son a menudo un gran ahorro cuando se usan tablas comprimidas, pero tienen un impacto moderado en el rendimiento (uno o dos tests "if" y una localización en un array por caracter analizado).

source: B<-Cr> causes the generated scanner to I<bypass> use of the standard I/O library (stdio) for input. Instead of calling B<fread()> or B<getc(),> the scanner will use the B<read()> system call, resulting in a performance gain which varies from system to system, but in general is probably negligible unless you are also using B<-Cf> or B<-CF.> Using B<-Cr> can cause strange behavior if, for example, you read from I<yyin> using stdio prior to calling the scanner (because the scanner will miss whatever text your previous reads left in the stdio input buffer).
es: B<-Cr> hace que el analizador generado I<elimine> el uso de la librería de E/S estándar para la entrada. En lugar de llamar a B<fread()> o B<getc(),> el analizador utilizará la llamada al sistema B<read(),> produciendo una ganancia en el rendimiento que varía de sistema en sistema, pero en general probablemente es insignificante a menos que también esté usando B<-Cf> o B<-CF.> El uso de B<-Cr> puede producir un comportamiento extraño si, por ejemplo, lee de I<yyin> usando stdio antes de llamar al analizador (porque el analizador perderá cualquier texto que sus lecturas anteriores dejaron en el buffer de entrada de stdio).

source: B<-Cr> has no effect if you define B<YY_INPUT> (see The Generated Scanner above).
es: B<-Cr> no tiene efecto si usted define B<YY_INPUT> (ver El Escáner Generado más arriba).

source: A lone B<-C> specifies that the scanner tables should be compressed but neither equivalence classes nor meta-equivalence classes should be used.
es: Con solamente B<-C> se especifica que las tablas del analizador deberían comprimirse pero no debería utilizarse ni las clases de equivalencia ni las clases de meta-equivalencias.

source: The options B<-Cf> or B<-CF> and B<-Cm> do not make sense together - there is no opportunity for meta-equivalence classes if the table is not being compressed. Otherwise the options may be freely mixed, and are cumulative.
es: Las opciones B<-Cf> o B<-CF> y B<-Cm> no tienen sentido juntas - no hay oportunidad para las clases de meta-equivalencias si la tabla no está siendo comprimida. De otra forma las opciones podrían mezclarse líbremente, y son acumulativas.

source: The default setting is B<-Cem,> which specifies that I<flex> should generate equivalence classes and meta-equivalence classes. This setting provides the highest degree of table compression. You can trade off faster-executing scanners at the cost of larger tables with the following generally being true:
es: La configuración por defecto es B<-Cem,> que especifica que I<flex> debería generar clases de equivalencia y clases de meta-equivalencias. Esta configuración provee el mayor grado de compresión. Puede llegarse a un compromiso entre analizadores de ejecución más rápida con el coste de tablas mayores siendo generalmente verdadero lo siguiente:

source: slowest & smallest -Cem -Cm -Ce -C -C{f,F}e -C{f,F} -C{f,F}a fastest & largest
es: lo más lento y pequeño -Cem -Cm -Ce -C -C{f,F}e -C{f,F} -C{f,F}a lo más rápido y grande

source: Note that scanners with the smallest tables are usually generated and compiled the quickest, so during development you will usually want to use the default, maximal compression.
es: Fíjese que los analizadores con tablas más pequeñas normalmente se generan y compilan de la forma más rápida posible, así que durante el desarrollo usted normalmente querrá usar como viene por defecto, compresión máxima.

source: B<-Cfe> is often a good compromise between speed and size for production scanners.
es: B<-Cfe> a menudo es un buen compromiso entre velocidad y tamaño para la producción de analizadores.

source: B<-ooutput>
es: B<-osalida>

source: directs flex to write the scanner to the file B<output> instead of B<lex.yy.c.> If you combine B<-o> with the B<-t> option, then the scanner is written to I<stdout> but its B<#line> directives (see the B<-L> option above) refer to the file B<output.>
es: ordena a flex que escriba el analizador al fichero B<salida> en lugar de a B<lex.yy.c.> Si combina B<-o> con la opción B<-t,> entonces el analizador se escribe en I<stdout> pero sus directivas B<#line> (vea la opción B<-L> más arriba) hacen referencia al fichero B<salida.>

source: B<-Pprefix>
es: B<-Pprefijo>

source: changes the default I<yy> prefix used by I<flex> for all globally-visible variable and function names to instead be I<prefix.> For example, B<-Pfoo> changes the name of B<yytext> to B<footext.> It also changes the name of the default output file from B<lex.yy.c> to B<lex.foo.c.> Here are all of the names affected:
es: cambia el prefijo I<yy> usado por defecto por I<flex> para todas las variables visibles globalmente y nombres de funciones para que sea I<prefijo.> Por ejemplo, B<-Pfoo> cambia el nombre de B<yytext> a B<footext.> Este también cambia el nombre por defecto del fichero de salida de B<lex.yy.c> a B<lex.foo.c.> Aquí están todos los nombres afectados:

source: (If you are using a C++ scanner, then only B<yywrap> and B<yyFlexLexer> are affected.) Within your scanner itself, you can still refer to the global variables and functions using either version of their name; but externally, they have the modified name.
es: (Si usted está utilizando un analizador en C++, entonces únicamente B<yywrap> y B<yyFlexLexer> se ven afectados.) Dentro de su analizador, puede aún hacer referencia a las variables globales y funciones usando cualquier versión de su nombre; pero externamente, estas tienen el nombre modificado.

source: This option lets you easily link together multiple I<flex> programs into the same executable. Note, though, that using this option also renames B<yywrap(),> so you now I<must> either provide your own (appropriately-named) version of the routine for your scanner, or use B<%option noyywrap,> as linking with B<-lfl> no longer provides one for you by default.
es: Esta opción le deja enlazar fácilmente múltiples programas I<flex> conjuntamente en el mismo ejecutable. Fíjese, sin embargo, que usando esta opción también se renombra B<yywrap(),> de manera que ahora I<debe> o bien proveer su propia versión de la rutina (con el nombre apropiado) para su analizador, o usar B<%option noyywrap,> ya que enlazar con B<-lfl> no podrá proveerle una por defecto.

source: B<-Sskeleton_file>
es: B<-Sfichero_esqueleto>

source: overrides the default skeleton file from which I<flex> constructs its scanners. You'll never need this option unless you are doing I<flex> maintenance or development.
es: ignora el fichero de esqueleteo por defecto con el que I<flex> construye sus analizadores. Usted probablemente nunca necesitará utilizar esta opción a menos que este haciendo mantenimiento o un desarrollo de I<flex>.

source: I<flex> also provides a mechanism for controlling options within the scanner specification itself, rather than from the flex command-line. This is done by including B<%option> directives in the first section of the scanner specification. You can specify multiple options with a single B<%option> directive, and multiple directives in the first section of your flex input file.
es: I<flex> también ofrece un mecanismo para controlar las opciones dentro de la propia especificación del analizador, en vez de a partir de la línea de comando. Esto se hace incluyendo las directivas B<%option> en la primera sección de la especificación del analizador. Usted puede especificar varias opciones con una sola directiva B<%option,> y varias directivas en la primera sección de su fichero de entrada de flex.

source: Most options are given simply as names, optionally preceded by the word "no" (with no intervening whitespace) to negate their meaning. A number are equivalent to flex flags or their negation:
es: La mayoría de las opciones vienen dadas simplemente como nombres, opcionalmente precedidos por la palabra "no" (sin intervenir un espacio) para negar su significado. Las banderas de flex o su negación son equivalentes a un número:

source: 7bit -7 option 8bit -8 option align -Ca option backup -b option batch -B option c++ -+ option
es: 7bit opción -7 8bit opción -8 align opción -Ca backup opción -b batch opción -B c++ opción -+

source: caseful or case-sensitive opposite of -i (default)
es: caseful o case-sensitive opuesto de -i (por defecto)

source: case-insensitive or caseless -i option
es: case-insensitive o caseless opción -i

source: debug -d option default opposite of -s option ecs -Ce option fast -F option full -f option interactive -I option lex-compat -l option meta-ecs -Cm option perf-report -p option read -Cr option stdout -t option verbose -v option warn opposite of -w option (use "%option nowarn" for -w)
es: debug opción -d default opuesto de la opción -s ecs opción -Ce fast opción -F full opción -f interactive opción -I lex-compat opción -l meta-ecs opción -Cm perf-report opción -p read opción -Cr stdout opción -t verbose opción -v warn opuesto de la opción -w (use "%option nowarn" para -w)

source: array equivalent to "%array" pointer equivalent to "%pointer" (default)
es: array equivalente a "%array" pointer equivalente a "%pointer" (por defecto)

source: Some B<%option's> provide features otherwise not available:
es: Algunas directivas B<%option> ofrecen propiedades que de otra manera no están disponibles:

source: instructs flex to generate a scanner which always considers its input "interactive". Normally, on each new input file the scanner calls B<isatty()> in an attempt to determine whether the scanner's input source is interactive and thus should be read a character at a time. When this option is used, however, then no such call is made.
es: ordena a flex que genere un analizador que siempre considere su entrada como "interactiva". Normalmente, sobre cada fichero de entrada nuevo el analizador llama a B<isatty()> como intento para determinar si la entrada del analizador es interactiva y por lo tanto debería leer un caracter a la vez. Cuando esta opción se utilice, sin embargo, entonces no se hace tal llamada.

source: directs flex to provide a default B<main()> program for the scanner, which simply calls B<yylex().> This option implies B<noyywrap> (see below).
es: ordena a flex que facilite un programa B<main()> por defecto para el analizador, que simplemente llame a B<yylex().> Esta opción implica B<noyywrap> (ver más abajo).

source: instructs flex to generate a scanner which never considers its input "interactive" (again, no call made to B<isatty()).> This is the opposite of B<always-interactive.>
es: ordena a flex que genere un analizador que nunca considere su entrada como "interactiva" (de nuevo, no se hace ninguna llamada a B<isatty()).> Esta es la opuesta a B<always-interactive.>

source: enables the use of start condition stacks (see Start Conditions above).
es: activa el uso de pilas de condiciones de arranque (ver Condiciones de Arranque más arriba).

source: if set (i.e., B<%option stdinit)> initializes I<yyin> and I<yyout> to I<stdin> and I<stdout,> instead of the default of I<nil.> Some existing I<lex> programs depend on this behavior, even though it is not compliant with ANSI C, which does not require I<stdin> and I<stdout> to be compile-time constant.
es: si se establece (es decir, B<%option stdinit)> inicializa I<yyin> e I<yyout> a I<stdin> y I<stdout,> en lugar del que viene por defecto que es I<nil.> Algunos pogramas de I<lex> existentes dependen de este comportamiento, incluso si no sigue el ANSI C, que no requiere que I<stdin> y I<stdout> sean constantes en tiempo de compilación.

source: directs I<flex> to generate a scanner that maintains the number of the current line read from its input in the global variable B<yylineno.> This option is implied by B<%option lex-compat.>
es: ordena a I<flex> a generar un analizador que mantenga el número de la línea actual leída desde su entrada en la variable global B<yylineno.> Esta opción viene implícita con B<%option lex-compat.>

source: if unset (i.e., B<%option noyywrap),> makes the scanner not call B<yywrap()> upon an end-of-file, but simply assume that there are no more files to scan (until the user points I<yyin> at a new file and calls B<yylex()> again).
es: si no se establece (es decir, B<%option noyywrap),> hace que el analizador no llame a B<yywrap()> hasta el fin-de-fichero, pero simplemente asume que no hay más ficheros que analizar (hasta que el usuario haga apuntar I<yyin> a un nuevo fichero y llame a B<yylex()> otra vez).

source: I<flex> scans your rule actions to determine whether you use the B<REJECT> or B<yymore()> features. The B<reject> and B<yymore> options are available to override its decision as to whether you use the options, either by setting them (e.g., B<%option reject)> to indicate the feature is indeed used, or unsetting them to indicate it actually is not used (e.g., B<%option noyymore).>
es: I<flex> analiza las acciones de sus reglas para determinar si utiliza las propiedades B<REJECT> o B<yymore()> Las opciones B<reject> e B<yymore> están disponibles para ignorar sus decisiones siempre que use las opciones, o bien estableciendolas (p.ej., B<%option reject)> para indicar que la propiedad se utiliza realmente, o desactivándolas para indicar que no es utilizada (p.ej., B<%option noyymore).>

source: Three options take string-delimited values, offset with '=':
es: Tres opciones toman valores delimitados por cadenas, separadas por '=':

source: is equivalent to B<-oABC,> and
es: es equivalente a B<-oABC,> y

source: is equivalent to B<-PXYZ.> Finally,
es: es equivalente a B<-PXYZ.> Finalmente,

source: only applies when generating a C++ scanner ( B<-+> option). It informs I<flex> that you have derived B<foo> as a subclass of B<yyFlexLexer,> so I<flex> will place your actions in the member function B<foo::yylex()> instead of B<yyFlexLexer::yylex().> It also generates a B<yyFlexLexer::yylex()> member function that emits a run-time error (by invoking B<yyFlexLexer::LexerError())> if called. See Generating C++ Scanners, below, for additional information.
es: sólo se aplica cuando se genera un analizador en C++ (opción B<-+).> Este informa a I<flex> que ha derivado a B<foo> como una subclase de B<yyFlexLexer,> así que I<flex> pondrá sus acciones en la función miembro B<foo::yylex()> en lugar de B<yyFlexLexer::yylex().> Este también genera una función miembro B<yyFlexLexer::yylex()> que emite un error en tiempo de ejecución (invocando a B<yyFlexLexer::LexerError())> si es llamada. Ver Generando Escáners en C++, más abajo, para información adicional.

source: A number of options are available for lint purists who want to suppress the appearance of unneeded routines in the generated scanner. Each of the following, if unset (e.g., B<%option nounput> ), results in the corresponding routine not appearing in the generated scanner:
es: Están disponibles un número de opciones para los puristas de lint que desean suprimir la aparición de rutinas no necesarias en el analizador generado. Cada una de la siguientes, si se desactivan (p.ej., B<%option nounput> ), hace que la rutina correspondiente no aparezca en el analizador generado:

source: (though B<yy_push_state()> and friends won't appear anyway unless you use B<%option stack).>
es: (aunque B<yy_push_state()> y sus amigas no aparecerán de todas manera a menos que use B<%option stack).>

source: PERFORMANCE CONSIDERATIONS
es: CONSIDERACIONES DE RENDIMIENTO

source: The main design goal of I<flex> is that it generate high-performance scanners. It has been optimized for dealing well with large sets of rules. Aside from the effects on scanner speed of the table compression B<-C> options outlined above, there are a number of options/actions which degrade performance. These are, from most expensive to least:
es: El principal objetivo de diseño de I<flex> es que genere analizadores de alto rendimiento. Este ha sido optimizado para comportarse bien con conjuntos grandes de reglas. Aparte de los efectos sobre la velocidad del analizador con las opciones de compresión de tablas B<-C> anteriormente introducidas, hay un número de opciones/acciones que degradan el rendimiento. Estas son, desde la más costosa a la menos:

source: REJECT %option yylineno arbitrary trailing context
es: REJECT %option yylineno contexto posterior arbitrario

source: pattern sets that require backing up %array %option interactive %option always-interactive
es: conjunto de patrones que requieren retroceso %array %option interactive %option always-interactive

source: '^' beginning-of-line operator yymore()
es: '^' operador de comienzo de línea yymore()
