Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: { int i; /* Copy yytext because unput() trashes yytext */ char *yycopy = strdup( yytext ); unput( ')' ); for ( i = yyleng - 1; i E<gt>= 0; --i ) unput( yycopy[i] ); unput( '(' ); free( yycopy ); }
es: { int i; /* Copia yytext porque unput() desecha yytext */ char *yycopia = strdup( yytext ); unput( ')' ); for ( i = yyleng - 1; i E<gt>= 0; --i ) unput( yycopia[i] ); unput( '(' ); free( yycopia ); }

source: Note that since each B<unput()> puts the given character back at the I<beginning> of the input stream, pushing back strings must be done back-to-front.
es: Fíjese que ya que cada B<unput()> pone el caracter dado de nuevo al I<principio> del flujo de entrada, al devolver cadenas de caracteres se debe hacer de atrás hacia delante.

source: An important potential problem when using B<unput()> is that if you are using B<%pointer> (the default), a call to B<unput()> I<destroys> the contents of I<yytext,> starting with its rightmost character and devouring one character to the left with each call. If you need the value of yytext preserved after a call to B<unput()> (as in the above example), you must either first copy it elsewhere, or build your scanner using B<%array> instead (see How The Input Is Matched).
es: Un problema potencial importante cuando se utiliza B<unput()> es que si está usando B<%pointer> (por defecto), una llamada a B<unput()> I<destruye> el contenido de I<yytext,> comenzando con su caracter más a la derecha y devorando un caracter a la izquierda con cada llamada. Si necesita que se preserve el valor de yytext después de una llamada a B<unput()> (como en el ejemplo anterior), usted debe o bien copiarlo primero en cualquier lugar, o construir su escáner usando B<%array> (ver Cómo se Empareja la Entrada).

source: Finally, note that you cannot put back B<EOF> to attempt to mark the input stream with an end-of-file.
es: Finalmente, note que no puede devolver B<EOF> para intentar marcar el flujo de entrada con un fin-de-fichero.

source: B<input()> reads the next character from the input stream. For example, the following is one way to eat up C comments:
es: B<input()> lee el próximo caracter del flujo de entrada. Por ejemplo, lo que viene a continuación es una manera de comerse los comentarios en C:

source: for ( ; ; ) { while ( (c = input()) != '*' && c != EOF ) ; /* eat up text of comment */
es: for ( ; ; ) { while ( (c = input()) != '*' && c != EOF ) ; /* se come el texto del comentario */

source: if ( c == '*' ) { while ( (c = input()) == '*' ) ; if ( c == '/' ) break; /* found the end */ }
es: if ( c == '*' ) { while ( (c = input()) == '*' ) ; if ( c == '/' ) break; /* encontró el final */ }

source: if ( c == EOF ) { error( "EOF in comment" ); break; } } }
es: if ( c == EOF ) { error( "EOF en comentario" ); break; } } }

source: (Note that if the scanner is compiled using B<C++,> then B<input()> is instead referred to as B<yyinput(),> in order to avoid a name clash with the B<C++> stream by the name of I<input.)>
es: (Fíjese que si el escáner se compila usando B<C++,> entonces a B<input()> se le hace referencia con B<yyinput(),> para evitar una colisión de nombre con el flujo de B<C++> por el nombre I<input.)>

source: B<YY_FLUSH_BUFFER> flushes the scanner's internal buffer so that the next time the scanner attempts to match a token, it will first refill the buffer using B<YY_INPUT> (see The Generated Scanner, below). This action is a special case of the more general B<yy_flush_buffer()> function, described below in the section Multiple Input Buffers.
es: B<YY_FLUSH_BUFFER> vacía el buffer interno del escáner de manera que la próxima vez que el escáner intente emparejar un token, este primero rellenará el buffer usando B<YY_INPUT> (ver El Escáner Generado, más abajo). Esta acción es un caso especial de la función más general B<yy_flush_buffer(),> descrita más abajo en la sección Múltiples Buffers de Entrada.

source: B<yyterminate()> can be used in lieu of a return statement in an action. It terminates the scanner and returns a 0 to the scanner's caller, indicating "all done". By default, B<yyterminate()> is also called when an end-of-file is encountered. It is a macro and may be redefined.
es: B<yyterminate()> se puede utilizar en lugar de una sentencia de retorno en una acción. Esta hace que finalice el escáner y retorne un 0 a quien haya llamado al escáner, indicando que "todo está hecho". Por defecto, también se llama a B<yyterminate()> cuando se encuentra un fin-de-fichero. Esta es una macro y podría ser redefinida.

source: THE GENERATED SCANNER
es: El Escáner Generado

source: The output of I<flex> is the file B<lex.yy.c,> which contains the scanning routine B<yylex(),> a number of tables used by it for matching tokens, and a number of auxiliary routines and macros. By default, B<yylex()> is declared as follows:
es: La salida de I<flex> es el fichero B<lex.yy.c,> que contiene la rutina de análisis B<yylex(),> un número de tablas usadas por esta para emparejar tokens, y un número de rutinas auxiliares y macros. Por defecto, B<yylex()> se declara así

source: int yylex() { ... various definitions and the actions in here ... }
es: int yylex() { ... aquí van varias definiciones y las acciones ... }

source: (If your environment supports function prototypes, then it will be "int yylex( void )".) This definition may be changed by defining the "YY_DECL" macro. For example, you could use:
es: (Si su entorno acepta prototipos de funciones, entonces este será "int yylex( void )"). Esta definición podría modificarse definiendo la macro "YY_DECL". Por ejemplo, podría utilizar:

source: to give the scanning routine the name I<lexscan,> returning a float, and taking two floats as arguments. Note that if you give arguments to the scanning routine using a K&R-style/non-prototyped function declaration, you must terminate the definition with a semi-colon (;).
es: para darle a la rutina de análisis el nombre I<lexscan,> que devuelve un real, y toma dos reales como argumentos. Fíjese que si pone argumentos a la rutina de análisis usando una declaración de función no-prototipada/tipo-K&R, debe hacer terminar la definición con un punto y coma (;).

source: Whenever B<yylex()> is called, it scans tokens from the global input file I<yyin> (which defaults to stdin). It continues until it either reaches an end-of-file (at which point it returns the value 0) or one of its actions executes a I<return> statement.
es: Siempre que se llame a B<yylex()>, este analiza tokens desde el fichero de entrada global I<yyin> (que por defecto es igual a stdin). La función continúa hasta que alcance el final del fichero (punto en el que devuelve el valor 0) o una de sus acciones ejecute una sentencia I<return>.

source: If the scanner reaches an end-of-file, subsequent calls are undefined unless either I<yyin> is pointed at a new input file (in which case scanning continues from that file), or B<yyrestart()> is called. B<yyrestart()> takes one argument, a B<FILE *> pointer (which can be nil, if you've set up B<YY_INPUT> to scan from a source other than I<yyin),> and initializes I<yyin> for scanning from that file. Essentially there is no difference between just assigning I<yyin> to a new input file or using B<yyrestart()> to do so; the latter is available for compatibility with previous versions of I<flex,> and because it can be used to switch input files in the middle of scanning. It can also be used to throw away the current input buffer, by calling it with an argument of I<yyin;> but better is to use B<YY_FLUSH_BUFFER> (see above). Note that B<yyrestart()> does I<not> reset the start condition to B<INITIAL> (see Start Conditions, below).
es: Si el escáner alcanza un fin-de-fichero, entonces el comportamiento en las llamadas posteriores está indefinido a menos que o bien I<yyin> apunte a un nuevo fichero de entrada (en cuyo caso el análisis continúa a partir de ese fichero), o se llame a B<yyrestart().> B<yyrestart()> toma un argumento, un puntero B<FILE *> (que puede ser nulo, si ha preparado a B<YY_INPUT> para que analice una fuente distinta a I<yyin),> e inicializa I<yyin> para que escanee ese fichero. Esencialmente no hay diferencia entre la asignación a I<yyin> de un nuevo fichero de entrada o el uso de B<yyrestart()> para hacerlo; esto último está disponible por compatibilidad con versiones anteriores de I<flex,> y porque puede utilizarse para conmutar ficheros de entrada en medio del análisis. También se puede utilizar para desechar el buffer de entrada actual, invocándola con un argumento igual a I<yyin;> pero mejor es usar B<YY_FLUSH_BUFFER> (ver más arriba). Fíjese que B<yyrestart()> I<no> reinicializa la condición de arranque a B<INITIAL> (ver Condiciones de Arranque, más abajo).

source: If B<yylex()> stops scanning due to executing a I<return> statement in one of the actions, the scanner may then be called again and it will resume scanning where it left off.
es: Si B<yylex()> para el análisis debido a la ejecución de una sentencia I<return> en una de las acciones, el analizador podría ser llamado de nuevo y este reanudaría el análisis donde lo dejó.

source: By default (and for purposes of efficiency), the scanner uses block-reads rather than simple I<getc()> calls to read characters from I<yyin.> The nature of how it gets its input can be controlled by defining the B<YY_INPUT> macro. YY_INPUT's calling sequence is "YY_INPUT(buf,result,max_size)". Its action is to place up to I<max_size> characters in the character array I<buf> and return in the integer variable I<result> either the number of characters read or the constant YY_NULL (0 on Unix systems) to indicate EOF. The default YY_INPUT reads from the global file-pointer "yyin".
es: Por defecto (y por razones de eficiencia), el analizador usa lecturas por bloques en lugar de simples llamadas a I<getc()> para leer caracteres desde I<yyin.> La manera en la que toma su entrada se puede controlar definienfo la macro B<YY_INPUT.> La secuencia de llamada para YY_INPUT es "YY_INPUT(buf,result,max_size)". Su acción es poner hasta I<max_size> caracteres en el array de caracteres I<buf> y devolver en la variable entera I<result> bien o el número de caracteres leídos o la constante YY_NULL (0 en sistemas Unix) para indicar EOF. Por defecto YY_INPUT lee desde la variable global puntero a fichero "yyin".

source: A sample definition of YY_INPUT (in the definitions section of the input file):
es: Una definición de ejemplo para YY_INPUT (en la sección de definiciones del fichero de entrada) es:

source: This definition will change the input processing to occur one character at a time.
es: Esta definición cambiará el procesamiento de la entrada para que suceda un caracter a la vez.

source: When the scanner receives an end-of-file indication from YY_INPUT, it then checks the B<yywrap()> function. If B<yywrap()> returns false (zero), then it is assumed that the function has gone ahead and set up I<yyin> to point to another input file, and scanning continues. If it returns true (non-zero), then the scanner terminates, returning 0 to its caller. Note that in either case, the start condition remains unchanged; it does I<not> revert to B<INITIAL.>
es: Cuando el analizador reciba una indicación de fin-de-fichero desde YY_INPUT, entonces esta comprueba la función B<yywrap().> Si B<yywrap()> devuelve falso (cero), entonces se asume que la función ha ido más allá y ha preparado I<yyin> para que apunte a otro fichero de entrada, y el análisis continúa. Si este retorna verdadero (no-cero), entonces el analizador termina, devolviendo un 0 a su invocador. Fíjese que en cualquier caso, la condición de arranque permanece sin cambios; esta I<no> vuelve a ser B<INITIAL.>

source: If you do not supply your own version of B<yywrap(),> then you must either use B<%option noyywrap> (in which case the scanner behaves as though B<yywrap()> returned 1), or you must link with B<-lfl> to obtain the default version of the routine, which always returns 1.
es: Si no proporciona su propia versión de B<yywrap(),> entonces debe bien o usar B<%option noyywrap> (en cuyo caso el analizador se comporta como si B<yywrap()> devolviera un 1), o debe enlazar con B<-lfl> para obtener la versión por defecto de la rutina, que siempre devuelve un 1.

source: Three routines are available for scanning from in-memory buffers rather than files: B<yy_scan_string(), yy_scan_bytes(),> and B<yy_scan_buffer().> See the discussion of them below in the section Multiple Input Buffers.
es: Hay disponibles tres rutinas para analizar desde buffers de memoria en lugar de desde ficheros: B<yy_scan_string(), yy_scan_bytes(),> e B<yy_scan_buffer().> Las trataremos en la sección Múltiples Buffers de Entrada.

source: The scanner writes its B<ECHO> output to the I<yyout> global (default, stdout), which may be redefined by the user simply by assigning it to some other B<FILE> pointer.
es: El analizador escribe su salida con B<ECHO> a la variable global I<yyout> (por defecto, stdout), que el usuario podría redefinir asignándole cualquier otro puntero a B<FILE>.

source: START CONDITIONS
es: CONDICIONES DE ARRANQUE

source: I<flex> provides a mechanism for conditionally activating rules. Any rule whose pattern is prefixed with "E<lt>scE<gt>" will only be active when the scanner is in the start condition named "sc". For example,
es: I<flex> dispone de un mecanismo para activar reglas condicionalmente. Cualquier regla cuyo patrón se prefije con "E<lt>scE<gt>" únicamente estará activa cuando el analizador se encuentre en la condición de arranque llamada "sc". Por ejemplo,

source: E<lt>STRINGE<gt>[^"]* { /* eat up the string body ... */ ... }
es: E<lt>STRINGE<gt>[^"]* { /* se come el cuerpo de la cadena ... */ ... }

source: will be active only when the scanner is in the "STRING" start condition, and
es: estará activa solamente cuando el analizador esté en la condición de arranque "STRING", y

source: E<lt>INITIAL,STRING,QUOTEE<gt>\e. { /* handle an escape ... */ ... }
es: E<lt>INITIAL,STRING,QUOTEE<gt>\e. { /* trata una secuencia de escape ... */ ... }

source: will be active only when the current start condition is either "INITIAL", "STRING", or "QUOTE".
es: estará activa solamente cuando la condición de arranque actual sea o bien "INITIAL", "STRING", o "QUOTE".

source: Start conditions are declared in the definitions (first) section of the input using unindented lines beginning with either B<%s> or B<%x> followed by a list of names. The former declares I<inclusive> start conditions, the latter I<exclusive> start conditions. A start condition is activated using the B<BEGIN> action. Until the next B<BEGIN> action is executed, rules with the given start condition will be active and rules with other start conditions will be inactive. If the start condition is I<inclusive,> then rules with no start conditions at all will also be active. If it is I<exclusive,> then I<only> rules qualified with the start condition will be active. A set of rules contingent on the same exclusive start condition describe a scanner which is independent of any of the other rules in the I<flex> input. Because of this, exclusive start conditions make it easy to specify "mini-scanners" which scan portions of the input that are syntactically different from the rest (e.g., comments).
es: Las condiciones de arranque se declaran en la (primera) sección de definiciones de la entrada usando líneas sin sangrar comenzando con B<%s> o B<%x> seguida por una lista de nombres. Lo primero declara condiciones de arranque I<inclusivas,> lo último condiciones de arranque I<exclusivas.> Una condición de arranque se activa utilizando la acción B<BEGIN.> Hasta que se ejecute la próxima acción B<BEGIN,> las reglas con la condición de arranque dada estarán activas y las reglas con otras condiciones de arranque estarán inactivas. Si la condición de arranque es I<inclusiva,> entonces las reglas sin condiciones de arranque también estarán activas. Si es I<exclusiva,> entonces I<sólamente> las reglas calificadas con la condición de arranque estarán activas. Un conjunto de reglas dependientes de la misma condición de arranque exclusiva describe un analizador que es independiente de cualquiera de las otras reglas en la entrada de I<flex.> Debido a esto, las condiciones de arranque exclusivas hacen fácil la especificación de "mini-escáneres" que analizan porciones de la entrada que son sintácticamente diferentes al resto (p.ej., comentarios).

source: If the distinction between inclusive and exclusive start conditions is still a little vague, here's a simple example illustrating the connection between the two. The set of rules:
es: Si la distinción entre condiciones de arranque inclusivas o exclusivas es aún un poco vaga, aquí hay un ejemplo simple que ilustra la conexión entre las dos. El conjunto de reglas:

source: %s example %%
es: %s ejemplo %%

source: E<lt>exampleE<gt>foo do_something();
es: E<lt>ejemploE<gt>foo hacer_algo();

source: bar something_else();
es: bar algo_mas();

source: is equivalent to
es: es equivalente a

source: %x example %%
es: %x ejemplo %%

source: E<lt>INITIAL,exampleE<gt>bar something_else();
es: E<lt>INITIAL,ejemploE<gt>bar algo_mas();

source: Without the B<E<lt>INITIAL,exampleE<gt>> qualifier, the I<bar> pattern in the second example wouldn't be active (i.e., couldn't match) when in start condition B<example.> If we just used B<E<lt>exampleE<gt>> to qualify I<bar,> though, then it would only be active in B<example> and not in B<INITIAL,> while in the first example it's active in both, because in the first example the B<example> startion condition is an I<inclusive> B<(%s)> start condition.
es: Sin el calificador B<E<lt>INITIAL,exampleE<gt>,> el patrón I<bar> en el segundo ejemplo no estará activo (es decir, no puede emparejarse) cuando se encuentre en la condición de arranque B<example.> Si hemos usado B<E<lt>exampleE<gt>> para calificar I<bar,> aunque, entonces este únicamente estará activo en B<example> y no en B<INITIAL,> mientras que en el primer ejemplo está activo en ambas, porque en el primer ejemplo la condición de arranque B<example> es una condición de arranque I<inclusiva> B<(%s)>.

source: Also note that the special start-condition specifier B<E<lt>*E<gt>> matches every start condition. Thus, the above example could also have been written;
es: Fíjese también que el especificador especial de la condición de arranque B<E<lt>*E<gt>> empareja todas las condiciones de arranque. Así, el ejemplo anterior también pudo haberse escrito;

source: E<lt>*E<gt>bar something_else();
es: E<lt>*E<gt>bar algo_mas();

source: The default rule (to B<ECHO> any unmatched character) remains active in start conditions. It is equivalent to:
es: La regla por defecto (hacer un B<ECHO> con cualquier caracter sin emparejar) permanece activa en las condiciones de arranque. Esta es equivalente a:

source: B<BEGIN(0)> returns to the original state where only the rules with no start conditions are active. This state can also be referred to as the start-condition "INITIAL", so B<BEGIN(INITIAL)> is equivalent to B<BEGIN(0).> (The parentheses around the start condition name are not required but are considered good style.)
es: B<BEGIN(0)> retorna al estado original donde solo las reglas sin condiciones de arranque están activas. Este estado también puede referirse a la condición de arranque "INITIAL", así que B<BEGIN(INITIAL)> es equivalente a B<BEGIN(0).> (No se requieren los paréntesis alrededor del nombre de la condición de arranque pero se considera de buen estilo.)

source: B<BEGIN> actions can also be given as indented code at the beginning of the rules section. For example, the following will cause the scanner to enter the "SPECIAL" start condition whenever B<yylex()> is called and the global variable I<enter_special> is true:
es: Las acciones B<BEGIN> pueden darse también como código sangrado al comienzo de la sección de reglas. Por ejemplo, lo que viene a continuación hará que el analizador entre en la condición de arranque "ESPECIAL" siempre que se llame a B<yylex()> y la variable global I<entra_en_especial> sea verdadera:

source: int enter_special;
es: int entra_en_especial;

source: %x SPECIAL %% if ( enter_special ) BEGIN(SPECIAL);
es: %x ESPECIAL %% if ( entra_en_especial ) BEGIN(ESPECIAL);

source: E<lt>SPECIALE<gt>blahblahblah ...more rules follow...
es: E<lt>ESPECIALE<gt>blablabla ...más reglas a continuación...

source: To illustrate the uses of start conditions, here is a scanner which provides two different interpretations of a string like "123.456". By default it will treat it as three tokens, the integer "123", a dot ('.'), and the integer "456". But if the string is preceded earlier in the line by the string "expect-floats" it will treat it as a single token, the floating-point number 123.456:
es: Para ilustrar los usos de las condiciones de arranque, aquí hay un analizador que ofrece dos interpretaciones diferentes para una cadena como "123.456". Por defecto este la tratará como tres tokens, el entero "123", un punto ('.'), y el entero "456". Pero si la cadena viene precedida en la línea por la cadena "espera-reales" este la tratará como un único token, el número en coma flotante 123.456:

source: %{ #include E<lt>math.hE<gt> %} %s expect
es: %{ #include E<lt>math.hE<gt> %} %s espera

source: %% expect-floats BEGIN(expect);
es: %% espera-reales BEGIN(espera);

source: E<lt>expectE<gt>[0-9]+"."[0-9]+ { printf( "found a float, = %f\en", atof( yytext ) ); } E<lt>expectE<gt>\en { /* that's the end of the line, so * we need another "expect-number" * before we'll recognize any more * numbers */ BEGIN(INITIAL); }
es: E<lt>esperaE<gt>[0-9]+"."[0-9]+ { printf( "encontró un real, = %f\en", atof( yytext ) ); } E<lt>esperaE<gt>\en { /* este es el final de la línea, * así que necesitamos otro * "espera-numero" antes de * que volvamos a reconocer más * números */ BEGIN(INITIAL); }

source: [0-9]+ { printf( "found an integer, = %d\en", atoi( yytext ) ); }
es: [0-9]+ { printf( "encontró un entero, = %d\en", atoi( yytext ) ); }

source: "." printf( "found a dot\en" );
es: "." printf( "encontró un punto\en" );

source: Here is a scanner which recognizes (and discards) C comments while maintaining a count of the current input line.
es: Aquí está un analizador que reconoce (y descarta) comentarios de C mientras mantiene una cuenta de la línea actual de entrada.

source: %x comment %% int line_num = 1;
es: %x comentario %% int num_linea = 1;

source: "/*" BEGIN(comment);
es: "/*" BEGIN(comentario);

source: E<lt>commentE<gt>[^*\en]* /* eat anything that's not a '*' */ E<lt>commentE<gt>"*"+[^*/\en]* /* eat up '*'s not followed by '/'s */ E<lt>commentE<gt>\en ++line_num; E<lt>commentE<gt>"*"+"/" BEGIN(INITIAL);
es: E<lt>commentE<gt>[^*\en]* /* come todo lo que no sea '*' */ E<lt>commentE<gt>"*"+[^*/\en]* /* come '*'s no seguidos por '/'s */ E<lt>commentE<gt>\en ++num_linea; E<lt>commentE<gt>"*"+"/" BEGIN(INITIAL);

source: This scanner goes to a bit of trouble to match as much text as possible with each rule. In general, when attempting to write a high-speed scanner try to match as much possible in each rule, as it's a big win.
es: Este analizador se complica un poco para emparejar tanto texto como le sea posible en cada regla. En general, cuando se intenta escribir un analizador de alta velocidad haga que cada regla empareje lo más que pueda, ya que esto es un buen logro.

source: Note that start-conditions names are really integer values and can be stored as such. Thus, the above could be extended in the following fashion:
es: Fíjese que los nombres de las condiciones de arranque son realmente valores enteros y pueden ser almacenados como tales. Así, lo anterior podría extenderse de la siguiente manera:
