Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: I<too many start conditions in E<lt>E<gt> construct! -> you listed more start conditions in a E<lt>E<gt> construct than exist (so you must have listed at least one of them twice).
es: I<too many start conditions in E<lt>E<gt> construct! -> ha listado más condiciones de arranque en una construcción E<lt>E<gt> que las que existen (así que tuvo que haber listado al menos una de ellas dos veces).

source: FILES
es: FICHEROS

source: library with which scanners must be linked.
es: librería con la que los analizadores deben enlazarse.

source: generated scanner (called I<lexyy.c> on some systems).
es: analizador generado (llamado I<lexyy.c> en algunos sistemas).

source: generated C++ scanner class, when using B<-+.>
es: clase generada en C++ con el analizador, cuando se utiliza B<-+.>

source: header file defining the C++ scanner base class, B<FlexLexer,> and its derived class, B<yyFlexLexer.>
es: fichero de cabecera definiendo la clase base del analizador en C++, B<FlexLexer,> y su clase derivada, B<yyFlexLexer.>

source: skeleton scanner. This file is only used when building flex, not when flex executes.
es: esqueleto del analizador. Este fichero se utiliza únicamente cuando se construye flex, no cuando flex se ejecuta.

source: backing-up information for B<-b> flag (called I<lex.bck> on some systems).
es: información de los retrocesos para la bandera B<-b> (llamada I<lex.bck> en algunos sistemas).

source: DEFICIENCIES / BUGS
es: DEFICIENCIAS / ERRORES

source: Some trailing context patterns cannot be properly matched and generate warning messages ("dangerous trailing context"). These are patterns where the ending of the first part of the rule matches the beginning of the second part, such as "zx*/xy*", where the 'x*' matches the 'x' at the beginning of the trailing context. (Note that the POSIX draft states that the text matched by such patterns is undefined.)
es: Algunos patrones de contexto posterior no pueden reconocerse correctamente y generan mensajes de aviso ("contexto posterior peligroso"). Estos son patrones donde el final de la primera parte de la regla reconoce el comienzo de la segunda parte, tal como "zx*/xy*", donde el 'x*' reconoce la 'x' al comienzo del contexto posterior. (Fíjese que el borrador de POSIX establece que el texto reconocido por tales patrones no está definido.)

source: For some trailing context rules, parts which are actually fixed-length are not recognized as such, leading to the abovementioned performance loss. In particular, parts using '|' or {n} (such as "foo{3}") are always considered variable-length.
es: Para algunas reglas de contexto posterior, partes que son de hecho de longitud fija no se reconocen como tales, resultando en la pérdida de rendimiento mencionada anteriormente. En particular, las partes que usan '|' o {n} (tales como "foo{3}") siempre se consideran de longitud variable.

source: Combining trailing context with the special '|' action can result in I<fixed> trailing context being turned into the more expensive I<variable> trailing context. For example, in the following:
es: La combinación de contexto posterior con la acción especial '|' puede producir que el contexto posterior I<fijo> se convierta en contexto posterior I<variable> que es más caro. Por ejemplo, en lo que viene a continuación:

source: Use of B<unput()> invalidates yytext and yyleng, unless the B<%array> directive or the B<-l> option has been used.
es: El uso de B<unput()> invalida yytext e yyleng, a menos que se use la directiva B<%array> o la opción B<-l>.

source: Pattern-matching of NUL's is substantially slower than matching other characters.
es: La concordancia de patrones de NUL's es substancialmente más lento que el reconocimiento de otros caracteres.

source: Dynamic resizing of the input buffer is slow, as it entails rescanning all the text matched so far by the current (generally huge) token.
es: El ajuste dinámico del buffer de entrada es lento, ya que conlleva el reanálisis de todo el texto reconocido hasta entonces por el (generalmente enorme) token actual.

source: Due to both buffering of input and read-ahead, you cannot intermix calls to E<lt>stdio.hE<gt> routines, such as, for example, B<getchar(),> with I<flex> rules and expect it to work. Call B<input()> instead.
es: Debido al uso simultáneo de buffers de entrada y lecturas por adelantado, no puede entremezclar llamadas a rutinas de E<lt>stdio.hE<gt>, tales como, por ejemplo, B<getchar(),> con reglas de I<flex> y esperar que funcione. Llame a B<input()> en su lugar.

source: The total table entries listed by the B<-v> flag excludes the number of table entries needed to determine what rule has been matched. The number of entries is equal to the number of DFA states if the scanner does not use B<REJECT,> and somewhat greater than the number of states if it does.
es: La totalidad de las entradas de la tabla listada por la bandera B<-v> excluye el número de entradas en la tabla necesarias para determinar qué regla ha sido emparejada. El número de entradas es igual al número de estados del DFA si el analizador no usa B<REJECT,> y algo mayor que el número de estados si se usa.

source: B<REJECT> cannot be used with the B<-f> or B<-F> options.
es: B<REJECT> no puede usarse con las opciones B<-f> o B<-F.>

source: The I<flex> internal algorithms need documentation.
es: El algoritmo interno de I<flex> necesita documentación.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: John Levine, Tony Mason, and Doug Brown, I<Lex & Yacc,> O'Reilly and Associates. Be sure to get the 2nd edition.
es: John Levine, Tony Mason, and Doug Brown, I<Lex & Yacc,> O'Reilly and Associates. Esté seguro de obtener la 2ª edición.

source: M. E. Lesk and E. Schmidt, I<LEX - Lexical Analyzer Generator>
es: M. E. Lesk y E. Schmidt, I<LEX - Lexical Analyzer Generator>

source: Alfred Aho, Ravi Sethi and Jeffrey Ullman, I<Compilers: Principles, Techniques and Tools,> Addison-Wesley (1986). Describes the pattern-matching techniques used by I<flex> (deterministic finite automata).
es: Alfred Aho, Ravi Sethi and Jeffrey Ullman, I<Compilers: Principles, Techniques and Tools,> Addison-Wesley (1986) (Edición en castellano: I<Compiladores: Principios, Técnicas y Herramientas,> Addison-Wesley Iberoamericana, S.A. (1990)) Describe las técnicas de concordancia de patrones usadas por I<flex> (autómata finito determinista).

source: AUTHOR
es: AUTOR

source: Vern Paxson, with the help of many ideas and much inspiration from Van Jacobson. Original version by Jef Poskanzer. The fast table representation is a partial implementation of a design done by Van Jacobson. The implementation was done by Kevin Gong and Vern Paxson.
es: Vern Paxson, con la ayuda de muchas ideas e inspiración de Van Jacobson. Versión original por Jef Poskanzer. La representación de tablas rápidas es una implementación parcial de un diseño hecho por Van Jacobson. La implementación fue hecha por Kevin Gong y Vern Paxson.

source: Thanks to the many I<flex> beta-testers, feedbackers, and contributors, especially Francois Pinard, Casey Leedom, Robert Abramovitz, Stan Adermann, Terry Allen, David Barker-Plummer, John Basrai, Neal Becker, Nelson H.F. Beebe, benson@odi.com, Karl Berry, Peter A. Bigot, Simon Blanchard, Keith Bostic, Frederic Brehm, Ian Brockbank, Kin Cho, Nick Christopher, Brian Clapper, J.T. Conklin, Jason Coughlin, Bill Cox, Nick Cropper, Dave Curtis, Scott David Daniels, Chris G. Demetriou, Theo Deraadt, Mike Donahue, Chuck Doucette, Tom Epperly, Leo Eskin, Chris Faylor, Chris Flatters, Jon Forrest, Jeffrey Friedl, Joe Gayda, Kaveh R. Ghazi, Wolfgang Glunz, Eric Goldman, Christopher M. Gould, Ulrich Grepel, Peer Griebel, Jan Hajic, Charles Hemphill, NORO Hideo, Jarkko Hietaniemi, Scott Hofmann, Jeff Honig, Dana Hudes, Eric Hughes, John Interrante, Ceriel Jacobs, Michal Jaegermann, Sakari Jalovaara, Jeffrey R. Jones, Henry Juengst, Klaus Kaempf, Jonathan I. Kamens, Terrence O Kane, Amir Katz, ken@ken.hilco.com, Kevin B. Kenny, Steve Kirsch, Winfried Koenig, Marq Kole, Ronald Lamprecht, Greg Lee, Rohan Lenard, Craig Leres, John Levine, Steve Liddle, David Loffredo, Mike Long, Mohamed el Lozy, Brian Madsen, Malte, Joe Marshall, Bengt Martensson, Chris Metcalf, Luke Mewburn, Jim Meyering, R. Alexander Milowski, Erik Naggum, G.T. Nicol, Landon Noll, James Nordby, Marc Nozell, Richard Ohnemus, Karsten Pahnke, Sven Panne, Roland Pesch, Walter Pelissero, Gaumond Pierre, Esmond Pitt, Jef Poskanzer, Joe Rahmeh, Jarmo Raiha, Frederic Raimbault, Pat Rankin, Rick Richardson, Kevin Rodgers, Kai Uwe Rommel, Jim Roskind, Alberto Santini, Andreas Scherer, Darrell Schiebel, Raf Schietekat, Doug Schmidt, Philippe Schnoebelen, Andreas Schwab, Larry Schwimmer, Alex Siegel, Eckehard Stolz, Jan-Erik Strvmquist, Mike Stump, Paul Stuart, Dave Tallman, Ian Lance Taylor, Chris Thewalt, Richard M. Timoney, Jodi Tsai, Paul Tuinenga, Gary Weik, Frank Whaley, Gerhard Wilhelms, Kent Williams, Ken Yap, Ron Zellar, Nathan Zelle, David Zuhn, and those whose names have slipped my marginal mail-archiving skills but whose contributions are appreciated all the same.
es: Agradecimientos a los muchos I<flex> beta-testers, feedbackers, y contribuidores, especialmente a Francois Pinard, Casey Leedom, Robert Abramovitz, Stan Adermann, Terry Allen, David Barker-Plummer, John Basrai, Neal Becker, Nelson H.F. Beebe, benson@odi.com, Karl Berry, Peter A. Bigot, Simon Blanchard, Keith Bostic, Frederic Brehm, Ian Brockbank, Kin Cho, Nick Christopher, Brian Clapper, J.T. Conklin, Jason Coughlin, Bill Cox, Nick Cropper, Dave Curtis, Scott David Daniels, Chris G. Demetriou, Theo Deraadt, Mike Donahue, Chuck Doucette, Tom Epperly, Leo Eskin, Chris Faylor, Chris Flatters, Jon Forrest, Jeffrey Friedl, Joe Gayda, Kaveh R. Ghazi, Wolfgang Glunz, Eric Goldman, Christopher M. Gould, Ulrich Grepel, Peer Griebel, Jan Hajic, Charles Hemphill, NORO Hideo, Jarkko Hietaniemi, Scott Hofmann, Jeff Honig, Dana Hudes, Eric Hughes, John Interrante, Ceriel Jacobs, Michal Jaegermann, Sakari Jalovaara, Jeffrey R. Jones, Henry Juengst, Klaus Kaempf, Jonathan I. Kamens, Terrence O Kane, Amir Katz, ken@ken.hilco.com, Kevin B. Kenny, Steve Kirsch, Winfried Koenig, Marq Kole, Ronald Lamprecht, Greg Lee, Rohan Lenard, Craig Leres, John Levine, Steve Liddle, David Loffredo, Mike Long, Mohamed el Lozy, Brian Madsen, Malte, Joe Marshall, Bengt Martensson, Chris Metcalf, Luke Mewburn, Jim Meyering, R. Alexander Milowski, Erik Naggum, G.T. Nicol, Landon Noll, James Nordby, Marc Nozell, Richard Ohnemus, Karsten Pahnke, Sven Panne, Roland Pesch, Walter Pelissero, Gaumond Pierre, Esmond Pitt, Jef Poskanzer, Joe Rahmeh, Jarmo Raiha, Frederic Raimbault, Pat Rankin, Rick Richardson, Kevin Rodgers, Kai Uwe Rommel, Jim Roskind, Alberto Santini, Andreas Scherer, Darrell Schiebel, Raf Schietekat, Doug Schmidt, Philippe Schnoebelen, Andreas Schwab, Larry Schwimmer, Alex Siegel, Eckehard Stolz, Jan-Erik Strvmquist, Mike Stump, Paul Stuart, Dave Tallman, Ian Lance Taylor, Chris Thewalt, Richard M. Timoney, Jodi Tsai, Paul Tuinenga, Gary Weik, Frank Whaley, Gerhard Wilhelms, Kent Williams, Ken Yap, Ron Zellar, Nathan Zelle, David Zuhn, y aquellos cuyos nombres han caído bajo mis escasas dotes de archivador de correo pero cuyas contribuciones son apreciadas todas por igual.

source: Thanks to Keith Bostic, Jon Forrest, Noah Friedman, John Gilmore, Craig Leres, John Levine, Bob Mulcahy, G.T. Nicol, Francois Pinard, Rich Salz, and Richard Stallman for help with various distribution headaches.
es: Agradecimientos a Keith Bostic, Jon Forrest, Noah Friedman, John Gilmore, Craig Leres, John Levine, Bob Mulcahy, G.T. Nicol, Francois Pinard, Rich Salz, y a Richard Stallman por la ayuda con diversos quebraderos de cabeza con la distribución.

source: Thanks to Esmond Pitt and Earle Horton for 8-bit character support; to Benson Margulies and Fred Burke for C++ support; to Kent Williams and Tom Epperly for C++ class support; to Ove Ewerlid for support of NUL's; and to Eric Hughes for support of multiple buffers.
es: Agradecimientos a Esmond Pitt y Earle Horton por el soporte de caracteres de 8-bits; a Benson Margulies y a Fred Burke por el soporte de C++; a Kent Williams y a Tom Epperly por el soporte de la clase de C++; a Ove Ewerlid por el soporte de NUL's; y a Eric Hughes por el soporte de múltiples buffers.

source: This work was primarily done when I was with the Real Time Systems Group at the Lawrence Berkeley Laboratory in Berkeley, CA. Many thanks to all there for the support I received.
es: Este trabajo fue hecho principalmente cuando yo estaba con el Grupo de Sistemas de Tiempo Real en el Lawrence Berkeley Laboratory en Berkeley, CA. Muchas gracias a todos allí por el apoyo que recibí.

source: Send comments to vern@ee.lbl.gov.
es: Enviar comentarios a vern@ee.lbl.gov.
