Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: In the generated scanner, the actions are all gathered in one large switch statement and separated using B<YY_BREAK,> which may be redefined. By default, it is simply a "break", to separate each rule's action from the following rule's. Redefining B<YY_BREAK> allows, for example, C++ users to #define YY_BREAK to do nothing (while being very careful that every rule ends with a "break" or a "return"!) to avoid suffering from unreachable statement warnings where because a rule's action ends with "return", the B<YY_BREAK> is inaccessible.
es: En el analizador generado, las acciones están recogidas en una gran sentencia switch y separadas usando B<YY_BREAK,> que puede ser redefinida. Por defecto, este es símplemente un "break", para separar la acción de cada regla de las reglas que le siguen. Redefiniendo B<YY_BREAK> permite, por ejemplo, a los usuarios de C++ que #define YY_BREAK no haga nada (¡mientras tengan cuidado para que cada regla finalice con un "break" o un "return"!) para evitar que sufran los avisos de sentencias inalcanzables cuando debido a que la acción de la regla finaliza con un "return", el B<YY_BREAK> es inaccesible.

source: VALUES AVAILABLE TO THE USER
es: VALORES DISPONIBLES AL USUARIO

source: This section summarizes the various values available to the user in the rule actions.
es: Esta sección resume los diferentes valores disponibles al usuario en las acciones de la regla.

source: B<char *yytext> holds the text of the current token. It may be modified but not lengthened (you cannot append characters to the end).
es: B<char *yytext> apunta al texto del token actual. Este puede modificarse pero no alargarse (no puede añadir caracteres al final).

source: If the special directive B<%array> appears in the first section of the scanner description, then B<yytext> is instead declared B<char yytext[YYLMAX],> where B<YYLMAX> is a macro definition that you can redefine in the first section if you don't like the default value (generally 8KB). Using B<%array> results in somewhat slower scanners, but the value of B<yytext> becomes immune to calls to I<input()> and I<unput(),> which potentially destroy its value when B<yytext> is a character pointer. The opposite of B<%array> is B<%pointer,> which is the default.
es: Si aparece la directiva especial B<%array> en la primera sección de la descripción del analizador, entonces B<yytext> se declara en su lugar como B<char yytext[YYLMAX],> donde B<YYLMAX> es la definicion de una macro que puede redefinir en la primera sección si no le gusta el valor por defecto (generalmente 8KB). El uso de B<%array> produce analizadores algo más lentos, pero el valor de B<yytext> se vuelve inmune a las llamadas a I<input()> y I<unput(),> que potencialmente destruyen su valor cuando B<yytext> es un puntero a caracter. El opuesto de B<%array> es B<%pointer,> que se encuentra por defecto.

source: You cannot use B<%array> when generating C++ scanner classes (the B<-+> flag).
es: Usted no puede utilizar B<%array> cuando genera analizadores como clases de C++ (la bandera B<-+> ).

source: B<int yyleng> holds the length of the current token.
es: B<int yyleng> contiene la longitud del token actual.

source: B<FILE *yyin> is the file which by default I<flex> reads from. It may be redefined but doing so only makes sense before scanning begins or after an EOF has been encountered. Changing it in the midst of scanning will have unexpected results since I<flex> buffers its input; use B<yyrestart()> instead. Once scanning terminates because an end-of-file has been seen, you can assign I<yyin> at the new input file and then call the scanner again to continue scanning.
es: B<FILE *yyin> es el fichero por el que I<flex> lee por defecto. Este podría redefinirse pero hacerlo solo tiene sentido antes de que el análisis comience o después de que se haya encontrado un EOF. Cambiándolo en medio del análisis tendrá resultados inesperados ya que I<flex> utiliza buffers en su entrada; use B<yyrestart()> en su lugar. Una vez que el análisis termina debido a que se ha visto un fin-de-fichero, puede asignarle a I<yyin> el nuevo fichero de entrada y entonces llamar al analizador de nuevo para continuar analizando.

source: B<void yyrestart( FILE *new_file )> may be called to point I<yyin> at the new input file. The switch-over to the new file is immediate (any previously buffered-up input is lost). Note that calling B<yyrestart()> with I<yyin> as an argument thus throws away the current input buffer and continues scanning the same input file.
es: B<void yyrestart( FILE *new_file )> podría ser llamada para que I<yyin> apunte al nuevo fichero de entrada. El cambio al nuevo fichero es inmediato (cualquier entrada contenida en el buffer previamente se pierde). Fíjese que llamando a B<yyrestart()> con I<yyin> como argumento de esta manera elimina el buffer de entradda actual y continúa analizando el mismo fichero de entrada.

source: B<FILE *yyout> is the file to which B<ECHO> actions are done. It can be reassigned by the user.
es: B<FILE *yyout> es el fichero sobre el que se hacen las acciones B<ECHO.> Este puede ser reasignado por el usuario.

source: B<YY_CURRENT_BUFFER> returns a B<YY_BUFFER_STATE> handle to the current buffer.
es: B<YY_CURRENT_BUFFER> devuelve un handle B<YY_BUFFER_STATE> al buffer actual.

source: B<YY_START> returns an integer value corresponding to the current start condition. You can subsequently use this value with B<BEGIN> to return to that start condition.
es: B<YY_START> devuelve un valor entero correspondiente a la condición de arranque actual. Posteriormente puede usar este valor con B<BEGIN> para retornar a la condición de arranque.

source: INTERFACING WITH YACC
es: INTERFAZ CON YACC

source: One of the main uses of I<flex> is as a companion to the I<yacc> parser-generator. I<yacc> parsers expect to call a routine named B<yylex()> to find the next input token. The routine is supposed to return the type of the next token as well as putting any associated value in the global B<yylval.> To use I<flex> with I<yacc,> one specifies the B<-d> option to I<yacc> to instruct it to generate the file B<y.tab.h> containing definitions of all the B<%tokens> appearing in the I<yacc> input. This file is then included in the I<flex> scanner. For example, if one of the tokens is "TOK_NUMBER", part of the scanner might look like:
es: Uno de los usos principales de I<flex> es como compañero del generador de analizadores sintácticos I<yacc.> Los analizadores de I<yacc> esperan invocar a una rutina llamada B<yylex()> para encontrar el próximo token de entrada. La rutina se supone que devuelve el tipo del próximo token además de poner cualquier valor asociado en la variable global B<yylval.> Para usar I<flex> con I<yacc,> uno especifica la opción B<-d> de I<yacc> para intruirle a que genere el fichero B<y.tab.h> que contiene las definiciones de todos los B<%tokens> que aparecen en la entrada de I<yacc.> Entonces este archivo se incluye en el analizador de I<flex> Por ejemplo, si uno de los tokens es "TOK_NUMERO", parte del analizador podría parecerse a:

source: OPTIONS
es: OPCIONES

source: I<flex> has the following options:
es: I<flex> tiene las siguientes opciones:

source: Generate backing-up information to I<lex.backup.> This is a list of scanner states which require backing up and the input characters on which they do so. By adding rules one can remove backing-up states. If I<all> backing-up states are eliminated and B<-Cf> or B<-CF> is used, the generated scanner will run faster (see the B<-p> flag). Only users who wish to squeeze every last cycle out of their scanners need worry about this option. (See the section on Performance Considerations below.)
es: Genera información de retroceso en I<lex.backup.> Esta es una lista de estados del analizador que requieren retroceso y los caracteres de entrada con los que la hace. Añadiendo reglas uno puede eliminar estados de retroceso. Si I<todos> los estados de retroceso se eliminan y se usa B<-Cf> o B<-CF,> el analizador generado funcionará más rápido (ver la bandera B<-p).> Únicamente los usuarios que desean exprimir hasta el último ciclo de sus analizadores necesitan preocuparse de esta opción. (Ver la sección sobre Consideraciones de Rendimiento más abajo.)

source: is a do-nothing, deprecated option included for POSIX compliance.
es: es una opción que no hace nada, incluída para cumplir con POSIX.

source: makes the generated scanner run in I<debug> mode. Whenever a pattern is recognized and the global B<yy_flex_debug> is non-zero (which is the default), the scanner will write to I<stderr> a line of the form:
es: hace que el analizador generado se ejecute en modo de I<depuración.> Siempre que se reconoce un patrón y la variable global B<yy_flex_debug> no es cero (que por defecto no lo es), el analizador escribirá en I<stderr> una línea de la forma:

source: --accepting rule at line 53 ("the matched text")
es: --accepting rule at line 53 ("el texto emparejado")

source: The line number refers to the location of the rule in the file defining the scanner (i.e., the file that was fed to flex). Messages are also generated when the scanner backs up, accepts the default rule, reaches the end of its input buffer (or encounters a NUL; at this point, the two look the same as far as the scanner's concerned), or reaches an end-of-file.
es: El número de línea hace referencia al lugar de la regla en el fichero que define al analizador (es decir, el fichero que se le introdujo a flex). Los mensajes también se generan cuando el analizador retrocede, acepta la regla por defecto, alcanza el final de su buffer de entrada (o encuentra un NUL; en este punto, los dos parecen lo mismo en lo que le concierne al analizador), o alcance el fin-de-fichero.

source: specifies I<fast scanner.> No table compression is done and stdio is bypassed. The result is large but fast. This option is equivalent to B<-Cfr> (see below).
es: especifica un I<analizador rápido.> No se realiza una compresión de tablas y se evita el uso de stdio. El resultado es grande pero rápido. Esta opción es equivalente a B<-Cfr> (ver más abajo).

source: generates a "help" summary of I<flex's> options to I<stdout> and then exits. B<-?> and B<--help> are synonyms for B<-h.>
es: genera un sumario de "ayuda" de las opciones de I<flex> por I<stdout> y entonces finaliza. B<-?> y B<--help> son sinónimos de B<-h.>

source: instructs I<flex> to generate a I<case-insensitive> scanner. The case of letters given in the I<flex> input patterns will be ignored, and tokens in the input will be matched regardless of case. The matched text given in I<yytext> will have the preserved case (i.e., it will not be folded).
es: indica a I<flex> que genere un analizador I<case-insensitive.> Se ignorará si las letras en los patrones de entrada de I<flex> son en mayúsculas o en minúsculas, y los tokens en la entrada serán emparejados sin tenerlo en cuenta. El texto emparejado dado en I<yytext> tendrá las mayúsculas y minúsculas preservadas (es decir, no se convertirán).

source: turns on maximum compatibility with the original AT&T I<lex> implementation. Note that this does not mean I<full> compatibility. Use of this option costs a considerable amount of performance, and it cannot be used with the B<-+, -f, -F, -Cf,> or B<-CF> options. For details on the compatibilities it provides, see the section "Incompatibilities With Lex And POSIX" below. This option also results in the name B<YY_FLEX_LEX_COMPAT> being #define'd in the generated scanner.
es: activa el modo de máxima compatibilidad con la implementación original de I<lex> de AT&T. Fíjese que esto no significa una compatibilidad I<completa.> El uso de esta opción cuesta una cantidad considerable de rendimiento, y no puede usarse con las opciones B<-+, -f, -F, -Cf,> o B<-CF.> Para los detalles a cerca de la compatibilidad que se ofrece, vea la sección "Incompatibilidades con Lex y POSIX" más abajo. Esta opción también hace que se defina el nombre B<YY_FLEX_LEX_COMPAT> en el analizador generado.

source: is another do-nothing, deprecated option included only for POSIX compliance.
es: es otra opción que no hace nada, incluída para cumplir con POSIX.

source: generates a performance report to stderr. The report consists of comments regarding features of the I<flex> input file which will cause a serious loss of performance in the resulting scanner. If you give the flag twice, you will also get comments regarding features that lead to minor performance losses.
es: genera un informe de rendimiento en stderr. El informe consta de comentarios que tratan de las propiedades del fichero de entrada de I<flex> que provocarán pérdidas serias de rendimiento en el analizador resultante. Si indica esta bandera dos veces, también obtendrá comentarios que tratan de las propiedades que producen pérdidas menores de rendimiento.

source: Note that the use of B<REJECT,> B<%option yylineno,> and variable trailing context (see the Deficiencies / Bugs section below) entails a substantial performance penalty; use of I<yymore(),> the B<^> operator, and the B<-I> flag entail minor performance penalties.
es: Fíjese que el uso de B<REJECT,> B<%option yylineno,> y el contexto posterior variable (vea la sección Deficiencias / Errores más abajo) supone una penalización substancial del rendimiento; el uso de I<yymore(),> el operador B<^,> y la bandera B<-I> supone penalizaciones del rendimiento menores.

source: causes the I<default rule> (that unmatched scanner input is echoed to I<stdout)> to be suppressed. If the scanner encounters input that does not match any of its rules, it aborts with an error. This option is useful for finding holes in a scanner's rule set.
es: hace que la I<regla por defecto> (que la entrada sin emparejar del analizador se repita por I<stdout)> se suprima. Si el analizador encuentra entrada que no es reconocida por ninguna de sus reglas, este aborta con un error. Esta opción es útil para encontrar agujeros en el conjunto de reglas del analizador.

source: instructs I<flex> to write the scanner it generates to standard output instead of B<lex.yy.c.>
es: indica a I<flex> que escriba el analizador que genera a la salida estándar en lugar de en B<lex.yy.c.>

source: specifies that I<flex> should write to I<stderr> a summary of statistics regarding the scanner it generates. Most of the statistics are meaningless to the casual I<flex> user, but the first line identifies the version of I<flex> (same as reported by B<-V),> and the next line the flags used when generating the scanner, including those that are on by default.
es: especifica que I<flex> debería escribir en I<stderr> un sumario de estadísticas respecto al analizador que genera. La mayoría de las estadísticas no tienen significado para el usuario casual de I<flex,> pero la primera línea identifica la versión de I<flex> (la misma que se informa con B<-V),> y la próxima línea las banderas utilizadas cuando se genera el analizador, incluyendo aquellas que se encuentran activadas por defecto.

source: suppresses warning messages.
es: suprime los mensajes de aviso.

source: instructs I<flex> to generate a I<batch> scanner, the opposite of I<interactive> scanners generated by B<-I> (see below). In general, you use B<-B> when you are I<certain> that your scanner will never be used interactively, and you want to squeeze a I<little> more performance out of it. If your goal is instead to squeeze out a I<lot> more performance, you should be using the B<-Cf> or B<-CF> options (discussed below), which turn on B<-B> automatically anyway.
es: dice a I<flex> que genere un analizador I<batch,> que es lo opuesto al analizador I<interactivo> generador por B<-I> (ver más abajo). En general, use B<-B> cuando esté I<seguro> de que su analizador nunca se usará de forma interactiva, y quiere con esto exprimir un I<poco> más el rendimiento. Si por el contrario su objetivo es exprimirlo I<mucho> más, debería estar utilizando la opción B<-Cf> o B<-CF> (comentadas más abajo), que activa B<-B> automáticamente de todas maneras.

source: specifies that the
es: especifica que se debe utilizar la representación de la tabla

source: fast scanner table representation should be used (and stdio bypassed). This representation is about as fast as the full table representation B<(-f),> and for some sets of patterns will be considerably smaller (and for others, larger). In general, if the pattern set contains both "keywords" and a catch-all, "identifier" rule, such as in the set:
es: rápida (y elimina referencias a stdio). Esta representación es aproximadamente tan rápida como la representación completa de la tabla B<(-f),> y para algunos conjuntos de patrones será considerablemente más pequeña (y para otros, mayor). En general, si el conjunto de patrones contiene "palabras clave" y una regla "identificador" atrápalo-todo, como la del conjunto:

source: then you're better off using the full table representation. If only the "identifier" rule is present and you then use a hash table or some such to detect the keywords, you're better off using B<-F.>
es: entonces será mejor que utilice la representación de la tabla completa. Si sólo está presente la regla "identificador" y utiliza una tabla hash o algo parecido para detectar palabras clave, mejor utilice B<-F.>

source: This option is equivalent to B<-CFr> (see below). It cannot be used with B<-+.>
es: Esta opción es equivalente a B<-CFr> (ver más abajo). Esta opción no puede utilizarse con B<-+.>

source: instructs I<flex> to generate an I<interactive> scanner. An interactive scanner is one that only looks ahead to decide what token has been matched if it absolutely must. It turns out that always looking one extra character ahead, even if the scanner has already seen enough text to disambiguate the current token, is a bit faster than only looking ahead when necessary. But scanners that always look ahead give dreadful interactive performance; for example, when a user types a newline, it is not recognized as a newline token until they enter I<another> token, which often means typing in another whole line.
es: ordena a I<flex> que genere un analizador I<interactivo> Un analizador interactivo es uno que solo mira hacia delante para decidir que token ha sido reconocido únicamente si debe hacerlo. Resulta que mirando siempre un caracter extra hacia delante, incluso si el analizador ya ha visto suficiente texto para eliminar la ambigüedad del token actual, se es un poco más rápido que mirando solamente cuando es necesario. Pero los analizadores que siempre miran hacia delante producen un comportamiento interactivo malísimo; por ejemplo, cuando un usuario teclea una línea nueva, esta no se reconoce como un token de línea nueva hasta que introduzca I<otro> token, que a menudo significa introducir otra línea completa.

source: I<Flex> scanners default to I<interactive> unless you use the B<-Cf> or B<-CF> table-compression options (see below). That's because if you're looking for high-performance you should be using one of these options, so if you didn't, I<flex> assumes you'd rather trade off a bit of run-time performance for intuitive interactive behavior. Note also that you I<cannot> use B<-I> in conjunction with B<-Cf> or B<-CF.> Thus, this option is not really needed; it is on by default for all those cases in which it is allowed.
es: Los analizadores de I<flex> por defecto son I<interactivos> a menos que use la opción B<-Cf> o B<-CF> de compresión de tablas (ver más abajo). Esto es debido a que si está buscando un rendimiento alto tendría que estar utilizando una de estas opciones, así que si no lo ha hecho I<flex> asume que prefiere cambiar un poco de rendimiento en tiempo de ejecución en beneficio de un comportamiento iteractivo intuitivo. Fíjese también que I<no puede> utilizar B<-I> conjuntamente con B<-Cf> o B<-CF.> Así, esta opción no se necesita realmente; está activa por defecto para todos esos casos en los que se permite.

source: You can force a scanner to I<not> be interactive by using B<-B> (see above).
es: Usted puede forzar al analizador que I<no> sea interactivo usando B<-B> (ver más arriba).

source: instructs I<flex> not to generate B<#line> directives. Without this option, I<flex> peppers the generated scanner with #line directives so error messages in the actions will be correctly located with respect to either the original I<flex> input file (if the errors are due to code in the input file), or B<lex.yy.c> (if the errors are I<flex's> fault -- you should report these sorts of errors to the email address given below).
es: ordena a I<flex> que no genere directivas B<#line.> Sin esta opción, I<flex> acribilla al analizador generado con directivas #line para que los mensajes de error en las acciones estén localizadas correctamente respecto al fichero original de I<flex> (si los errores son debidos al código en el fichero de entrada), o a B<lex.yy.c> (si los errores son fallos de I<flex> -- debería informar de este tipo de errores a la dirección de correo dada más abajo).

source: makes I<flex> run in I<trace> mode. It will generate a lot of messages to I<stderr> concerning the form of the input and the resultant non-deterministic and deterministic finite automata. This option is mostly for use in maintaining I<flex.>
es: hace que I<flex> se ejecute en modo de I<traza.> Este generará un montón de mensajes en I<stderr> relativos a la forma de la entrada y el autómata finito no-determinista o determinista resultante. Esta opción generalmente es para usarla en el mantenimiento de I<flex.>

source: prints the version number to I<stdout> and exits. B<--version> is a synonym for B<-V.>
es: imprime el número de la versión en I<stdout> y sale. B<--version> es un sinónimo de B<-V.>

source: instructs I<flex> to generate a 7-bit scanner, i.e., one which can only recognized 7-bit characters in its input. The advantage of using B<-7> is that the scanner's tables can be up to half the size of those generated using the B<-8> option (see below). The disadvantage is that such scanners often hang or crash if their input contains an 8-bit character.
es: ordena a I<flex> que genere un analizador de 7-bits, es decir, uno que sólo puede reconocer caracteres de 7-bits en su entrada. La ventaja de usar B<-7> es que las tablas del analizador pueden ser hasta la mitad del tamaño de aquellas generadas usando la opción B<-8> (ver más abajo). La desventaja es que tales analizadores a menudo se cuelgan o revientan si su entrada contiene caracteres de 8-bits.
