Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: In addition to characters and ranges of characters, character classes can also contain character class I<expressions.> These are expressions enclosed inside B<[:> and B<:]> delimiters (which themselves must appear between the '[' and ']' of the character class; other elements may occur inside the character class, too). The valid expressions are:
es: Además de caracteres y rangos de caracteres, las clases de caracteres pueden también contener I<expresiones> de clases de caracteres. Son expresiones encerradas entre los delimitadores B<[:> y B<:]> (que también deben aparecer entre el '[' y el ']' de la clase de caracteres; además pueden darse otros elementos dentro de la clase de caracteres). Las expresiones válidas son:

source: These expressions all designate a set of characters equivalent to the corresponding standard C B<isXXX> function. For example, B<[:alnum:]> designates those characters for which B<isalnum()> returns true - i.e., any alphabetic or numeric. Some systems don't provide B<isblank(),> so flex defines B<[:blank:]> as a blank or a tab.
es: Todas estas expresiones designan un conjunto de caracteres equivalentes a la correspondiente función estándar B<isXXX> de C. Por ejemplo, B<[:alnum:]> designa aquellos caracteres para los cuales B<isalnum()> devuelve verdadero - esto es, cualquier caracter alfabético o numérico. Algunos sistemas no ofrecen B<isblank(),> así que flex define B<[:blank:]> como un espacio en blanco o un tabulador.

source: For example, the following character classes are all equivalent:
es: Por ejemplo, las siguientes clases de caracteres son todas equivalentes:

source: If your scanner is case-insensitive (the B<-i> flag), then B<[:upper:]> and B<[:lower:]> are equivalent to B<[:alpha:].>
es: Si su escáner ignora la distinción entre mayúsculas y minúsculas (la bandera B<-i> ), entonces B<[:upper:]> y B<[:lower:]> son equivalentes a B<[:alpha:].>

source: Some notes on patterns:
es: Algunas notas sobre los patrones:

source: A negated character class such as the example "[^A-Z]" above I<will match a newline> unless "\en" (or an equivalent escape sequence) is one of the characters explicitly present in the negated character class (e.g., "[^A-Z\en]"). This is unlike how many other regular expression tools treat negated character classes, but unfortunately the inconsistency is historically entrenched. Matching newlines means that a pattern like [^"]* can match the entire input unless there's another quote in the input.
es: Una clase de caracteres negada tal como el ejemplo "[^A-Z]" anterior I<emparejará una línea nueva> a menos que "\en" (o una secuencia de escape equivalente) sea uno de los caracteres presentes explícitamente en la clase de caracteres negada (p.ej., "[^A-Z\en]"). Esto es diferente a cómo muchas de las otras herramientas de expresiones regulares tratan las clases de caracteres negadas, pero desafortunadamente la inconsistencia está fervientemente enrraizada históricamente. Emparejar líneas nuevas significa que un patrón como [^"]* puede emparejar la entrada completa a menos que haya otra comilla en la entrada.

source: A rule can have at most one instance of trailing context (the '/' operator or the '$' operator). The start condition, '^', and "E<lt>E<lt>EOFE<gt>E<gt>" patterns can only occur at the beginning of a pattern, and, as well as with '/' and '$', cannot be grouped inside parentheses. A '^' which does not occur at the beginning of a rule or a '$' which does not occur at the end of a rule loses its special properties and is treated as a normal character.
es: Una regla puede tener lo más una instancia del contexto posterior (el operador '/' o el operador '$'). La condición de arranque, los patrones '^', y "E<lt>E<lt>EOFE<gt>E<gt>" pueden aparecer solamente al principio de un patrón, y, al igual que con '/' y '$', no pueden agruparse dentro de paréntesis. Un '^' que no aparezca al principio de una regla o un '$' que no aparezca al final de una regla pierde sus propiedades especiales y es tratado como un caracter normal.

source: The following are illegal:
es: Lo siguiente no está permitido:

source: Note that the first of these, can be written "foo/bar\en".
es: Fíjese que la primera regla se puede escribir como "foo/bar\en".

source: The following will result in '$' or '^' being treated as a normal character:
es: En el siguiente ejemplo un '$' o un '^' es tratado como un caracter normal:

source: If what's wanted is a "foo" or a bar-followed-by-a-newline, the following could be used (the special '|' action is explained below):
es: Si lo que se desea es un "foo" o un "bar" seguido de una línea nueva, puede usarse lo siguiente (la acción especial '|' se explica más abajo):

source: foo | bar$ /* action goes here */
es: foo | bar$ /* la acción va aquí */

source: A similar trick will work for matching a foo or a bar-at-the-beginning-of-a-line.
es: Un truco parecido funcionará para emparejar un "foo" o, un "bar" al principio de una línea.

source: HOW THE INPUT IS MATCHED
es: CÓMO SE EMPAREJA LA ENTRADA

source: When the generated scanner is run, it analyzes its input looking for strings which match any of its patterns. If it finds more than one match, it takes the one matching the most text (for trailing context rules, this includes the length of the trailing part, even though it will then be returned to the input). If it finds two or more matches of the same length, the rule listed first in the I<flex> input file is chosen.
es: Cuando el escáner generado está funcionando, este analiza su entrada buscando cadenas que concuerden con cualquiera de sus patrones. Si encuentra más de un emparejamiento, toma el que empareje más texto (para reglas de contexto posterior, se incluye la longitud de la parte posterior, incluso si se devuelve a la entrada). Si encuentra dos o más emparejamientos de la misma longitud, se escoge la regla listada en primer lugar en el fichero de entrada de I<flex>.

source: Once the match is determined, the text corresponding to the match (called the I<token)> is made available in the global character pointer B<yytext,> and its length in the global integer B<yyleng.> The I<action> corresponding to the matched pattern is then executed (a more detailed description of actions follows), and then the remaining input is scanned for another match.
es: Una vez que se determina el emparejamiento, el texto correspondiente al emparejamiento (denominado el I<token)> está disponible en el puntero a caracter global B<yytext,> y su longitud en la variable global entera B<yyleng.> Entonces la I<acción> correspondiente al patrón emparejado se ejecuta (una descripción más detallada de las acciones viene a continuación), y entonces la entrada restante se analiza para otro emparejamiento.

source: If no match is found, then the I<default rule> is executed: the next character in the input is considered matched and copied to the standard output. Thus, the simplest legal I<flex> input is:
es: Si no se encuentra un emparejamiento, entonces se ejecuta la I<regla por defecto>: el siguiente caracter en la entrada se considera reconocido y se copia a la salida estándar. Así, la entrada válida más simple de I<flex> es:

source: which generates a scanner that simply copies its input (one character at a time) to its output.
es: que genera un escáner que simplemente copia su entrada (un caracter a la vez) a la salida.

source: Note that B<yytext> can be defined in two different ways: either as a character I<pointer> or as a character I<array.> You can control which definition I<flex> uses by including one of the special directives B<%pointer> or B<%array> in the first (definitions) section of your flex input. The default is B<%pointer,> unless you use the B<-l> lex compatibility option, in which case B<yytext> will be an array. The advantage of using B<%pointer> is substantially faster scanning and no buffer overflow when matching very large tokens (unless you run out of dynamic memory). The disadvantage is that you are restricted in how your actions can modify B<yytext> (see the next section), and calls to the B<unput()> function destroys the present contents of B<yytext,> which can be a considerable porting headache when moving between different I<lex> versions.
es: Fíjese que B<yytext> se puede definir de dos maneras diferentes: bien como un I<puntero> a caracter o como un I<array> de caracteres. Usted puede controlar la definición que usa I<flex> incluyendo una de las directivas especiales B<%pointer> o B<%array> en la primera sección (definiciones) de su entrada de flex. Por defecto es B<%pointer,> a menos que use la opción de compatibilidad B<-l>, en cuyo caso B<yytext> será un array. La ventaja de usar B<%pointer> es un análisis substancialmente más rápido y la ausencia de desbordamiento del buffer cuando se emparejen tokens muy grandes (a menos que se agote la memoria dinámica). La desventaja es que se encuentra restringido en cómo sus acciones pueden modificar B<yytext> (vea la siguiente sección), y las llamadas a la función B<unput()> destruyen el contenido actual de B<yytext>, que puede convertirse en un considerable quebradero de cabeza de portabilidad al cambiar entre diferentes versiones de I<lex>.

source: The advantage of B<%array> is that you can then modify B<yytext> to your heart's content, and calls to B<unput()> do not destroy B<yytext> (see below). Furthermore, existing I<lex> programs sometimes access B<yytext> externally using declarations of the form:
es: La ventaja de B<%array> es que entoces puede modificar B<yytext> todo lo que usted quiera, las llamadas a B<unput()> no destruyen B<yytext> (ver más abajo). Además, los programas de I<lex> existentes a veces acceden a B<yytext> externamente utilizando declaraciones de la forma:

source: This definition is erroneous when used with B<%pointer,> but correct for B<%array.>
es: Esta definición es errónea cuando se utiliza B<%pointer,> pero correcta para B<%array.>

source: B<%array> defines B<yytext> to be an array of B<YYLMAX> characters, which defaults to a fairly large value. You can change the size by simply #define'ing B<YYLMAX> to a different value in the first section of your I<flex> input. As mentioned above, with B<%pointer> yytext grows dynamically to accommodate large tokens. While this means your B<%pointer> scanner can accommodate very large tokens (such as matching entire blocks of comments), bear in mind that each time the scanner must resize B<yytext> it also must rescan the entire token from the beginning, so matching such tokens can prove slow. B<yytext> presently does I<not> dynamically grow if a call to B<unput()> results in too much text being pushed back; instead, a run-time error results.
es: B<%array> define a B<yytext> como un array de B<YYLMAX> caracteres, que por defecto es un valor bastante grande. Usted puede cambiar el tamaño símplemente definiendo con #define a B<YYLMAX> con un valor diferente en la primera sección de su entrada de I<flex.> Como se mencionó antes, con B<%pointer> yytext crece dinámicamente para acomodar tokens grandes. Aunque esto signifique que con B<%pointer> su escáner puede acomodar tokens muy grandes (tales como emparejar bloques enteros de comentarios), tenga presente que cada vez que el escáner deba cambiar el tamaño de B<yytext> también debe reiniciar el análisis del token entero desde el principio, así que emparejar tales tokens puede resultar lento. Ahora B<yytext> I<no> crece dinámicamente si una llamada a B<unput()> hace que se deba devolver demasiado texto; en su lugar, se produce un error en tiempo de ejecución.

source: Also note that you cannot use B<%array> with C++ scanner classes (the B<c++> option; see below).
es: También tenga en cuenta que no puede usar B<%array> en los analizadores generados como clases de C++ (la opción B<c++>; vea más abajo).

source: ACTIONS
es: ACCIONES

source: Each pattern in a rule has a corresponding action, which can be any arbitrary C statement. The pattern ends at the first non-escaped whitespace character; the remainder of the line is its action. If the action is empty, then when the pattern is matched the input token is simply discarded. For example, here is the specification for a program which deletes all occurrences of "zap me" from its input:
es: Cada patrón en una regla tiene una acción asociada, que puede ser cualquier sentencia en C. El patrón finaliza en el primer caracter de espacio en blanco que no sea una secuencia de escape; lo que queda de la línea es su acción. Si la acción está vacía, entonces cuando el patrón se empareje el token de entrada simplemente se descarta. Por ejemplo, aquí está la especificación de un programa que borra todas las apariciones de "zap me" en su entrada:

source: (It will copy all other characters in the input to the output since they will be matched by the default rule.)
es: (Este copiará el resto de caracteres de la entrada a la salida ya que serán emparejados por la regla por defecto.)

source: Here is a program which compresses multiple blanks and tabs down to a single blank, and throws away whitespace found at the end of a line:
es: Aquí hay un programa que comprime varios espacios en blanco y tabuladores a un solo espacio en blanco, y desecha los espacios que se encuentren al final de una línea:

source: %% [ \et]+ putchar( ' ' ); [ \et]+$ /* ignore this token */
es: %% [ \et]+ putchar( ' ' ); [ \et]+$ /* ignora este token */

source: If the action contains a '{', then the action spans till the balancing '}' is found, and the action may cross multiple lines. I<flex> knows about C strings and comments and won't be fooled by braces found within them, but also allows actions to begin with B<%{> and will consider the action to be all the text up to the next B<%}> (regardless of ordinary braces inside the action).
es: Si la acción contiene un '{', entonces la acción abarca hasta que se encuentre el correspondiente '}', y la acción podría entonces cruzar varias líneas. I<flex> es capaz de reconocer las cadenas y comentarios de C y no se dejará engañar por las llaves que encuentre dentro de estos, pero aun así también permite que las acciones comiencen con B<%{> y considerará que la acción es todo el texto hasta el siguiente B<%}> (sin tener en cuenta las llaves ordinarias dentro de la acción).

source: An action consisting solely of a vertical bar ('|') means "same as the action for the next rule." See below for an illustration.
es: Una acción que consista sólamente de una barra vertical ('|') significa "lo mismo que la acción para la siguiente regla." Vea más abajo para una ilustración.

source: Actions can include arbitrary C code, including B<return> statements to return a value to whatever routine called B<yylex().> Each time B<yylex()> is called it continues processing tokens from where it last left off until it either reaches the end of the file or executes a return.
es: Las acciones pueden incluir código C arbitrario, incuyendo sentencias B<return> para devolver un valor desde cualquier rutina llamada B<yylex().> Cada vez que se llama a B<yylex()> esta continúa procesando tokens desde donde lo dejó la última vez hasta que o bien llegue al final del fichero o ejecute un return.

source: Actions are free to modify B<yytext> except for lengthening it (adding characters to its end--these will overwrite later characters in the input stream). This however does not apply when using B<%array> (see above); in that case, B<yytext> may be freely modified in any way.
es: Las acciones tienen libertad para modificar B<yytext> excepto para alargarla (añadiendo caracteres al final--esto sobreescribirá más tarde caracteres en el flujo de entrada). Sin embargo esto no se aplica cuando se utiliza B<%array> (ver arriba); en ese caso, B<yytext> podría modificarse libremente de cualquier manera.

source: Actions are free to modify B<yyleng> except they should not do so if the action also includes use of B<yymore()> (see below).
es: Las acciones tienen libertad para modificar B<yyleng> excepto que estas no deberían hacerlo si la acción también incluye el uso de B<yymore()> (ver más abajo).

source: There are a number of special directives which can be included within an action:
es: Hay un número de directivas especiales que pueden incluirse dentro de una acción:

source: B<ECHO> copies yytext to the scanner's output.
es: B<ECHO> copia yytext a la salida del escáner.

source: B<BEGIN> followed by the name of a start condition places the scanner in the corresponding start condition (see below).
es: B<BEGIN> seguido del nombre de la condición de arranque pone al escáner en la condición de arranque correspondiente (ver más abajo).

source: B<REJECT> directs the scanner to proceed on to the "second best" rule which matched the input (or a prefix of the input). The rule is chosen as described above in "How the Input is Matched", and B<yytext> and B<yyleng> set up appropriately. It may either be one which matched as much text as the originally chosen rule but came later in the I<flex> input file, or one which matched less text. For example, the following will both count the words in the input and call the routine special() whenever "frob" is seen:
es: B<REJECT> ordena al escáner a que proceda con la "segunda mejor" regla que concuerde con la entrada (o un prefijo de la entrada). La regla se escoge como se describió anteriormente en "Cómo se Empareja la Entrada", y B<yytext> e B<yyleng> se ajustan de forma apropiada. Podría ser una que empareje tanto texto como la regla escogida originalmente pero que viene más tarde en el fichero de entrada de I<flex,> o una que empareje menos texto. Por ejemplo, lo que viene a continuación contará las palabras en la entrada y llamará a la rutina especial() siempre que vea "frob":

source: int word_count = 0; %%
es: int contador_palabras = 0; %%

source: frob special(); REJECT; [^ \et\en]+ ++word_count;
es: frob especial(); REJECT; [^ \et\en]+ ++contador_palabras;

source: Without the B<REJECT,> any "frob"'s in the input would not be counted as words, since the scanner normally executes only one action per token. Multiple B<REJECT's> are allowed, each one finding the next best choice to the currently active rule. For example, when the following scanner scans the token "abcd", it will write "abcdabcaba" to the output:
es: Sin el B<REJECT,> cualquier número de "frob"'s en la entrada no serían contados como palabras, ya que el escáner normalmente ejecuta solo una acción por token. Se permite el uso de múltiples B<REJECT's,> cada uno buscando la siguiente mejor elección a la regla que actualmente esté activa. Por ejemplo, cuando el siguiente escáner analice el token "abcd", este escribirá "abcdabcaba" a la salida:

source: %% a | ab | abc | abcd ECHO; REJECT; .|\en /* eat up any unmatched character */
es: %% a | ab | abc | abcd ECHO; REJECT; .|\en /* se come caracteres sin emparejar */

source: (The first three rules share the fourth's action since they use the special '|' action.) B<REJECT> is a particularly expensive feature in terms of scanner performance; if it is used in I<any> of the scanner's actions it will slow down I<all> of the scanner's matching. Furthermore, B<REJECT> cannot be used with the I<-Cf> or I<-CF> options (see below).
es: (Las primeras tres reglas comparten la acción de la cuarta ya que estas usan la acción especial '|'.) B<REJECT> es una propiedad particularmente cara en términos de rendimiento del escáner; si se usa en I<cualquiera> de las acciones del escáner esta ralentizará I<todo> el proceso de emparejamiento del escáner. Además, B<REJECT> no puede usarse con las opciones I<-Cf> o I<-CF> (ver más abajo).

source: Note also that unlike the other special actions, B<REJECT> is a I<branch;> code immediately following it in the action will I<not> be executed.
es: Fíjese también que a diferencia de las otras acciones especiales, B<REJECT> es una I<bifurcación;> el código que la siga inmediatamente en la acción I<no> será ejecutado.

source: B<yymore()> tells the scanner that the next time it matches a rule, the corresponding token should be I<appended> onto the current value of B<yytext> rather than replacing it. For example, given the input "mega-kludge" the following will write "mega-mega-kludge" to the output:
es: B<yymore()> dice al escáner que la próxima vez que empareje una regla, el token correspondiente debe ser I<añadido> tras el valor actual de B<yytext> en lugar de reemplazarlo. Por ejemplo, dada la entrada "mega-klugde" lo que viene a continuación escribirá "mega-mega-kludge" a la salida:

source: First "mega-" is matched and echoed to the output. Then "kludge" is matched, but the previous "mega-" is still hanging around at the beginning of B<yytext> so the B<ECHO> for the "kludge" rule will actually write "mega-kludge".
es: El primer "mega-" se empareja y se repite a la salida. Entonces se empareja "kludge", pero el "mega-" previo aún está esperando al inicio de B<yytext> asi que el B<ECHO> para la regla del "kludge" realmente escribirá "mega-kludge".

source: Two notes regarding use of B<yymore().> First, B<yymore()> depends on the value of I<yyleng> correctly reflecting the size of the current token, so you must not modify I<yyleng> if you are using B<yymore().> Second, the presence of B<yymore()> in the scanner's action entails a minor performance penalty in the scanner's matching speed.
es: Dos notas respecto al uso de B<yymore().> Primero, B<yymore()> depende de que el valor de I<yyleng> refleje correctamente el tamaño del token actual, así que no debe modificar I<yyleng> si está utilizando B<yymore().> Segundo, la presencia de B<yymore()> en la acción del escáner implica una pequeña penalización de rendimiento en la velocidad de emparejamiento del escáner.

source: B<yyless(n)> returns all but the first I<n> characters of the current token back to the input stream, where they will be rescanned when the scanner looks for the next match. B<yytext> and B<yyleng> are adjusted appropriately (e.g., B<yyleng> will now be equal to I<n> ). For example, on the input "foobar" the following will write out "foobarbar":
es: B<yyless(n)> devuelve todos excepto los primeros I<n> caracteres del token actual de nuevo al flujo de entrada, donde serán reanalizados cuando el escáner busque el siguiente emparejamiento. B<yytext> e B<yyleng> se ajustan de forma adecuada (p.ej., B<yyleng> no será igual a I<n> ). Por ejemplo, con la entrada "foobar" lo que viene a continuación escribirá "foobarbar":

source: An argument of 0 to B<yyless> will cause the entire current input string to be scanned again. Unless you've changed how the scanner will subsequently process its input (using B<BEGIN,> for example), this will result in an endless loop.
es: Un argumento de 0 para B<yyless> hará que la cadena de entrada actual sea analizada por completo de nuevo. A menos que haya cambiado la manera en la que el escáner procese de ahora en adelante su entrada (utilizando B<BEGIN,> por ejemplo), esto producirá un bucle sin fin.

source: Note that B<yyless> is a macro and can only be used in the flex input file, not from other source files.
es: Fíjese que B<yyless> es una macro y puede ser utilizada solamente en el fichero de entrada de flex, no desde otros ficheros fuente.

source: B<unput(c)> puts the character I<c> back onto the input stream. It will be the next character scanned. The following action will take the current token and cause it to be rescanned enclosed in parentheses.
es: B<unput(c)> pone el caracter I<c> de nuevo en el flujo de entrada. Este será el próximo caracter analizado. La siguiente acción tomará el token actual y hará que se vuelva a analizar pero encerrado entre paréntesis.
