Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: reads up to B<max_size> characters into B<buf> and returns the number of characters read. To indicate end-of-input, return 0 characters. Note that "interactive" scanners (see the B<-B> and B<-I> flags) define the macro B<YY_INTERACTIVE.> If you redefine B<LexerInput()> and need to take different actions depending on whether or not the scanner might be scanning an interactive input source, you can test for the presence of this name via B<#ifdef.>
es: lee hasta B<max_size> caracteres en B<buf> y devuelve el número de caracteres leídos. Para indicar el fin-de-la-entrada, devuelve 0 caracteres. Fíjese que los analizadores "interactivos" (ver las banderas B<-B> y B<-I> ) definen la macro B<YY_INTERACTIVE.> Si usted redefine B<LexerInput()> y necesita tomar acciones distintas dependiendo de si el analizador está analizando una fuente de entrada interactivo o no, puede comprobar la presencia de este nombre mediante B<#ifdef.>

source: writes out B<size> characters from the buffer B<buf,> which, while NUL-terminated, may also contain "internal" NUL's if the scanner's rules can match text with NUL's in them.
es: escribe a la salida B<size> caracteres desde el buffer B<buf,> que, mientras termine en NUL, puede contener también NUL's "internos" si las reglas del analizador pueden emparejar texto con NUL's dentro de este.

source: reports a fatal error message. The default version of this function writes the message to the stream B<cerr> and exits.
es: informa con un mensaje de error fatal. La versión por defecto de esta función escribe el mensaje al flujo B<cerr> y finaliza.

source: Note that a B<yyFlexLexer> object contains its I<entire> scanning state. Thus you can use such objects to create reentrant scanners. You can instantiate multiple instances of the same B<yyFlexLexer> class, and you can also combine multiple C++ scanner classes together in the same program using the B<-P> option discussed above.
es: Fíjese que un objeto B<yyFlexLexer> contiene su estado de análisis I<completo.> Así puede utilizar tales objetos para crear analizadore reentrantes. Puede hacer varias instancias de la misma clase B<yyFlexLexer,> y puede combinar varias clases de analizadores en C++ conjuntamente en el mismo programa usando la opción B<-P> comentada anteriormente.

source: Finally, note that the B<%array> feature is not available to C++ scanner classes; you must use B<%pointer> (the default).
es: Finalmente, note que la característica B<%array> no está disponible en clases de analizadores en C++; debe utilizar B<%pointer> (por defecto).

source: Here is an example of a simple C++ scanner:
es: Aquí hay un ejemplo de un analizador en C++ simple:

source: // An example of using the flex C++ scanner class.
es: // Un ejemplo del uso de la clase analizador en C++ de flex.

source: {ws} /* skip blanks and tabs */
es: {ws} /* evita los espacios en blanco y tabuladores */

source: {number} cout E<lt>E<lt> "number " E<lt>E<lt> YYText() E<lt>E<lt> '\en';
es: {number} cout E<lt>E<lt> "número " E<lt>E<lt> YYText() E<lt>E<lt> '\en';

source: {name} cout E<lt>E<lt> "name " E<lt>E<lt> YYText() E<lt>E<lt> '\en';
es: {name} cout E<lt>E<lt> "nombre " E<lt>E<lt> YYText() E<lt>E<lt> '\en';

source: {string} cout E<lt>E<lt> "string " E<lt>E<lt> YYText() E<lt>E<lt> '\en';
es: {string} cout E<lt>E<lt> "cadena " E<lt>E<lt> YYText() E<lt>E<lt> '\en';

source: If you want to create multiple (different) lexer classes, you use the B<-P> flag (or the B<prefix=> option) to rename each B<yyFlexLexer> to some other B<xxFlexLexer.> You then can include B<E<lt>FlexLexer.hE<gt>> in your other sources once per lexer class, first renaming B<yyFlexLexer> as follows:
es: Si desea crear varias (diferentes) clases analizadoras, use la bandera B<-P> (o la opción B<prefix=> ) para renombrar cada B<yyFlexLexer> a algún otro B<xxFlexLexer.> Entonces puede incluir B<E<lt>FlexLexer.hE<gt>> en los otros ficheros fuente una vez por clase analizadora, primero renombrando B<yyFlexLexer> como se presenta a continuación:

source: if, for example, you used B<%option prefix="xx"> for one of your scanners and B<%option prefix="zz"> for the other.
es: si, por ejemplo, usted utilizó B<%option prefix="xx"> para uno de sus analizadores y B<%option prefix="zz"> para el otro.

source: IMPORTANT: the present form of the scanning class is I<experimental> and may change considerably between major releases.
es: IMPORTANTE: la forma actual de la clase analizadora es I<experimental> y podría cambiar considerablemente entre versiones principales.

source: INCOMPATIBILITIES WITH LEX AND POSIX
es: INCOMPATIBILIDADES CON LEX Y POSIX

source: I<flex> is a rewrite of the AT&T Unix I<lex> tool (the two implementations do not share any code, though), with some extensions and incompatibilities, both of which are of concern to those who wish to write scanners acceptable to either implementation. Flex is fully compliant with the POSIX I<lex> specification, except that when using B<%pointer> (the default), a call to B<unput()> destroys the contents of B<yytext,> which is counter to the POSIX specification.
es: I<flex> es una reescritura de la herramienta I<lex> del Unix de AT&T (aunque las dos implementaciones no comparten ningún código), con algunas extensiones e incompatibilidades, de las que ambas conciernen a aquellos que desean escribir analizadores aceptables por cualquier implementación. Flex sigue completamente la especificación POSIX de I<lex,> excepto que cuando se utiliza B<%pointer> (por defecto), una llamada a B<unput()> destruye el contenido de B<yytext,> que va en contra de la especificación POSIX.

source: In this section we discuss all of the known areas of incompatibility between flex, AT&T lex, and the POSIX specification.
es: En esta sección comentaremos todas las áreas conocidas de incompatibilidades entre flex, lex de AT&T, y la especificación POSIX.

source: I<flex's> B<-l> option turns on maximum compatibility with the original AT&T I<lex> implementation, at the cost of a major loss in the generated scanner's performance. We note below which incompatibilities can be overcome using the B<-l> option.
es: La opción B<-l> de I<flex> activa la máxima compatibilidad con la implementación original de I<lex> de AT&T, con el coste de una mayor pérdida de rendimiento en el analizador generado. Indicamos más abajo qué incompatibilidades pueden superarse usando la opción B<-l>.

source: I<flex> is fully compatible with I<lex> with the following exceptions:
es: I<flex> es totalmente compatible con I<lex> con las siguientes excepciones:

source: The undocumented I<lex> scanner internal variable B<yylineno> is not supported unless B<-l> or B<%option yylineno> is used.
es: La variable interna del analizador de I<lex> sin documentar B<yylineno> no se ofrece a menos que se use B<-l> o B<%option yylineno>.

source: B<yylineno> should be maintained on a per-buffer basis, rather than a per-scanner (single global variable) basis.
es: B<yylineno> debería gestionarse por buffer, en lugar de por analizador (simple variable global).

source: B<yylineno> is not part of the POSIX specification.
es: B<yylineno> no es parte de la especificación POSIX.

source: The B<input()> routine is not redefinable, though it may be called to read characters following whatever has been matched by a rule. If B<input()> encounters an end-of-file the normal B<yywrap()> processing is done. A ``real'' end-of-file is returned by B<input()> as I<EOF.>
es: La rutina B<input()> no es redefinible, aunque podría invocarse para leer los caracteres que siguen a continuación de lo que haya sido reconocido por una regla. Si B<input()> se encuentra con un fin-de-fichero se realiza el procesamiento de B<yywrap()> normal. B<input()> retorna un fin-de-fichero ``real'' como I<EOF.>

source: Input is instead controlled by defining the B<YY_INPUT> macro.
es: La entrada en su lugar se controla definiendo la macro B<YY_INPUT>.

source: The I<flex> restriction that B<input()> cannot be redefined is in accordance with the POSIX specification, which simply does not specify any way of controlling the scanner's input other than by making an initial assignment to I<yyin.>
es: La restricción de I<flex> de que B<input()> no puede redefinirse va de acuerdo a la especificación POSIX, que simplemente no especifica ninguna manera de controlar la entrada del analizador que no sea haciendo una asignación inicial a I<yyin.>

source: The B<unput()> routine is not redefinable. This restriction is in accordance with POSIX.
es: La rutina B<unput()> no es redefinible. Esta restricción va de acuerdo a POSIX.

source: I<flex> scanners are not as reentrant as I<lex> scanners. In particular, if you have an interactive scanner and an interrupt handler which long-jumps out of the scanner, and the scanner is subsequently called again, you may get the following message:
es: Los analizadores de I<flex> no son tan reentrantes como los analizadores de I<lex.> En particular, si tiene un analizador interactivo y un gestor de interrupción con long-jumps fuera del analizador, y el analizador a continuación se invoca de nuevo, podría obtener el siguiente mensaje:

source: To reenter the scanner, first use
es: Para volver al analizador, primero utilice

source: Note that this call will throw away any buffered input; usually this isn't a problem with an interactive scanner.
es: Vea que esta llamada eliminará cualquier entrada en el buffer; normalmente esto no es un problema con un analizador interactivo.

source: Also note that flex C++ scanner classes I<are> reentrant, so if using C++ is an option for you, you should use them instead. See "Generating C++ Scanners" above for details.
es: Dese cuenta también de que las clases analizadoras en C++ I<son> reentrantes, así que si usar C++ es una opción para usted, debería utilizarla. Vea "Generando Escáners en C++" más arriba para los detalles.

source: B<output()> is not supported. Output from the B<ECHO> macro is done to the file-pointer I<yyout> (default I<stdout).>
es: B<output()> no se provee. La salida desde la macro B<ECHO> se hace al puntero de fichero I<yyout> (por defecto a I<stdout).>

source: B<output()> is not part of the POSIX specification.
es: B<output()> no es parte de la especificación POSIX.

source: I<lex> does not support exclusive start conditions (%x), though they are in the POSIX specification.
es: I<lex> no acepta condiciones de arranque exclusivas (%x), aunque están en la especificación POSIX.

source: When definitions are expanded, I<flex> encloses them in parentheses. With lex, the following:
es: Cuando se expanden las definiciones, I<flex> las encierra entre paréntesis. Con lex, lo siguiente:

source: NAME [A-Z][A-Z0-9]* %% foo{NAME}? printf( "Found it\en" ); %%
es: NOMBRE [A-Z][A-Z0-9]* %% foo{NOMBRE}? printf( "Lo encontró\en" ); %%

source: will not match the string "foo" because when the macro is expanded the rule is equivalent to "foo[A-Z][A-Z0-9]*?" and the precedence is such that the '?' is associated with "[A-Z0-9]*". With I<flex,> the rule will be expanded to "foo([A-Z][A-Z0-9]*)?" and so the string "foo" will match.
es: no reconocerá la cadena "foo" porque cuando la macro se expanda la regla es equivalente a "foo[A-Z][A-Z0-9]*?" y la precedencia es tal que el '?' se asocia con "[A-Z0-9]*". Con I<flex,> la regla se expandirá a "foo([A-Z][A-Z0-9]*)?" y así la cadena "foo" se reconocerá.

source: Note that if the definition begins with B<^> or ends with B<$> then it is I<not> expanded with parentheses, to allow these operators to appear in definitions without losing their special meanings. But the B<E<lt>sE<gt>, /,> and B<E<lt>E<lt>EOFE<gt>E<gt>> operators cannot be used in a I<flex> definition.
es: Fíjese que si la definición comienza con B<^> o finaliza con B<$> entonces I<no> se expande con paréntesis, para permitir que estos operadores aparezcan en las definiciones sin perder su significado especial. Pero los operadores B<E<lt>sE<gt>, /,> y B<E<lt>E<lt>EOFE<gt>E<gt>> no pueden utilizarse en una definición de I<flex>.

source: Using B<-l> results in the I<lex> behavior of no parentheses around the definition.
es: El uso de B<-l> produce en el comportamiendo de I<lex> el no poner paréntesis alrededor de la definición.

source: The POSIX specification is that the definition be enclosed in parentheses.
es: La especificación de POSIX dice que la definición debe ser encerrada entre paréntesis.

source: Some implementations of I<lex> allow a rule's action to begin on a separate line, if the rule's pattern has trailing whitespace:
es: Algunas implementaciones de I<lex> permiten que la acción de una regla comience en una línea separada, si el patrón de la regla tiene espacios en blanco al final:

source: %% foo|barE<lt>space hereE<gt> { foobar_action(); }
es: %% foo|barE<lt>espacio aquíE<gt> { foobar_action(); }

source: I<flex> does not support this feature.
es: I<flex> no dispone de esta propiedad.

source: The I<lex> B<%r> (generate a Ratfor scanner) option is not supported. It is not part of the POSIX specification.
es: La opción B<%r> de I<lex> (generar un analizador Ratfor) no se ofrece. No es parte de la especificación de POSIX.

source: After a call to B<unput(),> I<yytext> is undefined until the next token is matched, unless the scanner was built using B<%array.> This is not the case with I<lex> or the POSIX specification. The B<-l> option does away with this incompatibility.
es: Después de una llamada a B<unput(),> el contenido de I<yytext> está indefinido hasta que se reconozca el próximo token, a menos que el analizador se haya construido usando B<%array.> Este no es el caso de I<lex> o la especificación de POSIX. La opción B<-l> elimina esta incompatibilidad.

source: The precedence of the B<{}> (numeric range) operator is different. I<lex> interprets "abc{1,3}" as "match one, two, or three occurrences of 'abc'", whereas I<flex> interprets it as "match 'ab' followed by one, two, or three occurrences of 'c'". The latter is in agreement with the POSIX specification.
es: La precedencia del operador B<{}> (rango numérico) es diferente. I<lex> interpreta "abc{1,3}" como "empareja uno, dos, o tres apariciones de 'abc'", mientras que I<flex> lo interpreta como "empareja 'ab' seguida de una, dos o tres apariciones de 'c'". Lo último va de acuerdo con la especificación de POSIX.

source: The precedence of the B<^> operator is different. I<lex> interprets "^foo|bar" as "match either 'foo' at the beginning of a line, or 'bar' anywhere", whereas I<flex> interprets it as "match either 'foo' or 'bar' if they come at the beginning of a line". The latter is in agreement with the POSIX specification.
es: La precedencia del operador B<^> es diferente. I<lex> interpreta "^foo|bar" como "empareja bien 'foo' al principio de una línea, o 'bar' en cualquier lugar", mientras que I<flex> lo interpreta como "empareja 'foo' o 'bar' si vienen al principio de una línea". Lo último va de acuerdo con la especificación de POSIX.

source: The special table-size declarations such as B<%a> supported by I<lex> are not required by I<flex> scanners; I<flex> ignores them.
es: Las declaraciones especiales del tamaño de las tablas tal como B<%a> que reconoce I<lex> no se requieren en los analizadores de I<flex;> I<flex> los ignora.

source: The name
es: El identificador

source: FLEX_SCANNER is #define'd so scanners may be written for use with either I<flex> or I<lex.> Scanners also include B<YY_FLEX_MAJOR_VERSION> and B<YY_FLEX_MINOR_VERSION> indicating which version of I<flex> generated the scanner (for example, for the 2.5 release, these defines would be 2 and 5 respectively).
es: FLEX_SCANNER se #define de manera que los analizadores podrían escribirse para ser procesados con I<flex> o con I<lex.> Los analizadores también incluyen B<YY_FLEX_MAJOR_VERSION> y B<YY_FLEX_MINOR_VERSION> indicando qué versión de I<flex> generó el analizador (por ejemplo, para la versión 2.5, estas definiciones serán 2 y 5 respectivamente).

source: The following I<flex> features are not included in I<lex> or the POSIX specification:
es: Las siguientes propiedades de I<flex> no se incluyen en I<lex> o la especificación POSIX:

source: C++ scanners %option start condition scopes start condition stacks interactive/non-interactive scanners yy_scan_string() and friends yyterminate() yy_set_interactive() yy_set_bol() YY_AT_BOL() E<lt>E<lt>EOFE<gt>E<gt> E<lt>*E<gt> YY_DECL YY_START YY_USER_ACTION YY_USER_INIT #line directives %{}'s around actions multiple actions on a line
es: analizadores en C++ %option ámbitos de condiciones de arranque pilas de condiciones de arranque analizadores interactivos/no-interactivos yy_scan_string() y sus amigas yyterminate() yy_set_interactive() yy_set_bol() YY_AT_BOL() E<lt>E<lt>EOFE<gt>E<gt> E<lt>*E<gt> YY_DECL YY_START YY_USER_ACTION YY_USER_INIT directivas #line %{}'s alrededor de acciones varias acciones en una línea

source: plus almost all of the flex flags. The last feature in the list refers to the fact that with I<flex> you can put multiple actions on the same line, separated with semi-colons, while with I<lex,> the following
es: más casi todas las banderas de flex. La última propiedad en la lista se refiere al hecho de que con I<flex> puede poner varias acciones en la misma línea, sepradas con punto y coma, mientras que con I<lex,> lo siguiente

source: is (rather surprisingly) truncated to
es: se trunca (sorprendentemente) a

source: I<flex> does not truncate the action. Actions that are not enclosed in braces are simply terminated at the end of the line.
es: I<flex> no trunca la acción. Las acciones que no se encierran en llaves simplemente se terminan al final de la línea.

source: DIAGNOSTICS
es: DIAGNÓSTICOS

source: I<warning, rule cannot be matched> indicates that the given rule cannot be matched because it follows other rules that will always match the same text as it. For example, in the following "foo" cannot be matched because it comes after an identifier "catch-all" rule:
es: I<aviso, la regla no se puede aplicar> indica que la regla dada no puede emparejarse porque sigue a otras reglas que siempre emparejarán el mismo texto que el de esta. Por ejemplo, en el siguiente ejemplo "foo" no puede emparejarse porque viene después de una regla "atrápalo-todo" para identificadores:

source: [a-z]+ got_identifier(); foo got_foo();
es: [a-z]+ obtuvo_identificador(); foo obtuvo_foo();

source: Using B<REJECT> in a scanner suppresses this warning.
es: El uso de B<REJECT> en un analizador suprime este aviso.

source: I<warning,> B<-s> I<option given but default rule can be matched> means that it is possible (perhaps only in a particular start condition) that the default rule (match any single character) is the only one that will match a particular input. Since B<-s> was given, presumably this is not intended.
es: I<aviso,> I<se ha especificado la opción> B<-s> I<pero se puede aplicar la regla por defecto> significa que es posible (tal vez únicamente en una condición de arranque en particular) que la regla por defecto (emparejar cualquier caracter simple) sea la única que emparejará una entrada particular. Ya que se indicó B<-s,> presumiblemente esto no es lo que se pretendía.

source: I<reject_used_but_not_detected undefined> or I<yymore_used_but_not_detected undefined -> These errors can occur at compile time. They indicate that the scanner uses B<REJECT> or B<yymore()> but that I<flex> failed to notice the fact, meaning that I<flex> scanned the first two sections looking for occurrences of these actions and failed to find any, but somehow you snuck some in (via a #include file, for example). Use B<%option reject> or B<%option yymore> to indicate to flex that you really do use these features.
es: I<definición no definida {reject_used_but_not_detected}> o I<definición no definida {yymore_used_but_not_detected} -> Estos errores pueden suceder en tiempo de compilación. Indican que el analizador usa B<REJECT> o B<yymore()> pero que I<flex> falló en darse cuenta del hecho, queriendo decir que I<flex> analizó las dos primeras secciones buscando apariciones de estas acciones y falló en encontrar alguna, pero que de algún modo se le han colado (por medio de un archivo #include, por ejemplo). Use B<%option reject> o B<%option yymore> para indicar a flex que realmente usa esta funcionalidad.

source: I<flex scanner jammed -> a scanner compiled with B<-s> has encountered an input string which wasn't matched by any of its rules. This error can also occur due to internal problems.
es: I<flex scanner jammed -> un analizador compilado con B<-s> ha encontrado una cadena de entrada que no fue reconocida por niguna de sus reglas. Este error puede suceder también debido a problemas internos.

source: I<token too large, exceeds YYLMAX -> your scanner uses B<%array> and one of its rules matched a string longer than the B<YYLMAX> constant (8K bytes by default). You can increase the value by #define'ing B<YYLMAX> in the definitions section of your I<flex> input.
es: I<token too large, exceeds YYLMAX -> su analizador usa B<%array> y una de sus reglas reconoció una cadena más grande que la constante B<YYLMAX> (8K bytes por defecto). Usted puede incrementar el valor haciendo un #define B<YYLMAX> en la sección de definiciones de su entrada de I<flex.>

source: I<scanner requires -8 flag to> I<use the character 'x' -> Your scanner specification includes recognizing the 8-bit character I<'x'> and you did not specify the -8 flag, and your scanner defaulted to 7-bit because you used the B<-Cf> or B<-CF> table compression options. See the discussion of the B<-7> flag for details.
es: I<el analizador requiere la opción -8 para> I<poder usar el carácter 'x' -> La especificación de su analizador incluye el reconocimiento del caracter de 8-bits I<'x'> y no ha especificado la bandera -8, y su analizador por defecto está a 7-bits porque ha usado las opciones B<-Cf> o B<-CF> de compresión de tablas. Vea el comentario de la bandera B<-7> para los detalles.

source: I<flex scanner push-back overflow -> you used B<unput()> to push back so much text that the scanner's buffer could not hold both the pushed-back text and the current token in B<yytext.> Ideally the scanner should dynamically resize the buffer in this case, but at present it does not.
es: I<flex scanner push-back overflow -> usted utilizó B<unput()> para devolver tanto texto que el buffer del analizador no pudo mantener el texto devuelto y el token actual en B<yytext.> Idealmente el analizador debería ajustar dinámicamente el buffer en este caso, pero actualmente no lo hace.

source: I<input buffer overflow, can't enlarge buffer because scanner uses REJECT -> the scanner was working on matching an extremely large token and needed to expand the input buffer. This doesn't work with scanners that use B<REJECT.>
es: I<input buffer overflow, can't enlarge buffer because scanner uses REJECT -> el analizador estaba intentando reconocer un token extremadamente largo y necesitó expandir el buffer de entrada. Esto no funciona con analizadores que usan B<REJECT.>

source: I<fatal flex scanner internal error--end of buffer missed -> This can occur in an scanner which is reentered after a long-jump has jumped out (or over) the scanner's activation frame. Before reentering the scanner, use:
es: I<fatal flex scanner internal error--end of buffer missed -> Esto puede suceder en un analizador que se reintroduce después de que un long-jump haya saltado fuera (o sobre) el registro de activación del analizador. Antes de reintroducir el analizador, use:

source: or, as noted above, switch to using the C++ scanner class.
es: o, como se comentó más arriba, cambie y use el analizador como clase de C++.
