Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/flex.1.po
Languages: es

source: with the first three all being quite expensive and the last two being quite cheap. Note also that B<unput()> is implemented as a routine call that potentially does quite a bit of work, while B<yyless()> is a quite-cheap macro; so if just putting back some excess text you scanned, use B<yyless().>
es: siendo las tres primeras bastante costosas y las dos últimas bastante económicas. Fíjese también que B<unput()> se implementa como una llamada de rutina que potencialmente hace bastante trabajo, mientras que B<yyless()> es una macro bastante económica; así que si está devolviendo algún texto excedente que ha analizado, use B<yyless().>

source: B<REJECT> should be avoided at all costs when performance is important. It is a particularly expensive option.
es: B<REJECT> debería evitarse a cualquier precio cuando el rendimiento es importante. Esta es una opción particularmente cara.

source: Getting rid of backing up is messy and often may be an enormous amount of work for a complicated scanner. In principal, one begins by using the B<-b> flag to generate a I<lex.backup> file. For example, on the input
es: Es lioso deshacerse del retroceso y a menudo podría ser una cantidad de trabajo enorme para un analizador complicado. En principio, uno comienza utilizando la bandera B<-b> para generar un archivo I<lex.backup.> Por ejemplo, sobre la entrada

source: the file looks like:
es: el fichero tiene el siguiente aspecto:

source: State #6 is non-accepting - associated rule line numbers: 2 3 out-transitions: [ o ] jam-transitions: EOF [ \e001-n p-\e177 ]
es: El estado #6 es no-aceptar - números de línea asociados a la regla: 2 3 fin de transiciones: [ o ] transiciones de bloqueo: fin de archivo (EOF) [ \e001-n p-\e177 ]

source: State #8 is non-accepting - associated rule line numbers: 3 out-transitions: [ a ] jam-transitions: EOF [ \e001-` b-\e177 ]
es: El estado #8 es no-aceptar - números de línea asociados a la regla: 3 fin de transiciones: [ a ] transiciones de bloqueo: fin de archivo (EOF) [ \e001-` b-\e177 ]

source: State #9 is non-accepting - associated rule line numbers: 3 out-transitions: [ r ] jam-transitions: EOF [ \e001-q s-\e177 ]
es: El estado #9 es no-aceptar - números de línea asociados a la regla: 3 fin de transiciones: [ r ] transiciones de bloqueo: fin de archivo (EOF) [ \e001-q s-\e177 ]

source: Compressed tables always back up.
es: Las tablas comprimidas siempre implican un retroceso.

source: The first few lines tell us that there's a scanner state in which it can make a transition on an 'o' but not on any other character, and that in that state the currently scanned text does not match any rule. The state occurs when trying to match the rules found at lines 2 and 3 in the input file. If the scanner is in that state and then reads something other than an 'o', it will have to back up to find a rule which is matched. With a bit of headscratching one can see that this must be the state it's in when it has seen "fo". When this has happened, if anything other than another 'o' is seen, the scanner will have to back up to simply match the 'f' (by the default rule).
es: Las primeras líneas nos dicen que hay un estado del analizador en el que se puede hacer una transición con una 'o' pero no sobre cualquier otro caracter, y que en ese estado el texto recientemente analizado no empareja con ninguna regla. El estado ocurre cuando se intenta emparejar las reglas encontradas en las líneas 2 y 3 en el fichero de entrada. Si el analizador está en ese estado y entoces lee cualquier cosa que no sea una 'o', tendrá que retroceder para encontrar una regla que empareje. Con un poco de análisis uno puede ver que este debe ser el estado en el que se está cuando se ha visto "fo". Cuando haya ocurrido, si se ve cualquier cosa que no sea una 'o', el analizador tendrá que retroceder para simplemente emparejar la 'f' (por la regla por defecto).

source: The comment regarding State #8 indicates there's a problem when "foob" has been scanned. Indeed, on any character other than an 'a', the scanner will have to back up to accept "foo". Similarly, the comment for State #9 concerns when "fooba" has been scanned and an 'r' does not follow.
es: El comentario que tiene que ver con el Estado #8 indica que hay un problema cuando se analiza "foob". En efecto, con cualquier caracter que no sea una 'a', el analizador tendrá que retroceder para aceptar "foo". De forma similar, el comentario para el Estado #9 tiene que ver cuando se ha analizado "fooba" y no le sigue una 'r'.

source: The final comment reminds us that there's no point going to all the trouble of removing backing up from the rules unless we're using B<-Cf> or B<-CF,> since there's no performance gain doing so with compressed scanners.
es: El comentario final nos recuerda que no mecere la pena todo el trabajo para eliminar el retroceso de las reglas a menos que estemos usando B<-Cf> o B<-CF,> y que no hay ninguna mejora del rendimiento haciéndolo con analizadores comprimidos.

source: The way to remove the backing up is to add "error" rules:
es: La manera de quitar los retrocesos es añadiendo reglas de "error":

source: fooba | foob | fo { /* false alarm, not really a keyword */ return TOK_ID; }
es: fooba | foob | fo { /* falsa alarma, realmente no es una palabra clave */ return TOK_ID; }

source: Eliminating backing up among a list of keywords can also be done using a "catch-all" rule:
es: La eliminación de retroceso en una lista de palabras clave también puede hacerse utilizando una regla "atrápalo-todo":

source: This is usually the best solution when appropriate.
es: Normalmente esta es la mejor solución cuando sea adecuada.

source: Backing up messages tend to cascade. With a complicated set of rules it's not uncommon to get hundreds of messages. If one can decipher them, though, it often only takes a dozen or so rules to eliminate the backing up (though it's easy to make a mistake and have an error rule accidentally match a valid token. A possible future I<flex> feature will be to automatically add rules to eliminate backing up).
es: Los mensajes sobre retrocesos tienden a aparecer en cascada. Con un conjunto complicado de reglas no es poco común obtener cientos de mensajes. Si uno puede descifrarlos, sin embargo, a menudo sólo hay que tomar una docena de reglas o algo así para eliminar los retrocesos (ya que es fácil cometer una equivocación y tener una regla de error que reconozca un token válido. Una posible característica futura de I<flex> será añadir reglas automáticamente para eliminar el retroceso).

source: It's important to keep in mind that you gain the benefits of eliminating backing up only if you eliminate I<every> instance of backing up. Leaving just one means you gain nothing.
es: Es importante tener en cuenta que se obtienen los beneficios de eliminar el retroceso sólo si elimina I<cada> instancia del retroceso. Dejar solamente una significa que no ha ganado absolutamente nada.

source: I<Variable> trailing context (where both the leading and trailing parts do not have a fixed length) entails almost the same performance loss as B<REJECT> (i.e., substantial). So when possible a rule like:
es: El contexto posterior I<variable> (donde la parte delantera y posterior no tienen una longitud fija) supone casi la misma pérdida de rendimiento que B<REJECT> (es decir, substanciales). Así que cuando sea posible una regla como esta:

source: %% mouse|rat/(cat|dog) run();
es: %% raton|rata/(gato|perro) correr();

source: is better written:
es: es mejor escribirla así:

source: %% mouse/cat|dog run(); rat/cat|dog run();
es: %% raton/gato|perro correr(); rata/gato|perro correr();

source: or as
es: o así

source: %% mouse|rat/cat run(); mouse|rat/dog run();
es: %% raton|rata/gato correr(); raton|rata/perro correr();

source: Note that here the special '|' action does I<not> provide any savings, and can even make things worse (see Deficiencies / Bugs below).
es: Fíjese que aquí la acción especial '|' I<no> ofrece ningún ahorro, y puede incluso hacer las cosas peor (ver Deficiencias / Errores más abajo).

source: Another area where the user can increase a scanner's performance (and one that's easier to implement) arises from the fact that the longer the tokens matched, the faster the scanner will run. This is because with long tokens the processing of most input characters takes place in the (short) inner scanning loop, and does not often have to go through the additional work of setting up the scanning environment (e.g., B<yytext)> for the action. Recall the scanner for C comments:
es: Otro área donde el usuario puede incrementar el rendimiento del analizador (y una que es más fácil de implementar) surge del hecho que cuanto más tarde se empareje un token, más rápido irá el analizador. Esto es debido a que con tokens grandes el procesamiento de la mayoría de los caracteres de entrada tiene lugar en el (corto) bucle de análisis más interno, y no tiene que ir tan a menudo a hacer el trabajo de más para constituir el entorno del analizador (p.ej., B<yytext)> para la acción. Recuerde el analizador para los comentarios en C:

source: E<lt>commentE<gt>[^*\en]* E<lt>commentE<gt>"*"+[^*/\en]* E<lt>commentE<gt>\en ++line_num; E<lt>commentE<gt>"*"+"/" BEGIN(INITIAL);
es: E<lt>comentarioE<gt>[^*\en]* E<lt>comentarioE<gt>"*"+[^*/\en]* E<lt>comentarioE<gt>\en ++num_linea; E<lt>comentarioE<gt>"*"+"/" BEGIN(INITIAL);

source: This could be sped up by writing it as:
es: Esto podría acelerarse escribiéndolo como:

source: E<lt>commentE<gt>[^*\en]* E<lt>commentE<gt>[^*\en]*\en ++line_num; E<lt>commentE<gt>"*"+[^*/\en]* E<lt>commentE<gt>"*"+[^*/\en]*\en ++line_num; E<lt>commentE<gt>"*"+"/" BEGIN(INITIAL);
es: E<lt>comentarioE<gt>[^*\en]* E<lt>comentarioE<gt>[^*\en]*\en ++num_linea; E<lt>comentarioE<gt>"*"+[^*/\en]* E<lt>comentarioE<gt>"*"+[^*/\en]*\en ++num_linea; E<lt>comentarioE<gt>"*"+"/" BEGIN(INITIAL);

source: Now instead of each newline requiring the processing of another action, recognizing the newlines is "distributed" over the other rules to keep the matched text as long as possible. Note that I<adding> rules does I<not> slow down the scanner! The speed of the scanner is independent of the number of rules or (modulo the considerations given at the beginning of this section) how complicated the rules are with regard to operators such as '*' and '|'.
es: Ahora en lugar de que cada línea nueva requiera el procesamiento de otra regla, el reconocimiento de las líneas nuevas se "distribuye" sobre las otras reglas para mantener el texto reconocido tan largo como sea posible. ¡Fíjese que el I<añadir> reglas I<no> ralentiza el analizador! La velocidad del analizador es independiente del número de reglas o (dadas las consideraciones dadas al inicio de esta sección) cuán complicadas sean las reglas respecto a operadores tales como '*' y '|'.

source: A final example in speeding up a scanner: suppose you want to scan through a file containing identifiers and keywords, one per line and with no other extraneous characters, and recognize all the keywords. A natural first approach is:
es: Un ejemplo final sobre la aceleración de un analizador: suponga que quiere analizar un fichero que contiene identificadores y palabras clave, una por línea y sin ningún caracter extraño, y reconocer todas las palabras clave. Una primera aproximación natural es:

source: %% asm | auto | break | ... etc ... volatile | while /* it's a keyword */
es: %% asm | auto | break | ... etc ... volatile | while /* es una palabra clave */

source: .|\en /* it's not a keyword */
es: .|\en /* no es una palabra clave */

source: To eliminate the back-tracking, introduce a catch-all rule:
es: Para eliminar el retroceso, introduzca una regla atrápalo-todo:

source: [a-z]+ | .|\en /* it's not a keyword */
es: [a-z]+ | .|\en /* no es una palabra clave */

source: Now, if it's guaranteed that there's exactly one word per line, then we can reduce the total number of matches by a half by merging in the recognition of newlines with that of the other tokens:
es: Ahora, si se garantiza que hay exáctamente una palabra por línea, entonces podemos reducir el número total de emparejamientos por la mitad mezclando el reconocimiento de líneas nuevas con las de los otros tokens:

source: %% asm\en | auto\en | break\en | ... etc ... volatile\en | while\en /* it's a keyword */
es: %% asm\en | auto\en | break\en | ... etc ... volatile\en | while\en /* es una palabra clave */

source: [a-z]+\en | .|\en /* it's not a keyword */
es: [a-z]+\en | .|\en /* no es una palabra clave */

source: One has to be careful here, as we have now reintroduced backing up into the scanner. In particular, while I<we> know that there will never be any characters in the input stream other than letters or newlines, I<flex> can't figure this out, and it will plan for possibly needing to back up when it has scanned a token like "auto" and then the next character is something other than a newline or a letter. Previously it would then just match the "auto" rule and be done, but now it has no "auto" rule, only a "auto\en" rule. To eliminate the possibility of backing up, we could either duplicate all rules but without final newlines, or, since we never expect to encounter such an input and therefore don't how it's classified, we can introduce one more catch-all rule, this one which doesn't include a newline:
es: Uno tiene que ser cuidadoso aquí, ya que hemos reintroducido retroceso en el analizador. En particular, aunque I<nosotros> sepamos que ahí nunca habrán otros caracteres en el flujo de entrada que no sean letras o líneas nuevas, I<flex> no puede figurarse eso, y planeará la posible necesidad de retroceder cuando haya analizado un token como "auto" y el próximo caracter sea algo distinto a una línea nueva o una letra. Previamente este podría entonces emparejar la regla "auto" y estar todo hecho, pero ahora este no tiene una regla "auto", solamente una regla "auto\en". Para eliminar la posibilidad de retroceso, podríamos o bien duplicar todas las reglas pero sin línea nueva al final, o, ya que nunca esperamos encontrar tal entrada y por lo tanto ni cómo es clasificada, podemos introducir una regla atrápalo-todo más, esta que no incluye una línea nueva:

source: [a-z]+\en | [a-z]+ | .|\en /* it's not a keyword */
es: [a-z]+\en | [a-z]+ | .|\en /* no es una palabra clave */

source: Compiled with B<-Cf,> this is about as fast as one can get a I<flex> scanner to go for this particular problem.
es: Compilado con B<-Cf,> esto es casi tan rápido como lo que uno puede obtener de un analizador de I<flex> para este problema en particular.

source: A final note: I<flex> is slow when matching NUL's, particularly when a token contains multiple NUL's. It's best to write rules which match I<short> amounts of text if it's anticipated that the text will often include NUL's.
es: Una nota final: I<flex> es lento cuando empareja NUL's, particularmente cuando un token contiene múltiples NUL's. Es mejor escribir reglas que emparejen I<cortas> cantidades de texto si se anticipa que el texto incluirá NUL's a menudo.

source: Another final note regarding performance: as mentioned above in the section How the Input is Matched, dynamically resizing B<yytext> to accommodate huge tokens is a slow process because it presently requires that the (huge) token be rescanned from the beginning. Thus if performance is vital, you should attempt to match "large" quantities of text but not "huge" quantities, where the cutoff between the two is at about 8K characters/token.
es: Otra nota final en relación con el rendimiento: tal y como se mencionó en la sección Cómo se Reconoce la Entrada, el reajuste dinámico de B<yytext> para acomodar tokens enormes es un proceso lento porque ahora requiere que el token (inmenso) sea reanalizado desde el principio. De esta manera si el rendimiento es vital, debería intentar emparejar "grandes" cantidades de texto pero no "inmensas" cantidades, donde el punto medio está en torno a los 8K caracteres/token.

source: GENERATING C++ SCANNERS
es: GENERANDO ESCÁNERES EN C++

source: I<flex> provides two different ways to generate scanners for use with C++. The first way is to simply compile a scanner generated by I<flex> using a C++ compiler instead of a C compiler. You should not encounter any compilations errors (please report any you find to the email address given in the Author section below). You can then use C++ code in your rule actions instead of C code. Note that the default input source for your scanner remains I<yyin,> and default echoing is still done to I<yyout.> Both of these remain I<FILE *> variables and not C++ I<streams.>
es: I<flex> ofrece dos maneras distintas de generar analizadores para usar con C++. La primera manera es simplemente compilar un analizador generado por I<flex> usando un compilador de C++ en lugar de un compilador de C. No debería encontrarse ante ningún error de compilación (por favor informe de cualquier error que encuentre a la dirección de correo electrónico dada en la sección Autores más abajo). Puede entonces usar código C++ en sus acciones de las reglas en lugar de código C. Fíjese que la fuente de entrada por defecto para su analizador permanece como I<yyin,> y la repetición por defecto se hace aún a I<yyout.> Ambos permanecen como variables I<FILE *> y no como I<flujos> de C++.

source: You can also use I<flex> to generate a C++ scanner class, using the B<-+> option (or, equivalently, B<%option c++),> which is automatically specified if the name of the flex executable ends in a '+', such as I<flex++.> When using this option, flex defaults to generating the scanner to the file B<lex.yy.cc> instead of B<lex.yy.c.> The generated scanner includes the header file I<FlexLexer.h,> which defines the interface to two C++ classes.
es: También puede utilizar I<flex> para generar un analizador como una clase de C++, utilizando la opción B<-+> (o, equivalentemente, B<%option c++),> que se especifica automáticamente si el nombre del ejecutable de flex finaliza con un '+', tal como I<flex++.> Cuando se usa esta opcióx, flex establece por defecto la generación del analizador al fichero B<lex.yy.cc> en vez de B<lex.yy.c.> El analizador generado incluye el fichero de cabecera I<FlexLexer.h,> que define el interfaz con las dos clases de C++.

source: The first class, B<FlexLexer,> provides an abstract base class defining the general scanner class interface. It provides the following member functions:
es: La primera clase, B<FlexLexer,> ofrece una clase base abstracta definiendo la interfaz a la clase del analizador general. Este provee las siguientes funciones miembro:

source: returns the text of the most recently matched token, the equivalent of B<yytext.>
es: retorna el texto del token reconocido más recientemente, el equivalente a B<yytext.>

source: returns the length of the most recently matched token, the equivalent of B<yyleng.>
es: retorna la longitud del token reconocido más recientemente, el equivalente a B<yyleng.>

source: returns the current input line number (see B<%option yylineno),> or B<1> if B<%option yylineno> was not used.
es: retorna el número de línea de entrada actual (ver B<%option yylineno),> o B<1> si no se usó B<%option yylineno>.

source: sets the debugging flag for the scanner, equivalent to assigning to B<yy_flex_debug> (see the Options section above). Note that you must build the scanner using B<%option debug> to include debugging information in it.
es: activa la bandera de depuración para el analizador, equivalente a la asignación de B<yy_flex_debug> (ver la sección Opciones más arriba). Fíjese que debe construir el analizador utilizando B<%option debug> para incluir información de depuración en este.

source: returns the current setting of the debugging flag.
es: retorna el estado actual de la bandera de depuración.

source: Also provided are member functions equivalent to B<yy_switch_to_buffer(),> B<yy_create_buffer()> (though the first argument is an B<istream*> object pointer and not a B<FILE*),> B<yy_flush_buffer(),> B<yy_delete_buffer(),> and B<yyrestart()> (again, the first argument is a B<istream*> object pointer).
es: También se proveen funciones miembro equivalentes a B<yy_switch_to_buffer(),> B<yy_create_buffer()> (aunque el primer argumento es un puntero a objeto B<istream*> y no un B<FILE*),> B<yy_flush_buffer(),> B<yy_delete_buffer(),> y B<yyrestart()> (de nuevo, el primer argumento es un puntero a objeto B<istream*>).

source: The second class defined in I<FlexLexer.h> is B<yyFlexLexer,> which is derived from B<FlexLexer.> It defines the following additional member functions:
es: La segunda clase definida en I<FlexLexer.h> es B<yyFlexLexer,> que se deriva de B<FlexLexer.> Esta define las siguientes funciones miembro adicionales:

source: constructs a B<yyFlexLexer> object using the given streams for input and output. If not specified, the streams default to B<cin> and B<cout,> respectively.
es: construye un objeto B<yyFlexLexer> usando los flujos dados para la entrada y salida. Si no se especifica, los flujos se establecen por defecto a B<cin> y B<cout,> respectivamente.

source: performs the same role is B<yylex()> does for ordinary flex scanners: it scans the input stream, consuming tokens, until a rule's action returns a value. If you derive a subclass B<S> from B<yyFlexLexer> and want to access the member functions and variables of B<S> inside B<yylex(),> then you need to use B<%option yyclass="S"> to inform I<flex> that you will be using that subclass instead of B<yyFlexLexer.> In this case, rather than generating B<yyFlexLexer::yylex(),> I<flex> generates B<S::yylex()> (and also generates a dummy B<yyFlexLexer::yylex()> that calls B<yyFlexLexer::LexerError()> if called).
es: hace el mismo papel que B<yylex()> en los analizadores de flex ordinarios: analiza el flujo de entrada, consumiendo tokens, hasta que la acción de una regla retorne un valor. Si usted deriva una subclase B<S> a partir de B<yyFlexLexer> y quiere acceder a las funciones y variables miembro de B<S> dentro de B<yylex(),> entonces necesita utilizar B<%option yyclass="S"> para informar a I<flex> que estará utilizando esa subclase en lugar de B<yyFlexLexer.> Es este caso, en vez de generar B<yyFlexLexer::yylex(),> I<flex> genera B<S::yylex()> (y también genera un substituto B<yyFlexLexer::yylex()> que llama a B<yyFlexLexer::LexerError()> si se invoca).

source: B<ostream* new_out = 0)> reassigns B<yyin> to B<new_in> (if non-nil) and B<yyout> to B<new_out> (ditto), deleting the previous input buffer if B<yyin> is reassigned.
es: B<ostream* new_out = 0)> reasigna B<yyin> a B<new_in> (si no es nulo) e B<yyout> a B<new_out> (idem), borrando el buffer de entrada anterior si se reasigna B<yyin>.

source: first switches the input streams via B<switch_streams( new_in, new_out )> and then returns the value of B<yylex().>
es: primero conmuta el flujo de entrada via B<switch_streams( new_in, new_out )> y entonces retorna el valor de B<yylex().>

source: In addition, B<yyFlexLexer> defines the following protected virtual functions which you can redefine in derived classes to tailor the scanner:
es: Además, B<yyFlexLexer> define las siguientes funciones virtuales protegidas que puede redefinir en clases derivadas para adaptar el analizador:
