Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: If the expression starts or ends with a slash (/), then it will select directories instead of files.
es: Si la expresión empieza o termina con una barra (/), entonces la selección se realiza sobre directorios en vez de ficheros.

source: B<\e (backslash).> Use the "\e" key to unselect a group of files. This is the opposite of the Plus key.
es: B<- ( menos) o \e ( contrabarra).> Usaremos la tecla - o "\e" para deseleccionar un grupo de ficheros. Esta es la operación contraria a la realizada por la tecla Más (+). B<* N. de T.:> La tecla que realiza originalmente la función descrita es el menos (-) ya que esta es la utilizada en la versión originaria del programa, Comandante Norton.

source: B<up-key, C-p.> Move the selection bar to the previous entry in the panel.
es: B<Cursor-Arriba, C-p.> Desplaza la barra de selección a la entrada anterior en el panel.

source: B<down-key, C-n.> Move the selection bar to the next entry in the panel.
es: B<Cursor-Abajo, C-n.> Desplaza la barra de selección a la entrada siguiente en el panel.

source: B<home, a1, M-E<lt>.> Move the selection bar to the first entry in the panel.
es: B<Inicio ( Home), a1, M-E<lt>.> Desplaza la barra de selección a la primera entrada en el panel.

source: B<end, c1, M-E<gt>.> Move the selection bar to the last entry in the panel.
es: B<Fin ( End), c1, M-E<gt>.> Desplaza la barra de selección a la última entrada en el panel.

source: B<next-page, C-v.> Move the selection bar one page down.
es: B<Av. Pág ( next-page), C-v.> Desplaza la barra de selección a la página siguiente.

source: B<prev-page, M-v.> Move the selection bar one page up.
es: B<Re. Pág ( prev-page), M-v.> Desplaza la barra de selección a la página anterior.

source: B<M-o,> If the other panel is a listing panel and you are standing on a directory in the current panel, then the other panel contents are set to the contents of the currently selected directory (like Emacs' dired C-o key) otherwise the other panel contents are set to the parent dir of the current dir.
es: B<M-o,> Si el otro panel es un panel con lista de ficheros y estamos situados en un directorio en el panel activo actual, entonces otro panel se posiciona dentro del directorio del panel activo ( como la tecla de Emacs C-o ) en otro caso el otro panel es posicionado el directorio padre del directorio seleccionado en el panel activo.

source: B<C-PageUp, C-PageDown> Only when ran on the Linux console: does a chdir to ".." and to the currently selected directory respectively.
es: B<C-RePág ( C-PageUp), C-AvPág ( C-PageDown)> Solamente bajo la consola Linux: realiza un chdir ".." o al directorio actualmente seleccionado respectivamente.

source: Shell Command Line
es: Línea de Comandos del Shell

source: This section lists keys which are useful to avoid excessive typing when entering shell commands.
es: Esta sección enumera las teclas útiles para evitar la excesiva escritura cuando se introducen comandos del shell.

source: B<M-Enter.> Copy the currently selected file name to the command line.
es: B<M-Enter.> Copia el nombre de fichero seleccionado a la línea de comandos.

source: B<C-Enter.> Same a M-Enter, this one only works on the Linux console.
es: B<C-Enter.> Igual a M-Enter, esto sólo funcioba bajo Linux.

source: B<M-Tab.> Does the filename, command, variable, username and hostname completion for you.
es: B<M-Tab.> Realiza una Terminación automática ( completion) del nombre de fichero, comando, variable, nombre de usuario y host.

source: B<C-x t, C-x C-t.> Copy the tagged files (or if there are no tagged files, the selected file) of the current panel (C-x t) or of the other panel (C-x C-t) to the command line.
es: B<C-x t, C-x C-t.> Copia los ficheros marcados ( o si no los hay, el fichero seleccionado) del panel activo ( C-x t) o del otro panel (C-x C-t) a la línea de comandos.

source: B<C-x p, C-x C-p.> The first key sequence copies the current path name to the command line, and the second one copies the unselected panel's path name to the command line.
es: B<C-x p, C-x C-p.> La primera secuencia de teclas copia el nombre de la ruta de acceso actual a la línea de comandos, y la segunda copia la ruta del otro panel a la línea de comandos.

source: B<C-q.> The quote command can be used to insert characters that are otherwise interpreted by the Midnight Commander (like the '+' symbol)
es: B<C-q.> El comando cita ( quote) puede ser utilizado para insertar caracteres que de otro modo serían interpretados por Midnight Commander ( como el símbolo '+')

source: B<M-p, M-n.> Use these keys to browse through the command history. M-p takes you to the last entry, M-n takes you to the next one.
es: B<M-p, M-n.> Usaremos esas teclas para navegar a través del histórico de comandos. M-p devuelve la última entrada, M-n devuelve la siguiente.

source: B<M-h.> Displays the history for the current input line.
es: B<M-h.> Visualiza el historial para la línea de entrada actual.

source: General Movement Keys
es: Teclas Generales de Movimiento

source: The help viewer, the file viewer and the directory tree use common code to handle moving. Therefore they accept exactly the same keys. Each of them also accepts some keys of its own.
es: El visor de ayuda, el visor de fichero y el árbol de directorios usan un código de control de movimiento común. Por consiguiente, reconocen las mismas teclas. Además, cada uno reconoce algunas algunas otras teclas propias.

source: Other parts of the Midnight Commander use some of the same movement keys, so this section may be of use for those parts too.
es: Otras partes de Midnight Commander utilizan algunas de las mismas teclas de movimiento, por lo que esta sección podría ser aplicada a ellas también.

source: B<Up, C-p.> Moves one line backward.
es: B<Arriba (Up), C-p.> Mueve una línea hacia arriba.

source: B<Down, C-n.> Moves one line forward.
es: B<Abajo (Down), C-n.> Mueve una línea hacia abajo.

source: B<Prev Page, Page Up, M-v.> Moves one pageful backward.
es: B<Re Pág ( Retroceso de Página, Prev Page , Page Up), M-v.> Mueve una página completa hacia atrás.

source: B<Next Page, Page Down, C-v.> Moves one pageful forward.
es: B<Av Pág ( Avance de Página, Next Page, Page Down), C-v.> Mueve una página hacia delante.

source: B<Home, A1.> Moves to the beginning.
es: B<Inicio ( Home), A1.> Mueve al principio.

source: B<End, C1.> Move to the end.
es: B<Fin ( End), C1.> Mueve al final.

source: The help viewer and the file viewer accept the following keys in addition the to ones mentioned above:
es: El visor de ayuda y el de fichero reconocen las siguiente teclas a parte de las mencionadas anteriormente:

source: B<b, C-b, C-h, Backspace, Delete.> Moves one pageful backward.
es: B<b, C-b, C-h, Retroespacio ( Backspace), Suprimir ( Delete).> Mueve una página completa hacia atrás.

source: B<Space bar.> Moves one pageful forward.
es: B<Barra espaciadora ( Space bar).> Mueve una página hacia delante.

source: B<u, d.> Moves one half of a page backward or forward.
es: B<u, d.> Mueve la mitad de la página hacia atrás o adelante.

source: B<g, G.> Moves to the beginning or to the end.
es: B<g, G.> Mueve al principio o al final.

source: Input Line Keys
es: Teclas de la Línea de Entrada

source: The input lines (they are used for the command line and for the query dialogs in the program) accept these keys:
es: Las líneas de entrada ( usadas en la línea de comandos y para los cuadros de diálogo en el programa) reconocen esas teclas:

source: B<C-a> puts the cursor at the beginning of line.
es: B<C-a> Coloca el cursor al comienzo de la línea.

source: B<C-e> puts the cursor at the end of the line.
es: B<C-e> Coloca el cursor al final de la línea.

source: B<C-b, move-left> move the cursor one position left.
es: B<C-b, Izquierda ( move-left)> Desplaza el cursor una posición a la izquierda.

source: B<C-f, move-right> move the cursor one position right.
es: B<C-f, Derecha ( move-right)> Desplaza el cursor una posición a la derecha.

source: B<M-f> moves one word forward.
es: B<M-f> Avanza una palabra.

source: B<M-b> moves one word backward.
es: B<M-b> Retrocede una palabra.

source: B<C-h, backspace> delete the previous character.
es: B<C-h, Retroespacio ( backspace)> Borra el carácter anterior.

source: B<C-d, Delete> delete the character in the point (over the cursor).
es: B<C-d, Suprimir ( Delete)> Elimina el carácter de la posición del cursor.

source: B<C-@> sets the mark for cutting.
es: B<C-@> Sitúa una marca para cortar.

source: B<C-w> copies the text between the cursor and the mark to a kill buffer and removes the text from the input line.
es: B<C-w> Copia el texto entre el cursor y la marca a la caché de eliminación y elimina el texto de la línea de entrada.

source: B<M-w> copies the text between the cursor and the mark to a kill buffer.
es: B<M-w> Copia el texto entre el cursor y la marca a la caché de eliminación.

source: B<C-y> yanks back the contents of the kill buffer.
es: B<C-y> Restaura el contenido de la caché de eliminación.

source: B<C-k> kills the text from the cursor to the end of the line.
es: B<C-k> Elimina el texto desde el cursor hasta el final de la línea.

source: B<M-p, M-n> Use these keys to browse through the command history. M-p takes you to the last entry, M-n takes you to the next one.
es: B<M-p, M-n> Usaremos esas teclas para desplazarnos a través del historial de comandos. M-p nos lleva a la última entrada, M-n nos sitúa en la siguiente.

source: B<M-C-h, M-Backspace> delete one word backward.
es: B<M-C-h, M-Retroespacio ( M-Backspace)> Borra la palabra anterior.

source: B<M-Tab> does the filename, command, variable, username and hostname completion for you.
es: B<M-Tab> Realiza una terminación del nombre de fichero, comando, variable, nombre de usuario o host.

source: Menu Bar
es: Barra de Menú

source: The menu bar pops up when you press F9 or click the mouse on the top row of the screen. The menu bar has five menus: "Left", "File", "Command", "Options" and "Right".
es: La barra de menú aparece cuando pulsamos F9 o pulsamos el botón del ratón sobre la primera fila de la pantalla. La barra de menú tiene cinco submenús: "Izquierdo", "File", "Comando", "Opciones" y "Derecho".

source: The Left and Right Menus allow you to modify the appearance of the left and right directory panels.
es: Los Menús Izquierdo y Derecho nos permiter modificar la apariencia de los paneles de directorio izquierdo y derecho.

source: The File Menu lists the actions you can perform on the currently selected file or the tagged files.
es: El Menú de Fichero lista las acciones que podemos realizar sobre el fichero actualmente seleccionado o sobre los ficheros marcados.

source: The Command Menu lists the actions which are more general and bear no relation to the currently selected file or the tagged files.
es: El Menú de Comandos lista las acciones más generales y que no guardan relación con la selección actual de ficheros.

source: Left and Right Menus
es: Menús Izquierdo y Derecho

source: The outlook of the directory panels can be changed from the B<Left> and B<Right> menus.
es: La presentación de los paneles de directorio puede ser cambiada desde los menús B<Izquierdo> y B<Derecho>.

source: Listing Mode...
es: Modo de Listado...

source: The listing mode view is used to display a listing of files, there are four different listing modes available: B<Full,> B<Brief,> B<Long,> and B<User.> The full directory view shows the file name, the size of the file and the modification time.
es: El modo de listado es usado para visualizar ficheros y sus atributos, hay cuatro modos diferentes disponibles: B<Completo ( Full),> B<Breve ( Brief),> B<Largo ( Long),> y B<Personalizado ( User).>

source: If you choose the "User" display format, then you have to specify the display format.
es: Si elejimos el modo de visualización en formato "User", deberemos especificar el formato de presentación, es decir, los atributos que deseamos que sean mostrados.

source: The user display format must start with a panel size specifier. This may be "half" or "full", and they specify a half screen panel and a full screen panel respectively.
es: El formato de presenación personalizado debe comenzar con un especificador de tamaño de panel. Este podría ser medio ( half) o completo ( full), lo cual indicaría un panel de media pantalla y un panel a toda pantalla respectivamente.

source: After the panel size, you may specify the two columns mode on the panel, this is done by adding the number "2" to the user format string.
es: Después del tamaño del panel, deberíamos especificar el modo de dos columnas en el panel, lo cual se indica añadiendo el número "2" a la cadena de formato de usuario.

source: After this you add the name of the fields with an optional size specifier. This are the available fields you may display:
es: Después de esto añadimos el nombre de los campos con un delimitador de tamaño opcional. Estos son los campos disponibles que podemos visualizar:

source: B<name,> displays the file name.
es: B<nombre ( en la versión internacional, name),> visualiza el nombre de fichero.

source: B<size,> displays the file size.
es: B<tamaño ( size),> visualiza el tamaño del fichero.

source: B<bsize,> is an alternative form of the E<lt>bf/size/ format. It displays the size of the files and for directories it just shows SUB-DIR or UP--DIR.
es: B<bsize,> es una forma alternativa del formato E<lt>bf/size/. Muestra el tamaño de los ficheros y para los directorios visualiza SUB-DIR o UP--DIR.

source: B<type,> displays a one character field type. This character is a superset of what is displayed by ls with the -F flag. An asterisk for executable files, a slash for directories, an at-sign for links, an equal sign for sockets, a hyphen for character devices, a plus sign for block devices, a pipe for fifos, a tilde for symbolic links to directories and an exclamation mark for stalled symlinks (links that point nowhere).
es: B<tipo ( type),> muestra el campo type de un carácter de extensión. Este caracter es un subconjunto de la información mostrada por el comando ls con la opción -F. Un asterisco (*) para ficheros ejecutables, una barra (/) para directorios, una arroba (@, at-sign) para los enlaces, un signo igual (=) para sockets, un guión para los dispositivos de caracteres, un signo más para dispositivos de bloque, un pipe (|) para colas, una tilde (~) para enlaces simbólicos a directorios y un signo de exclamación para enlaces perdidos (enlaces que no apuntan a ninguna parte).

source: B<mtime,> file's last modification time.
es: B<mtime,> hora de última modificación del fichero.

source: B<atime,> file's last access time.
es: B<atime,> hora del último acceso al fichero.

source: B<ctime,> file's creation time.
es: B<ctime,> hora de creación del fichero.

source: B<perm,> a string representing the current permission bits of the file.
es: B<perm,> una cadena representando los bits actuales de permisos del fichero.

source: B<mode,> an octal value with the current permission bits of the file.
es: B<mode,> un valor octal con los actuales bits de permisos del fichero.

source: B<nlink,> the number of links to the file. B<ngid,> the GID (numeric).
es: B<nlink,> número de enlaces al fichero. B<ngid,> el Identificador de Grupo, GID (numérico).

source: B<nuid,> the UID (numeric).
es: B<nuid,> el Identificador de Usuario, UID (numérico).

source: B<owner,> the owner of the file.
es: B<owner,> el propietario del fichero.

source: B<group,> the group of the file.
es: B<group,> el grupo del fichero.

source: B<inode,> the inode of the file.
es: B<inode,> el i-nodo del fichero.

source: Also you may use these field names for arranging the display:
es: Además, podemos usar estos nombres de campo para organizar la pantalla:

source: B<space,> a space in the display format.
es: B<space,> un espacio en el formato de pantalla.

source: B<mark,> An asterisk if the file is tagged, a space if it's not.
es: B<mark,> un asterisco si el fichero está marcado, o un espacio si no lo está.

source: B<|,> This character is used to add a vertical line to the display format.
es: B<|,> Este carácter es utilizado para añadir una línea vertical al formato de pantalla.

source: To force one field to a fixed size (a size specifier), you just add a ':' and then the number of characters you want the field to have, if the number is followed by the symbol '+', then the size specifies the minimum field size, if the program finds out that there is more space on the screen, it will then expand this field.
es: Para forzar un campo a un tamaño fijo (un especificador de tamaño), basta añadir el número es seguido por el símbolo '+', entonces el tamaño especifica el tamaño mínimo, aunque si el programa advierte que hay más espacio en la pantalla, entonces expandirá la anchura del campo.

source: For example, the B<Full> display corresponds to this format:
es: Por ejemplo, el listado B<Completo (Full)> corresponde a éste formato:

source: And the B<Long> display corresponds to this format:
es: Y el listado B<Largo (Long)> corresponde a este formato:

source: This is a nice user display format:
es: Éste es un bonito formato de pantalla definida por el usuario:

source: Panels may also be set to the following modes:
es: Los paneles además pueden ser activados en los siguientes modos:

source: B<Info>
es: B<Información>

source: The info view display information related to the currently selected file and if possible information about the current file system.
es: La vista de información visualiza información relacionada con el fichero seleccionado actualmente y si es posible información sobre el sistema de ficheros actual.

source: B<Tree>
es: B<Arbol>

source: The tree view is quite similar to the directory tree feature. See the section about it for more information.
es: La vista Arbol es bastante similar al árbol de directorios feature. See the section about it for more information.

source: B<Quick View>
es: B<Vista Rápida>

source: In this mode, the panel will switch to a reduced viewer that displays the contents of the currently selected file, if you select the panel (with the tab key or the mouse), you will have access to the usual viewer commands.
es: En este modo, el panel cambia a un visor reducido que muestra el contenido del fichero actualmente seleccionado, si seleccionamos el panel ( con la tecla I<tab> o el ratón), tendremos acceso a los comandos usuales del visor.

source: Sort Order...
es: Modo de Ordenación ...

source: The eight sort orders are by name, by extension, by modification time, by access time, and by inode information modification time, by size, by inode and unsorted. In the Sort order dialog box you can choose the sort order and you may also specify if you want to sort in reverse order by checking the reverse box.
es: Los ocho modos de ordenación son por nombre, por extensión, por hora de modificación, por hora de acceso, por la hora de modoficación de la información del i-nodo, por tamaño, por i-nodo y desordenado. En el cuadro de diálogo del modo de ordenación podemos elegir el modo de ordenación así como especificar si deseamos que éste se realice en orden inverso chequeando la casilla Invertir.

source: By default directories are sorted before files but this can be changed from the Options menu (option B<Mix all files> ).
es: Por defecto los directorios son ordenados antes que los ficheros pero esto puede ser cambiado desde el Menú de Opciones ( opción B<Mezcla todos los archivos> ).

source: Filter...
es: Filtro...

source: The filter command allows you to specify a shell pattern (for example B<*.tar.gz> ) which the files must match to be shown. Regardless of the filter pattern, the directories and the links to directories are always shown in the directory panel.
es: El comando de filtro nos permite seleccionar un patrón ( por ejemplo B<*.tar.gz> ) con el cual los ficheros deben coincidir para ser mostrados. Indiferente al patón de filtro, los directorios y enlaces a directorios son mostrados siempre en el panel de directorios.

source: Reread
es: Releer

source: The reread command reload the list of files in the directory. It is useful if other processes have created or removed files. If you have panelized file names in a panel this will reload the directory contents and remove the panelized information (See the section External panelize for more information).
es: El comando releer recarga la lista de ficheros en el directorio. Ésto es útil si otros procesos han creado, borrado o modificado ficheros. Si hemos panelizado have panelized los nombres de los ficheros en un panel, esto recargará los contenidos del directorio y eliminará la información panelizada ( véase la sección Panelización externa para más información).

source: File Menu
es: Menú de Archivo

source: The Midnight Commander uses the F1 - F10 keys as keyboard shortcuts for commands appearing in the file menu. The escape sequences for the Fkeys are terminfo capabilities kf1 trough kf10. On terminals without function key support, you can achieve the same functionality by pressing the ESC key and then a number in the range 1 through 9 and 0 (corresponding to F1 to F9 and F10 respectively).
es: Midnight Commander utiliza las teclas de función I<F1 - F10> como atajos de teclado para los comandos que aparecen en menú de archivo. Las secuencias de escape para las Fkeys son características de terminfo desde kf1 hasta kf10. En terminales sin soporte de teclas de función, podemos conseguir la misma funcionalidad pulsando la tecla I<ESC> seguido de un número entre 1 y 9 o 0 ( correspondiendo de I<F1 >a I<F9 >y I<F10 >respectivamente).

source: The File menu has the following commands (keyboard shortcuts in parentheses):
es: El menú de Archivo posee los siguientes comandos ( atajos de teclado entre paréntesis):

source: B<Help (F1)>
es: B<Ayuda (F1)>

source: Invokes the built-in hypertext help viewer. Inside the help viewer, you can use the Tab key to select the next link and the Enter key to follow that link. The keys Space and Backspace are used to move forward and backward in a help page. Press F1 again to get the full list of accepted keys.
es: Invoca el visor hipertexto de ayuda interno. Dentro del visor de ayuda, podemos usar la tecla I<Tab> para seleccionar el siguiente enlace y la tecla I<Enter> para seguir ese enlace. Las teclas I<Space> y I<Retroespacio> son usadas para mover adelante y atrás en una página de ayuda. Pulsando I<F1> de nuevo para obtener la lista completa de teclas válidas.

source: B<Menu (F2)>
es: B<Menú (F2)>

source: Invoke the user menu. The user menu provides an easy way to provide users with a menu and add extra features to the Midnight Commander.
es: Invoca el Menú de usuario El menú de usuario otorga una manera fácil de tener usuarios con un menú y añadir asimismo características extra a Midnight Commander.

source: B<View (F3, Shift-F3)>
es: B<Ver (> I<F3,> I<Shift-F3>B<)>

source: View the currently selected file. By default this invokes the Internal File Viewer but if the option "Use internal view" is off, it invokes an external file viewer specified by the B<PAGER> environment variable. If B<PAGER> is undefined, the "view" command is invoked. If you use Shift-F3 instead, the viewer will be invoked without doing any formatting or pre processing to the file.
es: Visualiza el fichero actualmente seleccionado. Por defecto invoca el Visor de Ficheros Interno pero si la opción "Usar visor interno" está desactivada, invoca in visor de ficheros externo especificado por la variable de entorno B<PAGER>. Si la variable B<PAGER> no está definida, se invoca al comando "ver". Si en vez de esto usamos I<Shift-F3>, el visor será invocado sin realizar ningún tipo de formateo o preprocesamiento del fichero.

source: B<Filtered View (M-!)>
es: B<Ver filtrado (> I<M-!>B<)>
