Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: this command prompts for a command and it's arguments (the argument defaults to the currently selected file name), the output from such command is shown in the internal file viewer.
es: Este comando pregunta por un comando y sus argumentos ( el argumento por defecto es el nombre del fichero actualmente seleccionado), la salida de ese comando es mostrada en el vidor de ficheros interno.

source: B<Edit (F4)>
es: B<Editar (> I<F4>B<)>

source: Currently it invokes the B<vi> editor, or the editor specified in the B<EDITOR> environment variable, or the Internal File Editor if the use_internal_edit option is on.
es: Actualmente invoca el editor B<vi>, u otro especificado en la variable de entorno B<EDITOR,> o en el Editor de Ficheros Interno si la opción B<use_internal_edit> está activada.

source: B<Copy (F5)>
es: B<Copiar (> I<F5>B<)>

source: Pop up an input dialog with destination that defaults to the directory in the non-selected panel and copies the currently selected file (or the tagged files, if there is at least one file tagged) to the directory specified by the user in the input dialog. During this process, you can press C-c or ESC to abort the operation. For details about source mask (which will be usually either * or ^\e(.*\e)$ depending on setting of Use shell patterns) and possible wildcards in the destination see Mask copy/rename.
es: Sobreimpresiona una ventana de entrada con destino por defecto al directorio delpanel no seleccionado y copia el fichero actualmente seleccionado ( o los ficheros marcados, si hay al menos uno marcado) al directorio especicado por el usuario en la ventana. Durante este proceso, podemos pulsar I<C-c >ó I<ESC> para anular la operación. Para más detalles sobre la máscara de origen ( que será normalmente * o ^\e(.*\e)$ dependiendo de la selecciónde Uso de los patrones del shell) y los posibles comodines en destino véase Máscara copiar/renombrar.

source: On some systems, it is possible to do the copy in the background by clicking on the background button (or pressing M-b in the dialog box). The Background Jobs is used to control the background process.
es: En algunos sistemas, es posible hacer la copia en segundo plano pulsando en el botón de segundo planio con el ratón ( o pulsando I<M-b> en el cuadro de diálogo). Los Trabajos en Segundo Plano son utilizados para controlar los procesos en segundo plano.

source: B<Link (C-x l)>
es: B<Ligar (Enlazar,> I<C-x l> B<)>

source: Create a hard link to the current file.
es: Crea un enlace al fichero actual.

source: B<SymLink (C-x s)>
es: B<Liga simbólica (Enlace simbólico, C-x s)>

source: Create a symbolic link to the current file. To those of you who don't know what links are: creating a link to a file is a bit like copying the file, but both the source filename and the destination filename represent the same file image. For example, if you edit one of these files, all changes you make will appear in both files. Some people call links aliases or shortcuts.
es: Crea un enlace simbólico al fichero actual. Para aquellos que no conozcan que son los enlaces: crear un enlace a un fichero es algo parecido a copiar el fichero, salvo que el fichero original y el destino representan el mismo fichero físico, los mismos datos reales. Por ejemplo, si editamos uno de esos ficheros, todos los cambios que realicemos aparecerán en ambos ficheros. Hay quien llama a los enlaces alias o accesos directos.

source: A hard link appears as a real file. After making it, there is no way of telling which one is the original and which is the link. If you delete either one of them the other one is still intact. It is very difficult to notice that the files represent the same image. Use hard links when you don't even want to know.
es: Un enlace aparece como un fichero real. Después de crearlo, no hay modo de decir cúal es el original y cúal el enlace. Si borramos uno de ellos el otro aún seguirá intacto. Es muy difícil advertir que los ficheros representan la misma imagen. Usaremos estos enlaces cuando no necesitemos saberlo.

source: A symbolic link is a reference to the name of the original file. If the original file is deleted the symbolic link is useless. It is quite easy to notice that the files represent the same image. The Midnight Commander shows an "@"-sign in front of the file name if it is a symbolic link to somewhere (except to directory, where it shows a tilde (~)). The original file which the link points to is shown on mini-status line if the I<Show mini-status> option is enabled. Use symbolic links when you want to avoid the confusion that can be caused by hard links.
es: Un enlace simbólico es una referencia al nombre del fichero original. Si el fichero original es borrado, el enlace simbólico queda sin utilidad. Es bastante fácil advertir que los ficheros representan la misma imagen. Midnight Commander muestra un símbolo "@" delante del nombre del fichero si es un enlace simbólico a alguna parte ( excepto a un directorio, caso en que muestra una tilde (~)). El fichero original al cual el enlace apunta es mostrado en la línea de estado si la opción I<Mini status> está habilitada. Usaremos enlaces simbólicos cuando queramos evitar la confusión que pueden causar los enlaces físicos.

source: B<Rename/Move (F6)>
es: B<Renombrar/mover (F6)>

source: Pop up an input dialog that defaults to the directory in the non-selected panel and moves the currently selected file (or the tagged files if there is at least one tagged file) to the directory specified by the user in the input dialog. During the process, you can press C-c or ESC to abort the operation. For more details look at Copy operation above, most of the things are quite similar.
es: Sobreimpresiona una ventana de entrada que defectivamente apunta al directorio en el panel no seleccionado y mueve el fichero actualmente seleccionado ( o los ficheros marcados si hay al menos uno) al directorio especificado por el usuario en la ventana. durante el proceso, podemos pulsar I<C-c >ó I<ESC >para anular la operación. Para más detalles, véase la operación Copiar más arriba, dado que la mayoría de los aspectos son similares.

source: On some systems, it is possible to do the copy in the background by clicking on the background button (or pressing M-b in the dialog box). The Background Jobs is used to control the background process.
es: En algunos sistemas, es posible hacer la copia en segundo plano pulsando con el ratón en el susodicho botón de segundo plano ( o pulsando I<M-b>enI<el>cuadroI<de>diálogo).I<Los> Trabajos en Segundo Plano es utilizado para controlar los procesos en segundo plano.

source: B<Mkdir (F7)>
es: B<Crear directorio (F7)>

source: Pop up an input dialog and creates the directory specified.
es: Sobreimpresiona una ventana de entrada y crea el directorio especificado.

source: B<Delete (F8)>
es: B<Borrar (F8)>

source: Delete the currently selected file or the tagged files in the currently selected panel. During the process, you can press C-c or ESC to abort the operation.
es: Borra el fichero actualmente seleccionado o los ficheros marcados en el panel activo. Durante el proceso, podremos pulsar C-c o ESC para anular la operación.

source: B<Quick cd (M-c)> Use the quick cd command if you have full command line and want to cd somewhere.
es: B<Cambio rápido de directorio (M-c)> Usaremos el comando Cambiar de directorio si tenemos llena la línea de comandos y queremos hacer un cd a algún lugar.

source: B<Select group (+)>
es: B<Seleciona grupo (+)>

source: This is used to select (tag) a group of files. The Midnight Commander will prompt for a regular expression describing the group. When I<Shell Patterns> are enabled, the regular expression is much like the filename globbing in the shell (* standing for zero or more characters and ? standing for one character). If I<Shell Patterns> is off, then the tagging of files is done with normal regular expressions (see ed (1)).
es: Es usado para seleccionar ( marcar) un grupo de ficheros. Midnight Commander preguntará por una expresión regular describiendo el grupo. Cuando los I<Patrones del Shell> están habilitados, la expresión regular es tal y como lo es en el shell (* para cero o más caracteres y ? para un carácter). Si los I<Patrones del Shell> están desactivados, entonces la selección de ficheros se realiza con expresiones regulares normales (VA ed (1)).

source: To mark directories instead of files, the expression must start or end with a '/'.
es: Para marcar directorios en vez de ficheros, la expresión debe empezar o terminar con '/'.

source: B<Unselect group (\e)>
es: B<De-selecciona grupo (\e)>

source: Used for unselecting a group of files. This is the opposite of the I<Select group> command.
es: Utilizado para desseleccionar un grupo de ficheros. Es la operación antagonista al comando I<Seleciona grupo>.

source: B<Quit (F10, Shift-F10)>
es: B<Salir (F10, Shift-F10)>

source: Terminate the Midnight Commander. Shift-F10 is used when you want to quit and you are using the shell wrapper. Shift-F10 will not take you to the last directory you visited with the Midnight Commander, instead it will stay at the directory where you started the Midnight Commander.
es: Finaliza Midnight Commander. Shift-F10 es usado cuando queremos salir y estamos utilizando la envoltura del shell. Shift-F10 no nos llevará al último directorio visitado con Midnight Commander, en vez de eso nos llevará al directorio donde fue invocado Midnight Commander.

source: Quick cd
es: Cambiar de directorio

source: This command is useful if you have a full command line and want to cd somewhere without having to yank and paste the command line. This command pops up a small dialog, where you enter everything you would enter after B<cd> on the command line and then you press enter. This features all the things that are already in the internal cd command.
es: Este comando es útil si tenemos competa la linea de comandos y queremos hacer un cd a algún lugar sin tener que cortar y pegar sobre la línea. Este comando sobre impresiona una pequeña ventana, donde introducimos todo aquello que es válido como argumento del comando B<cd> en la línea de comandos y después pulsamos enter. Este comando caracteriza todas las cualidades incluidas en el comando cd interno.

source: Command Menu
es: Menú de Comando

source: The Directory tree command shows a tree figure of the directories.
es: El comando Árbol de directorios muestra una figura con estructura de árbol con los directorios.

source: The Find file command allows you to search for a specific file. The "Swap panels" command swaps the contents of the two directory panels.
es: El comando Buscar fichero permite buscar un fichero específico. El comando "Intercambiar paneles" intercambia los contenidos de los dos paneles de directorios.

source: The "Panels on/off" command shows the output of the last shell command. This works only on xterm and on Linux and SCO console.
es: El comando "Activa/desactiva paneles" muestra la salida del último comando del shell. Ésto funciona sólo en xterm y en una consola Linux y SCO.

source: The Compare directories (C-x d) command compares the directory panels with each other. You can then use the Copy (F5) command to make the panels identical. There are three compare methods. The quick method compares only file size and file date. The thorough method makes a full byte-by-byte compare. The thorough method is not available if the machine does not support the mmap(2) system call. The size-only compare method just compares the file sizes and does not check the contents or the date times, it just checks the file size.
es: El comando Compara directorios (C-x d) compara los paneles de directorio uno con el otro. Podemos usar el comando Copiar (F5) para hacer ambos paneles idénticos. Hay tres métodos de comparación. El método rápido compara sólo el tamaño de fichero y la fecha. El método completo realiza una comparación completa octeto a octeto. El método completo no está isponible si la máquina no soporta la llamada de sistema mmap(2). El método de comparación de sólo tamaño sólo compara los tamaños de fichero y no chequea los contenidos o las fechas, sólo chequea los tamaños de los ficheros.

source: The Command history command shows a list of typed commands. The selected command is copied to the command line. The command history can also be accessed by typing M-p or M-n.
es: El comando Histórico de comandos muestra una lista de los comandos escritos. El comando seleccionado es copiado a la línea de comandos. El histórico de comandos puede ser accedido también tecleando M-p ó M-n.

source: The Directory hotlist (C-\e) command makes changing of the current directory to often used directories faster.
es: El comando Lista de directorios frecuentes(C-\e) realiza el cambio desde el directorio actual a directorios utilizados a menudo más rapidamente.

source: The External panelize allows you to execute an external program, and make the output of that program the contents of the current panel.
es: La Panelización externa nos permite ejecutar un programa externo, y realiza la salida de ese programa al panel actual.

source: Extension file edit command allows you to specify programs to executed when you try to execute, view, edit and do a bunch of other thing on files with certain extensions (filename endings). The Menu file edit command may be used for editing the user menu (which appears by pressing F2).
es: El comando Edición del archivo de extensiones nos permite especificar los programas a ejecutar para intentar ejecutar, ver, editar y realizar un montón de cosas sobre ficheros con ciertas extensiones ( terminaciones de fichero). Por ejemplo, asociar la extensión de los ficheros de audio de SUN (.au) con el programa reproductor adecuado. El comando Edición del archivo de extensiones podría ser usado para editar el menú de usuario (el cual aparece pulsando F2).

source: Directory Tree
es: Árbol de Directorios

source: The Directory Tree command shows a tree figure of the directories. You can select a directory from the figure and the Midnight Commander will change to that directory.
es: El comando Árbol de directorios muestra una figura con la estructura de los directorios. Podemos seleccionar un directorio de la figura y Midnight Commander cambiará a ese directorio.

source: There are two ways to invoke the tree. The real directory tree command is available from Commands menu. The other way is to select tree view from the Left or Right menu.
es: Hay dos modos de invocar el árbol. El comando de árbol de directorios está disponible desde el menú Comando. El otro modo es seleccionar la vista en árbol desde el menú Izquyierdo o Derecho.

source: To get rid of long delays the Midnight Commander creates the tree figure by scanning only a small subset of all the directories. If the directory which you want to see is missing, move to its parent directory and press C-r (or F2).
es: Para evitar largos retardos Midnight Commander crea la figura de árbol escaneando solamente un pequeño subconjunto de todos los directorios. Si el directorio que queremos ver no está, nos moveremos hasta su directorio padre y pulsaremos C-r (o F2).

source: You can use the following keys:
es: Podemos utilizar las siguientes teclas:

source: General movement keys are accepted.
es: Teclas de Movimiento General válidas.

source: B<Enter.> In the directory tree, exits the directory tree and changes to this directory in the current panel. In the tree view, changes to this directory in the other panel and stays in tree view mode in the current panel.
es: B<Enter.> En el árbol de directorios, sale del árbol de directorios y cambia al directorio en el panel actual. En la vista de árbol, cambia a este directorio en el otro panel y permanece en el modo de vista Árbol en el panel actual.

source: B<C-r, F2 (Rescan).> Rescan this directory. Use this when the tree figure is out of date: it is missing subdirectories or shows some subdirectories which don't exist any more.
es: B<C-r, F2 (Releer).> Relee este directorio. Usaremos este comando cuando el árbol de directorios esté anticuado: hay directorios perdidos o muestra algunos directorios que no existen ya.

source: B<F3 (Forget).> Delete this directory from the tree figure. Use this to remove clutter from the figure. If you want the directory back to the tree figure press F2 in its parent directory.
es: B<F3 (Olvidar).> Borra ese directorio de la figura del árbol. Usaremos esto para eliminar desorden de la figura. Si queremos que el directorio vuelva a la figura del árbol pulsaremos F2 en su directorio padre.

source: B<F4 (Static/Dynamic).> Toggle between the dynamic navigation mode (default) and the static navigation mode.
es: B<F4 (Estático/Dinámico, Dinam/Estát).> Intercambia entre el modo de navegación dinámico (predefinido) y el modo estático.

source: In the static navigation mode you can use the Up and Down keys to select a directory. All known directories are shown.
es: En el modo de navegación estático podemos usar las teclas del cursor Arriba y Abajo para seleccionar un directorio. Todos los directorios conocidos serán mostrados.

source: In the dynamic navigation mode you can use the Up and Down keys to select a sibling directory, the Left key to move to the parent directory, and the Right key to move to a child directory. Only the parent, sibling and children directories are shown, others are left out. The tree figure changes dynamically as you traverse.
es: En el modo de navegación dinámico podemos usar las teclas del cursor Arriba y Abajo para seleccionar el directorio hermano, la tecla Izquierda para situarnos en el directorio padre, y la tecla Derecha para situarnos en el directorio hijo. Sólo los directorios padre, hijo y hermano son mostrados, el resto son dejados fuera. La figura de árbol cambia dinámicamente conforme nos desplazamos sobre ella.

source: B<F5 (Copy).> Copy the directory.
es: B<F5 (Copiar).> Copia el directorio.

source: B<F6 (RenMov).> Move the directory.
es: B<F6 (Renombrar/Mover, RenMov).> Mueve el directorio.

source: B<F8 (Delete).> Delete this directory from the file system.
es: B<F8 (Eliminar).> Elimina este directorio del sistema de ficheros.

source: B<C-s, M-s.> Search the next directory matching the search string. If there is no such directory these keys will move one line down.
es: B<C-s, M-s.> Busca el siguinte directorio coincidente con la cadena de búsqueda. Si no hay tal directorio esas teclas moverán una línea abajo.

source: B<C-h, Backspace.> Delete the last character of the search string.
es: B<C-h, Retroespacio.> Borra el último carácter de la cadena de búsqueda.

source: B<Any other character.> Add the character to the search string and move to the next directory which starts with these characters. In the tree view you must first activate the search mode by pressing C-s. The search string is shown in the mini status line.
es: B<Cualquier otro carácter.> Añade el carácter a la cadena de búsqueda y se desplaza al siguiente directorio que comienza con esos caracteres. En la vista de árbol debemos primero activar el modo de búsqueda pulsando C-s. La cadena de búsqueda es mostrada en la línea de mini-estado.

source: The following actions are available only in the directory tree. They aren't supported in the tree view.
es: Las siguientes acciones están disponibles sólo en el árbol de directorios. No son funcionales en la vista de árbol.

source: B<F1 (Help).> Invoke the help viewer and show this section.
es: B<F1 (Ayuda).> Invoca el visor de ayuda y muestra ésta sección.

source: B<Esc, F10.> Exit the directory tree. Do not change the directory.
es: B<Esc, F10.> Sale del árbol de directorios. No cambia el directorio.

source: The mouse is supported. A double-click behaves like Enter. See also the section on mouse support.
es: El ratón es soportado. Un doble Click se comporta como pulsar Enter. Véase también la sección sobre soporte de ratón.

source: Find File
es: Buscar Fichero

source: The Find File feature first asks for the start directory for the search and the filename to be searched for. By pressing the Tree button you can select the start directory from the directory tree figure.
es: La opción Buscar Fichero primero pregunta por el directorio inicial para la búsqueda y el nombre de fichero a buscar. Pulsando el botón árbol podemos seleccionar el directorio inicial desde el Árbol de directorios.

source: The contents field accepts regular expressions similar to egrep(1). That means you have to escape characters with a special meaning to egrep with "\e", e.g. if you search for "strcmp (" you will have to input "strcmp \e(" (without the double quotes).
es: El campo de contenidos acepta axpresiones regulares similares a egrep(1). Eso significa que tenemos caracteres de escape con significado especial para egrep con "\e", p.e. si buscamos "strcmp (" tendremos que introducir "strcmp \e(" (sin las dobles comillas).

source: You can start the search by pressing the Ok button. During the search you can stop from the Stop button and continue from the Start button.
es: Podemos iniciar la búsqueda pulsando el botón Aceptar. Durante el proceso de búsqueda podemos detenerla desde el botón Terminar.

source: You can browse the filelist with the up and down arrow keys. The Chdir button will change to the directory of the currently selected file. The Again button will ask for the parameters for a new search. The Quit button quits the search operation. The Panelize button will place the found files to the current directory panel so that you can do additional operations on them (view, copy, move, delete and so on). After panelizing you can press C-r to return to the normal file listing.
es: Podemos navegar por la lista de ficheros con las teclas del cursor Arriba y Abajo. El botón Chdir cambiará al directorio del fichero actualmente seleccionado. El botón "Otra vez" preguntará los parámetros para una nueva búsqueda. El botón Terminar finaliza la operación de búsqueda. El botón Panelizar colocará los ficheros encontrados en el panel actual y así podremos realizar más operaciones con ellos (ver, copiar, mover, borrar y demás). Después de panelizar podemos pulsar C-r para regresar al listado normal de ficheros.

source: It is possible to have a list of directories that the Find File command should skip during the search (for example, you may want to avoid searches on a CDROM or on a NFS directory that is mounted across a slow link).
es: Es posible tener una lista de directorios que el comando Buscar Fichero debería saltar durante la búsqueda (por ejemplo, podemos querer evitar búsquedas en un CDROM o en un directorio NFS que está montado a través de un enlace lento).

source: Directories to be skipped should be set on the variable B<find_ignore_dirs> in the B<Misc> section of your ~/.mc/ini file.
es: Los directorios a ser omitidos deberían ser enumerados en la variable B<find_ignore_dirs> en la sección B<Misc> de nuestro fichero ~/.mc/ini.

source: Directory components should be separated with a colon, here is an example:
es: Los componentes del directorio deberían ser separados por dos puntos, como en el ejemplo que sigue:

source: You may consider using the External panelize command for some operations. Find file command is for simple queries only, while using External panelize you can do as mysterious searches as you would like.
es: Podríamos considerar la utilización de la Panelización externa command for some operations. Find file command is for simple queries only, while using External panelize you can do as mysterious searches as you would like.

source: External panelize
es: Panelizacion Externa
