Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: NAME
es: NOMBRE

source: mc - Visual shell for Unix-like systems.
es: mc - Entorno visual para sistemas tipo Unix.

source: USAGE
es: USO

source: B<mc> [-abcCdfhPstuUVx?] [-l log] [dir1 [dir2]] [-v file]
es: B<mc> [-abcCdfhPstuUVx?] [-l log] [dir1 [dir2]] [-v fichero]

source: DESCRIPTION
es: DESCRIPCIÓN

source: The Midnight Commander is a directory browser/file manager for Unix-like operating systems.
es: Midnight Commander es un navegador de directorios/gestor de ficheros para sistemas operativos tipo Unix.

source: OPTIONS
es: OPCIONES

source: Disables the usage of graphic characters for line drawing.
es: Deshabilita el uso de caracteres gráficos para el dibujo de líneas.

source: Forces black and white display.
es: Fuerza el uso de la pantalla de Blanco y Negro.

source: Force color mode, please check the section Colors for more information.
es: Fuerza el uso del modo color, por favor chequear la seción Colores para más información.

source: Used to specify a different color set in the command line. The format of arg is documented in the Colors section.
es: Usado para especificar un juego de colores diferentes en la línea de comandos. El formato de arg está documentado en la sección Colores.

source: Disables mouse support.
es: Deshabilita el soporte de ratón.

source: Displays the compiled-in search paths for Midnight Commander files.
es: Muestra las rutas de búsqueda compiladas para ficheros de Midnight Commander.

source: Reset softkeys to their default from the termcap/terminfo database. Only useful on HP terminals when the function keys don't work.
es: Resetea softkeys a su valor por defecto según la base de datos de termcap/terminfo. Sólo útil en terminales HP cuando la función keys no funciona.

source: I<-l file>
es: I<-l fichero>

source: Save the ftpfs dialog with the server in file.
es: Guarda el diálogo ftpfs con el servidor en el fichero.

source: At program end, the Midnight Commander will print the last working directory; this, along with the shell function below, will allow you to browse through your directories and automatically move to the last directory you were in (thanks to Torben Fjerdingstad and Sergey for contributing this function and the code which implements this option).
es: Al final del programa, Midnight Commander imprimirá el último directorio de trabajo ; esto, junto con la función del shell abajo descrita, nos permitirá navegar a través de nuestros directorios y movernos automaticamente al último directorio en el que estuvimos ( Gracias a Torben Fjerdingstad y Sergey por su contribución con ésta función y el código que implementa esta opción).

source: bash and zsh users:
es: usuarios de bash y zsh:

source: tcsh users: alias mc 'setenv MC `/usr/bin/mc -P \!*`; cd $MC; unsetenv MC'
es: usuarios tcsh: alias mc 'setenv MC `/usr/bin/mc -P \!*`; cd $MC; unsetenv MC'

source: I know the bash function could be shorter for zsh and bash but the
es: Soy consciente de que la función podría ser más breve para zsh y bash pero los

source: backquotes on bash won't accept your suspension the program with C-z.
es: apóstrofes (`) en bash no aceptarán tu suspensión de programa con C-z.

source: Turns on the slow terminal mode, in this mode the program will not draw expensive line drawing characters and will toggle verbose mode off.
es: Activa el modo terminal lento, en éste modo el programa no dibuja costosas lineas de caracteres y desactivará el modo detallado ( verbose mode).

source: Used only if the code was compiled with Slang and terminfo: it makes the Midnight Commander use the value of the B<TERMCAP> variable for the terminal information instead of the information on the system wide terminal database
es: Usado sólo si el código fue compilado con Slang y terminfo: hace que Midnight Commander use el valor de la variable B<TERMCAP> para la información de terminal en vez de la información en la amplia base de datos del terminal sistema ( system wide terminal database)

source: Disables the use of a concurrent shell (only makes sense if the Midnight Commander has been built with concurrent shell support).
es: Deshabilita el uso de un shell concurrente ( sólo tiene sentido si el Midnight Commander ha sido construido con el soporte de shell concurrente).

source: Enables the use of the concurrent shell support (only makes sense if the Midnight Commander was built with the subshell support set as an optional feature).
es: Habilita el uso del soporte de shell concurrente ( sólo tiene sentido si Midnight Commander fue construido con el juego de soporte de subshell como una característica optional).

source: I<-v file>
es: I<-v fichero>

source: Enters the internal viewer to view the file specified.
es: Especifica el visor interno para visualizar el fichero especificado.

source: Displays the version of the program.
es: Muestra la versión del programa.

source: Forces xterm mode. Used when running on xterm-capable terminals (two screen modes, and able to send mouse escape sequences).
es: Fuerza el modo xterm. Usado cuando se ejecuta en terminales con características de xterm ( dos modos de pantalla, y pueden enviar secuencias de escape de ratón).

source: If specified, the first path name is the directory to show in the selected panel; the second path name is the directory to be shown in the other panel.
es: Si se especifica, el primer nombre de ruta de acceso es el directorio a mostrar en el panel seleccionado; la segunda ruta es el directorio a ser mostrado en el otro panel.

source: Overview
es: Introducción

source: The screen of the Midnight Commander is divided into four parts. Almost all of the screen space is taken up by two directory panels. By default, the second bottommost line of the screen is the shell command line, and the bottom line shows the function key labels. The topmost line is the menu bar line. The menu bar line may not be visible, but appears if you click the topmost line with the mouse or press the F9 key.
es: La pantalla de Midnight Commander está divida en cuatro partes. La mayor parte del espacio de la pantalla es usado para los dos paneles de directorio. Por defecto, la segunda línea más inferior de la pantalla es la línea de comandos del shell, y la línea inferior muestra las etiquetas de las teclas de función. La línea superior es la línea de la barra de menú. La línea de la barra de menú podría no ser visible, pero aparece si pulsamos en la primea línea de la pantalla con el ratón o pulsamos la tecla F9.

source: The Midnight Commander provides a view of two directories at the same time. One of the panels is the current panel (a selection bar is in the current panel). Almost all operations take place on the current panel. Some file operations like Rename and Copy by default use the directory of the unselected panel as a destination (don't worry, they always ask you for confirmation first). For more information, see the sections on the Directory Panels, the Left and Right Menus and the File Menu.
es: El Midnight Commander provee una vista de dos directorios al mismo tiempo. Uno de los paneles es el panel actual ( una barra de selección está en el panel actual). La mayoría de las operaciones tienen lugar en el panel actual. Algunas operaciones con ficheros como Renombrar y copiar por defecto utilizan el directorio del panel deselecionado como destino ( no nos preocupemos, ellos siempre solicitan nuestra confirmación primero). Para más información, ver las secciones sobre los Paneles de Directorio, los Menús Izquierdo ( Left) y Derecho ( Right) y el Menú de Fichero.

source: You can execute system commands from the Midnight Commander by simply typing them. Everything you type will appear on the shell command line, and when you press Enter the Midnight Commander will execute the command line you typed; read the Shell Command Line and Input Line Keys sections to learn more about the command line.
es: Podemos ejecutar comandos del sistema desde el Midnight Commander simplemente escribiéndolos. Todo lo que escribamos aparecerá en la línea de comandos del shell y cuando pulsemos Enter, Midnight Commander ejecutará la línea de comandos que tecleamos; leáse las secciones Línea de Comandos del Shell y Teclas de la Línea de Entrada para aprender más sobre la línea de comandos.

source: Mouse Support
es: Soporte de Ratón

source: The Midnight Commander comes with mouse support. It is activated whenever you are running on an B<xterm(1)> terminal (it even works if you take a telnet or rlogin connection to another machine from the xterm) or if you are running on a Linux console and have the B<gpm> mouse server running.
es: Midnight Commander viene con soporte de ratón. Es activado cuando estamos ejecutándolo bajo un terminal tipo B<xterm(1)> ( lo cual sucede incluso si realizamos una conexión de telnet o rlogin a otra máquina desde el xterm) o si nosotros estamos ejecutándolo bajo una consola Linux y tenemos el servidor B<gpm> cargado.

source: When you left click on a file in the directory panels, that file is selected; if you click with the right button, the file is marked (or unmarked, depending on the previous state).
es: Cuando pulsamos el botón izquierdo del ratón sobre un fichero en los paneles de directorios, ese fichero es seleccionado; si lo hacemos con el botón derecho, el fichero es marcado ( o desmarcado, dependiendo del estado previo).

source: Double-clicking on a file will try to execute the command if it is an executable program; and if the extension file has a program specified for the file's extension, the specified program is executed.
es: Una doble pulsación sobre un fichero intentará ejecutar el comando si se trata de un programa ejecutable; y si la extensión del fichero tiene un programa especificado para la extensión del fichero, el programa especificado es ejecutado.

source: Also, it is possible to execute the commands assigned to the function key labels by clicking on them.
es: Además, es posible ejecutar los comandos asignados a las etiquetas de las teclas de función pulsando con el ratón sobre ellas.

source: If a mouse button is clicked on the top frame line of the directory panel, it is scrolled one pageful backward. Correspondingly, a click on the bottom frame line will cause a scroll of one pageful forward. This frame line method works also in the Help Viewer and the Directory Tree.
es: Si se pulsa con el botón de ratón el la línea divisoria superior del panel de directorio, se realizas un scroll de una página hacia atrás. Así mismo, una pulsación sobre la línea divisoria inferior produce un scroll de una página hacia delante. Éste método de la línea divisoria funciona también con el Visor de Ayuda y el Árbol de directorios.

source: The default auto repeat rate for the mouse buttons is 400 milliseconds. This may be changed to other values by editing the \&~/.mc/ini file and changing the I<mouse_repeat_rate> parameter.
es: El valor por defecto de auto repetción para los botones del ratón es 400 milisegundos. Ésto puede ser cambiado por otros valores cambiando el fichero \&~/.mc/ini y cambiando el parámetro I<mouse_repeat_rate>.

source: If you are running the Commander with the mouse support, you can bypass the Commander and get the default mouse behavior (cutting and pasting text) by holding down the Shift key.
es: Si estamos ejecutando Commander con el soporte de ratón, podemos dejar de lado el Commander y obtener el comportamiento por defecto del ratón ( cortando y pegando texto) manteniendo pulsada la tecla Shift.

source: Keys
es: Teclas

source: Some commands in the Midnight Commander involve the use of the I<Control> (sometimes labeled CTRL or CTL) and the I<Meta> (sometimes labeled ALT or even Compose) keys. In this manual we will use the following abbreviations:
es: Algunos comandos en Midnight Commander implican el uso de las teclas I<Control> ( algunas veces representado por CTRL o CTL) y I<Meta> ( algunas veces denominado ALT o incluso Compose). En este manual usaremos las siguientes abreviaturas:

source: C-E<lt>chrE<gt> means hold the Control key while typing the character E<lt>chrE<gt>. Thus C-f would be: hold the Control key and type f.
es: C-E<lt>chrE<gt> significa mantener pulsada la tecla Control mientras pulsamos el carácter E<lt>chrE<gt>. Así C-f sería: manteniendo pulsada la tecla Control teclear f.

source: M-E<lt>chrE<gt> means hold the Meta or Alt key down while typing E<lt>chrE<gt>. If there is no Meta or Alt key, type ESC, release it, then type the character E<lt>chrE<gt>.
es: M-E<lt>chrE<gt> msignifica mantener pulsada la tecla Meta o Alt mientras pulsamos el carácter E<lt>chrE<gt>. Si no hay tecla Meta o Alt, pulsar ESC, soltar, y entonces pulsar el carácter E<lt>chrE<gt>.

source: All input lines in the Midnight Commander use an approximation to the GNU Emacs editor's key bindings.
es: Todas las líneas de entrada en Midnight Commander usan una aproximación a las prerrogativas de teclado del editor GNU Emacs.

source: There are many sections which tell about the keys. The following are the most important.
es: Hay muchas secciones que hablan de las teclas. Las siguientes son las más importantes.

source: The File Menu section documents the keyboard shortcuts for the commands appearing in the File menu. This section includes the function keys. Most of these commands perform some action, usually on the selected file or the tagged files.
es: La sección Menú de Fichero documenta los atajos de teclado para los comandos que aparecen en el Menú de Fichero. Ésta sección incluye las teclas de función. La mayor parte de esos comandos realizan alguna acción, normalmente sobre el fichero selecionado o sobre los ficheros marcados.

source: The Directory Panels section documents the keys which select a file or tag files as a target for a later action (the action is usually one from the file menu).
es: La sección Paneles de Directorio documenta las teclas que seleccionan un fichero o marcan ficheros como objetivo de una acción posterior ( la acción normalmente es una del menú de fichero).

source: The Shell Command Line section list the keys which are used for entering and editing command lines. Most of these copy file names and such from the directory panels to the command line (to avoid excessive typing) or access the command line history.
es: La sección Linea de Comando del Shell lista las teclas que son usadas para introducir o editar líneas de comandos. La mayor parte de ellas copian nombres de ficheros y demás desde los paneles de directorio a la línea de comando ( para evitar un tecleado excesivo) o acceden al historial de la línea de comandos.

source: Input Line Keys are used for editing input lines. This means both the command line and the input lines in the query dialogs.
es: Teclas de línea de Entrada Son usadas para editar líneas de entrada. Esto implica la línea de comandos y las líneas de entrada en las ventanas de preguntas.

source: Miscellaneous Keys
es: Otras Teclas

source: Here are some keys which don't fall into any of the other categories:
es: Tienen cabida aquí algunas teclas que no encajan completamente en ninguna de las enteriores categorías:

source: B<Enter.> If there is some text in the command line (the one at the bottom of the panels), then that command is executed. If there is no text in the command line then if the selection bar is over a directory the Midnight Commander does a B<chdir(2)> to the selected directory and reloads the information on the panel; if the selection is an executable file then it is executed. Finally, if the extension of the selected file name matches one of the extensions in the extensions file then the corresponding command is executed.
es: B<Enter.> Si hay algún texto en la línea de comandos ( la de la parte inferior de los paneles), entonces ese comando es ejecutado. Si no hay texto en la línea de comandos entonces si la barra de selección está situada sobre un directorio Midnight Commander realiza un B<chdir(2)> al directorio seleccionado y recarga la información en el panel; si la selección es un fichero ejecutable entonces es ejecutado. Por último, si la extensión del fichero seleccionado coincide con una de las extensiones en el fichero de extensiones entonces es ejecutado el comando correspondiente.

source: B<C-l.> Repaint all the information in the Midnight Commander.
es: B<C-l.> Redibuja toda la información en la pantalla de Midnight Commander.

source: B<C-x c.> Run the Chmod command on a file or on the tagged files.
es: B<C-x c.> Ejecuta el comando Chmod en un fichero o un conjunto de ficheros marcados.

source: B<C-x o.> Run the Chown command on the current file or on the tagged files.
es: B<C-x o.> Ejecuta el comando Chown sobre el fichero actual o sobre los ficheros marcados.

source: B<C-x l.> Run the link command.
es: B<C-x l.> Ejecuta el comando enlazado.

source: B<C-x s.> Run the symbolic link command.
es: B<C-x s.> Ejecuta el comando enlazado simbólicamente.

source: B<C-x i.> Set the other panel display mode to information.
es: B<C-x i.> Selecciona el modo de la pantalla del otro panel a información.

source: B<C-x q.> Set the other panel display mode to quick view.
es: B<C-x q.> Selecciona el modo de la pantalla del otro panel a vista rápida.

source: B<C-x !.> Execute the External panelize command.
es: B<C-x !.> Ejecuta el comando de panelización externa

source: B<C-x h> Run the add directory to hotlist command.
es: B<C-x h> Ejecuta el comando añadir a la Lista Rápida de Directorios

source: B<M-!,> Executes the Filtered view command, described in the view command.
es: B<M-!,> Ejecuta el comando de Vista Filtrada, descrito en el comando Ver.

source: B<M-?,> Executes the Find file command.
es: B<M-?,> Ejecuta el comando Buscar fichero

source: B<M-c,> Pops up the quick cd dialog.
es: B<M-c,> Muestra la ventana de diálogo del comando cd Rápido.

source: B<C-o,> When the program is being run in the Linux or SCO console or under an xterm, it will show you the output of the previous command. When ran on the Linux console, the Midnight Commander uses an external program (cons.saver) to handle saving and restoring of information on the screen.
es: B<C-o,> Cuando el programa está siendo ejecutado en la consola Linux o SCO o bajo un xterm, se mostrará la salida del comando anterior. Cuando fuere ejecutado en una consola de Linux, Midnight Commander usa un programa externo (cons.saver) para controlar la copia y restauración de información en la pantalla.

source: When the subshell support is compiled in, you can type C-o at any time and you will be taken back to the Midnight Commander main screen, to return to your application just type C-o. If you have an application suspended by using this trick, you won't be able to execute other programs from the Midnight Commander until you terminate the suspended application.
es: Cuando el soporte de subshell está compilado internamente, podemos pulsar C-o en cualquier momento y seremos llevados de vuelta a la pantalla principal de Midnight Commander, para volver a nuestra aplicación basta con volver a pulsar C-o. Si tenemos una aplicación suspendida usando esta técnica, no podremos ejecutar otros pprogramas desde Midnight Commander hasta que terminemos la aplicación suspendida.

source: Directory Panels
es: Paneles de Directorio

source: This section lists the keys which operate on the directory panels. If you want to know how to change the appearance of the panels take a look at the section on Left and Right Menus.
es: Esta sección enumera las teclas que operan en los paneles de directorio. Si queremos saber cómo cambiar la apariencia de los paneles, deberemos hechar un vistazo a la sección Menús Izquierdo y Derecho.

source: B<Tab, C-i.> Change the current panel. The old other panel becomes the new current panel and the old current panel becomes the new other panel. The selection bar moves from the old current panel to the new current panel.
es: B<Tab, C-i.> Cambia el panel actual. El panel activo deja de serlo y el no activo pasa a ser el nuevo panel activo. La barra de selección se mueve del antigüo panel al nuevo, desaparece de aquél y aparece en éste.

source: B<Insert, C-t.> To tag files you may use the Insert key (the kich1 terminfo sequence) or the C-t (Control-t) sequence. To untag files, just retag a tagged file.
es: B<Insertar, C-t.> Para marcar ficheros ( y/o directorios) como seleccionados podemos usar la tecla Insertar (Ins) ( La secuencia kich1 de terminfo ) o la combinación C-t (Control-t). Para deseleccionar ficheros, basta con repetir la operación sobre los ficheros y/o directorios antes marcados.

source: B<M-g, M-h (or M-r), M-j.> Used to select the top file in a panel, the middle file and the bottom one, respectively.
es: B<M-g, M-h (o M-r), M-j.> Usadas para secleccionar el fichero superior en un panel, el fichero central y el inferior del panel, respectivamente.

source: B<C-s, M-s.> Start a filename search in the directory listing. When the search is active the keypresses will be added to the search string instead of the command line. If the I<Show mini-status> option is enabled the search string is shown on the mini-status line. When typing, the selection bar will move to the next file starting with the typed letters. The I<backspace or DEL> keys can be used to correct typing mistakes. If C-s is pressed again, the next match is searched for.
es: B<C-s, M-s.> Inicia la búsqueda de un fichero en la lista de directorios (panel activo). Cuando la búsqueda está activa las pulsaciones de teclado son añadidas a la cadena de búsqueda y no a la línea de comandos. Si la opción I<Mostrar Mini-estado> está habilitada la cadena a buscar es mostrada en la línea de mini-estado. Conforme tecleemos, la barra de selección se desplazará al siguiente fichero o directorio cuyo nombre coincida con las letras introducidas. Las teclas I<backspace> (I<E<lt>->,I< retroespacio>) o I<DEL >(I<SUPR>) pueden ser utilizadas para corregir errores de escritura. Si pulsamos C-s de nuevo, se busca la siguiente coincidencia.

source: B<M-t> Toggle the current display listing to show the next display listing mode. With this it is possible to quickly switch from long listing to regular listing and the user defined listing mode.
es: B<M-t> Rota el listado de pantalla actual para mostrar el siguiente modo de listado. Con ésto es posible intercambiar rápidamente de un listado completo al regular o breve, así como al modo de listado definido por el usuario.

source: B<C-\e (control-backslash).> Show the directory hotlist and change to the selected directory.
es: B<C-\e ( control-Contrabarra).> Muestra la Lista Rápida de Directorios y cambiar al directorio seleccionado. B<* N. de T.:> En el teclado castellano, existe un pequeño inconveniente, dado que la contrabarra, no se consigue con una sola pulsación, por lo que este método no funciona directamente.

source: B<+ \ (plus).> This is used to select (tag) a group of files. The Midnight Commander will prompt for a regular expression describing the group. When I<Shell Patterns> are enabled, the regular expression is much like the regular expressions in the shell (* standing for zero or more characters and ? standing for one character). If I<Shell Patterns> is off, then the tagging of files is done with normal regular expressions (see ed (1)).
es: B<+ \ ( más).> Usado para seleccionar ( marcar) un grupo de ficheros. Midnight Commander preguntará por una expresión refgular describiendo el grupo. Cuando los I<Caracteres Comodín ( Shell Patterns)> están habilitados, la expresión regular es idéntica a las expresiones regulares en el shell ( poniendo * para cero o más caracteres y ? para uno o más caracteres). Si los I<Caracteres Comodín> están deshabilitados, entonces la selección de ficheros se realiza con expresiones regulares normales ( VA. ed (1)).
