Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: I<On dumb terminals> You will get the pause message on terminals that are not capable of showing the output of the last command executed (any terminal that is not an xterm or the Linux console).
es: I<En terminales tontos> Obtendremos un mensaje de pausa que no son capaces de mostrar la salida del último comando ejecutado (en realidad, cualquier terminal que no sea un xterm o una consola de Linux).

source: I<Always> The program will pause after executing all of your commands.
es: I<Siempre> El programa realizará una pausa después de ejecutar todos nuestros comandos.

source: I<Shell Patterns.> By default the Select, Unselect and Filter commands will use shell-like regular expressions. The following conversions are performed to achieve this: the '*' is replaced by '.*' (zero or more characters); the '?' is replaced by '.' (exactly one character) and '.' by the literal dot. If the option is disabled, then the regular expressions are the ones described in ed(1).
es: I<Patrones del shell.> Por defecto los comandos de Selección, Desselección y Filtro expresiones regulares del estilo del shell. Para realizar esto se realizan las siguientes conversiones: el '*' es remplazado por '.*' (cero o más caracteres); la '?' por '.' (exactamente un carácter) y '.' por el punto literal. Si la opción está deactivada, entonces las expresiones regulares son las descritas en ed(1).

source: I<Auto Save Setup.> If this option is enabled, when you exit the Midnight Commander the configurable options of the Midnight Commander are saved in the ~/.mc/ini file.
es: I<Auto Guardar Configuración.> Si esta opción está activada, cuando salimos de Midnight Commander las opciones configurables de Midnight Commander son guardadas en el fichero ~/.mc/ini.

source: I<Auto menus.> If this option is enabled, the user menu will be invoked at startup. Useful for building menus for non-unixers.
es: I<Auto menús.> Si está activada, el menú de usuario será invocado al arrancar. Útil para menús construidos por personas ajenas a Unix.

source: I<Use internal editor.> If this option is enabled, the built-in file editor is used to edit files. If the option is disabled, the editor specified in the B<EDITOR> environment variable is used. If no editor is specified, B<vi> is used. See the section on the internal file editor.
es: I<Usar editor interno.> Si es'ta activada, el editor de ficheros incorporado es utilizado para editar ficheros. Si está desactivada, será usado el editor especificado por la variable de entorno B<EDITOR>. Si no se especifica ninguno, se usará B<vi>. Véase la sección sobre editor de ficheros interno.

source: I<Use internal viewer.> If this option is enabled, the built-in file viewer is used to view files. If the option is disabled, the pager specified in the B<PAGER> environment variable is used. If no pager is specified, the B<view> command is used. See the section on the internal file viewer.
es: I<Usar visor interno.> Si está activada, el visor de ficheros incorporado será utilizado para ver ficheros. Si la opción está desactivada, el paginador especificado en la variable de entorno B<PAGER> será el utilizado. Si no se especifica ninguno, se usará el comando B<view>. Véase la sección visor de ficheros interno.

source: I<Confirm Delete.> This option is toggled on by default, and will cause the Midnight Commander to ask for confirmation when deleting a single file.
es: I<Borrado Seguro.> Opción activa por defecto, provocará que Midnight Commander pida confirmación cuando borremos un sólo fichero.

source: I<Cd follows links.> This option, if set, causes the Midnight Commander to follow the logical chain of directories when changing current directory either in the panels, or using the cd command. This is the default behavior of bash. When unset, the Midnight Commander follows the real directory structure, so cd .. if you've entered that directory through a link will move you to the current directory's real parent and not to the directory where the link was present.
es: I<Cd sigue los enlaces.> Esta opción, si está seleccionada, hace que Midnight Commander siga logical chain de directorios cuando cuando cambia el directorio actual bien el el panel, o usando el comando cd. Éste es el comportamiento por defecto de bash. Cuando está deseleccionada, Midnight Commander sige la estructura real de directorios, así cd .. si hemos entrado en ese directorio a través de un enlace nos trasladará al padre real del directorio actual y no al directorio donde se encontraba el enlace.

source: Display bits
es: Bits de Visualizacion

source: This is used to configure the range of visible characters on the screen. This setting may be 7-bits if your terminal/curses supports only seven output bits, ISO-8859-1 displays all the characters in the ISO-8859-1 map and full 8 bits is for those terminals that can display full 8 bit characters.
es: Esta opción es utilizada para configurar el rango de caracteres visibles en la pantalla. Ésta selección puede ser 7-bits si nuestro terminal/curses soporta sólo siete bits de salida, ISO-8859-1 muestra todos los caracteres del mapa ISO-8859-1 despliegue de 8 bit para aquellos terminales que puedan los 8 bits en toda su extensión.

source: Confirmation
es: Confirmacion

source: In this menu you configure the confirmation options for file deletion, overwriting, execution by pressing enter and quitting the program.
es: En este menúconfiguramos las opciones de confirmación de eliminación de ficheros, sobreescritura, ejecución pulsando enter y salir del programa.

source: Learn keys
es: Aprender teclas

source: This dialog lets you test if your keys F1-F20, Home, End, etc. work properly on your terminal. They often don't, since many terminal databases are broken.
es: Este diálogo nos permite comprobar si nuestras teclas F1-F20, Inicio, Fin, etc. funcionan adecuadamente en nuestro terminal. A menudo fallan, dado que muchas bases de datos de terminales están mal.

source: You can move around with the Tab key, with the vi moving keys ('h' left, 'j' down, 'k' up and 'l' right) and after you press any arrow key once (this will mark it OK), then you can use that key as well.
es: Podemos movernos alrededor con la tecla Tab, con las teclas de movimiento de vi ('h' izquierda, 'j' abajo, 'k' arriba y 'l' derecha) y después de pulsar cualquier tecla del cursor (esto las marcará con OK), entonces podremos usar esa tecla también.

source: You test them just by pressing each of them. As soon as you press a key and the key works properly, OK should appear next to the name of that key. Once a key is marked OK it starts to work as usually, e.g. F1 for the first time will just check that F1 works OK, but from that time on it will show help. The same applies to the arrow keys. Tab key should be working always.
es: Para probarlas basta con pulsar cada una de ellas. Tan pronto como pulsamos una tecla y ésta funciona adecuadamente, OK debería aparecer junto al nombre de la susodicha tecla. Una vez que una tecla es marcada con OK empieza a funcionar con normalidad, p.e. F1 la primera vez comprobará que F1 funciona perfectamente, pero a partir de ese momento mostrará la ayuda. Esto mismo es aplicable a las teclas del cursor. La tecla tab debería funcionar siempre.

source: If some keys do not work properly, then you won't see OK after the key name after you have pressed that key. You may then want to fix it. You do it by pressing the button of that key (either by mouse or using Tab and Enter). Then a red message will appear and you will be asked to type that key. If you want to abort this, press just Esc and wait until the message disappears. Otherwise type the key you're asked to type and also wait until the dialog disappears.
es: Si algunas teclas no funcionan adecuadamente, entonces no veremos el OK tras el nombre de la tecla después de haberla pulsado. Podemos entonces intentar solucionarlo. Haremos esto pulsando el botón de esa tecla (con el ratón o usando Tab y Enter). Entonces un mensaje rojo aparecerá y se nos pedirá que pulsemos la tecla en cuestión. Si deseamos abortar el proceso, bastará con pulsar Esc y esperar hasta que el mensaje desaparezca.Si no, pulsaremos la tecla que nos pide y esperaremos hasta que el diálogo desaparezca.

source: When you finish with all the keys, you may want either to Save your key fixes into your ~/.mc/ini file into the [terminal:TERM] section (where TERM is the name of your current terminal) or to discard them. If all your keys were working properly and you had not to fix any key, then (of course) no saving will occur.
es: Cuando acabemos con todas las teclas, podríamos Guardar nuestras teclas en nuestro fichero ~/.mc/ini dentro de lasección [terminal:TERM] (donde TERM es el nombre de nuestro terminal actual) o descartarlas. Si todas nuestras teclas funcionan correctamente y no debemos corregir ninguna, entonces (lógico) no se grabará.

source: Virtual FS
es: Opciones del VFS

source: This option gives you control over the settings of the Virtual File System information cache.
es: Esta opción nos proporciona el control sobre la caché de información del Sistema de Ficheros Virtual (VFS).

source: The Midnight Commander keeps in memory the information related to some of the virtual file systems to speed up the access to the files in the file system. Since the information that must be kept may be large (for example, compressed tar files may be kept in RAM for faster access), you may want to tune the parameters of the cached information to decrease your memory usage or to maximize the speed of access to frequently used file systems.
es: Midnight Commander guarda en memoria la información relacionada con alguno de los sistemas de ficheros virtuales para acelerar el acceso a los ficheros en el sistema de ficheros. Puesto que la información que debe ser guardada puede ser grande (por ejemplo, los ficheros tar comprimidos podrían ser guardados en la RAM para acceder más rápidamente), podríamos querer ajustar los parámetros de la información con caché para disminuir la utilización de memoria o aumentar la velocidad de acceso a los sistemas de ficheros más utilizados.

source: The Tar file system is quite clever about how it handles tar files: it just loads the directory entries and when it needs to use the information contained in the tar file, it goes and grab it.
es: El sistema de ficheros Tar es bastante inteligente a la hora de manejar sus ficheros: sólo carga las entradas de los directorios y cuando necesita usar la información contenida en el fichero tar, va y la toma.

source: In the wild, tar files are usually kept compressed (plain tar files are species in extinction), and because of the nature of those files (the directory entries for the tar files is not there waiting for us to be loaded), the tar file system has two choices: load the complete, uncompressed tar file into memory or uncompress the file in the disk in a temporary location and then access the uncompressed file as a regular tar file.
es: A grosso modo, los ficheros tar son normalmente guardados comprimidos (los ficheros tar sin comprimir son especies en extinción), y debido a la naturaleza de esos ficheros (las entradas de directorio de los ficheros tar no están allí esperando a que las carguemos nosotros), el sistema de ficheros tar tiene dos posibilidades: cargar todo el fichero tar descomprimido en memoria o descomprimir el fichero en el disco en una localización temporal y acceder entonces al fichero descomprimido como a un fichero tar normal.

source: In this dialog box you tell the Midnight Commander which sizes for compressed tar files you will tolerate to load into your precious memory. The default setting is set to one megabyte, this means that compressed tar files whose size is at most one megabyte will be loaded into core, otherwise a temporary uncompressed tar file will be created to access the contents (all of this is transparent to the user).
es: En este cuadro de diálogo indicamos a Midnight Commander que tamaños de ficheros tar comprimidos toleraremos cargar a nuestra preciada memoria. La selección por defecto es un megabyte, esto significa que los ficheros tar comprimidos cuyo tamaño sea como máximo una mega serán cargados en memoria, si no es así será creado un fichro tar descomprimido para acceder a los contenidos (todo esto es transparente para el usuario).

source: The program will let you add a suffix to specify the units of the number you typed in, use 'k' for kilobyte and 'm' for megabyte. Our routine does not accept floating point numbers, so you can't use ".5 m" to specify 512 kilobytes, you will have to use "512 k" instead.
es: El programa nos permitirá añadir un sufijo para especificar las unidades del número que tecleamos, usaremos 'k' para kilobytes y 'm' para indicar megabytes. Nuestra rutina no acepta números en formato de coma flotante, de modo que no podremos usar ".5 m" para indicar 512 kilobytes, tendremos que usar "512 k" en su lugar.

source: Now, since we all love to browse files and tar files all over the disk, it's common that you will leave a tar file and the re-enter it later. Since uncompression is slow, the Midnight Commander will cache the information in memory for a limited amount of time, after you hit the timeout, all of the memory resources associated with the file system will be freed. The default timeout is set to one minute.
es: Ahora, dado que a todos nos encanta navegar por los ficheros, incluídos los tar, sobre el disco, es común que salgamos de un fichero tar y volvamos a entrar en él después. Puesto que la descompresión es lenta, Midnight Commander mantendrá en memoria la información durante una catidad de tiempo limitado, después de alcanzado el momento, todos los recursos de memoria asociados con el sistema de ficheros serán liberados. El período por defecto es de un minuto.

source: Layout
es: Presentacion

source: The layout dialog gives you a possibility to change the general layout of screen. You can specify whether the menubar, the command prompt, the hintbar and the function keybar are visible. On the Linux or SCO console you can specify how many lines are shown in the output window.
es: La ventana de presentación no da la posibilidad de cambiar la presentación general de la pantalla. Podemos especificar cuándo son visibles la Barra de Menú, la línea de comandos, la línea de sugerencias de xterm y la Barra de teclas de Función. En la consola Linux o SCO podemos especificar cuántas líneas serán mostradas en la ventana de salida.

source: The rest of the screen area is used for the two directory panels. You can specify whether the area is split to the panels in vertical or horizontal direction. The split can be equal or you can specify an unequal split.
es: El resto del área de pantalla se utiliza para los dos paneles de directorio. Podemos cuando los paneles son divididos vertical u horizontalmente. La división puede ser simétrica o bien podemos indicar una división asimétrica.

source: Save Setup
es: Guardar Configuracion

source: At startup the Midnight Commander will try to load initialization information from the ~/.mc/ini file. If this file doesn't exist, it will load the information from the system-wide configuration file, located in /usr/lib/mc/mc.ini. If the system-wide configuration file doesn't exist, MC uses the default settings.
es: Al arrancar Midnight Commander cargar la información de inicio del fichero ~/.mc/ini. Si este no existe, cargará la información del fichero de configuración genérico del sistema, emplazado en el directorio /usr/lib/mc/mc.ini. Si el fichero de configuración genérico del sistema no existe, MC utiliza la configuración por defecto.

source: The I<Save Setup> command creates the ~/.mc/ini file by saving the current settings of the Left, Right and Options menus.
es: El comando I<Guardar Configuración> crea el fichero ~/.mc/ini guardando la configuración actual de los menús Izquierdo, Derecho y Opciones.

source: If you activate the I<auto save setup> option, MC will always save the current settings when exiting.
es: Si activamos la opción I<Auto-guarda configuración> , MC guardará siempre la configuración actual al salir.

source: There also exist settings which can't be changed from the menus. To change these settings you have to edit the setup file with your favorite editor. See the section on Special Settings for more information.
es: Existen también configuraciones que no pueden ser cambiadas desde los menús. Para cambiarlas tendremos que editar el fichero de configuración con nuestro editor favorito. véase la sección sobre Ajustes Especiales para más información.

source: Executing operating system commands
es: Ejecutando Comados del Sistema Operativo

source: You may execute commands by typing them directly in the Midnight Commander's input line, or by selecting the program you want to execute with the selection bar in one of the panels and hitting Enter.
es: Podemos ejecutar comandos tecleándolos directamente en la línea de entrada de Midnight Commander, o seleccionando el programa que queremos ejecutar con la barra de selección en uno de los paneles y pulsando Enter.

source: If you press Enter over a file that is not executable, the Midnight Commander checks the extension of the selected file against the extensions in the Extensions File. If a match is found then the code associated with that extension is executed. A very simple macro expansion takes place before executing the command.
es: Si pulsamos Enter sobre un fichero que no es ejecutable, Midnight Commander chequea la extensión del fichero seleccionado con las extensiones en el Fichero de Extensiones. Si se produce una coincidencia se ejecutará el código asociado con esa extensión. Tendrá lugar una extensión de macro muy simple antes de ejecutar el comando.

source: The cd internal command
es: El Comando cd Interno

source: The I<cd> command is interpreted by the Midnight Commander, it is not passed to the command shell for execution. Thus it may not handle all of the nice macro expansion and substitution that your shell does, although it does some of them:
es: El comando I<cd> es interpretado por Midnight Commander, no es pasado al shell de comandos para ser ejecutado. Podría no dar soporte a todas expansión y substitución de macro que hace nuestro shell, empero sí realiza algunas de ellas:

source: I<Tilde substitution> The (~) will be substituted with your home directory, if you append a username after the tilde, then it will be substituted with the login directory of the the specified user.
es: I<Substitución de Tilde> La tilde (~) será substituída por nuestro directorio de inicio, si añadimos un nombre de usuario tras la tilde, entonces será substituído por el directorio de entrada al sistema del usuario especificado.

source: For example, ~guest is the home directory for the user guest, while ~/guest is the directory guest in your home directory.
es: Por ejemplo, ~guest es el directorio del usuario invitado (literalmente, guest), mientras que ~/guest es el directorio guest en nuestro directorio de inicio.

source: I<Previous directory> You can jump to the directory you were previously by using the special directory name '-' like this: B<cd ->
es: I<Directorio Anterior> Podemos saltar al directorio donde estábamos anteriormente de la mano del nombre de directorio especial '-' del siguiente modo: B<cd ->

source: I<CDPATH directories> If the directory specified to the B<cd> command is not in the current directory, then The Midnight Commander uses the value in the environment variable B<CDPATH> to search for the directory in any of the named directories.
es: I<directorios de CDPATH> Si el directorio especificado al comando B<cd> no es el directorio actual, entonces Midnight Commander utiliza el valor de la variable de entorno B<CDPATH> para buscar el directorio en cualquiera de los directorios mencionados.

source: For example you could set your B<CDPATH> variable to ~/src:/usr/src, allowing you to change your directory to any of the directories inside the ~/src and /usr/src directories, from any place in the file system by using it's relative name (for example cd linux could take you to /usr/src/linux).
es: Por ejemplo, podríamos asignar nuestra variable B<CDPATH> como ~/src:/usr/src, permitiéndonos cambiar nuestro directorio a cualquiera de los directorios dentro de ~/src y /usr/src, desde cualquier lugar dentro del sistema de ficheros usándo su nombre relativo (por ejemplo cd linux podría llevarnos a /usr/src/linux).

source: Macro Substitution
es: Substitucion de Macro

source: When accessing a user menu, or executing an extension dependent command, or running a command from the command line input, a simple macro substitution takes place.
es: Cuando se accede al menú de usuario, o se ejecuta un comando dependiente de extensión, o se ejecuta un comando desde la línea de entrada de comandos, se realiza una simple substitución de macro.

source: The macros are:
es: Las macros son:

source: The current file name.
es: Fichero actual.

source: The current directory name.
es: Nombre del directorio actual.

source: The current file in the unselected panel.
es: Fichero actual en el panel inactivo.

source: The directory name of the unselected panel.
es: Directorio del panel inactivo.

source: The currently tagged files.
es: Ficheros actualmente marcados.

source: The tagged files in the unselected panel.
es: Ficheros marcados en el panel inactivo.

source: I<%u> and I<%U>
es: I<%u> y I<%U>

source: Similar to the %t and %T macros, but in addition the files are untagged. You can use this macro only once per menu file entry or extension file entry, because next time there will be no tagged files.
es: Similar a las macros %t y %T, salvo que los ficheros son desmarcados. Podemos usar esta macro sólo una vez por cada entrada del menú de archivo o del fichero de extensiones, puesto que la siguiente vez no serán ya tagged ficheros marcados.

source: I<%s> and I<%S>
es: I<%s> y I<%S>

source: The selected files: The tagged files if there are any. Otherwise the current file.
es: Los ficheros seleccionados: Los ficheros marcados si los hay. Si no el fichero actual.

source: Dropped files. In all places except in the Drop action of the mc.ext file, this will become a null string, in the Drop action it will be replaced with a space separated list of files that were dropped on the file.
es: Ficheros arrastrados con el ratón (o dispositivo similar). En todos los lugares excepto en la acción de Soltar del fichero mc.ext, producirá una cadena vacía, en la acción Soltar será substituida por una lista de ficheros separados por espacio que fueron soltados sobre el fichero.

source: This is a special macro that is used to change the current directory to the directory specified in front of it. This is used primarily as an interface to the Virtual File System.
es: Ésta es una macro especial usada para cambiar del directorio actual al directorio especificado frente a él. Esto se utiliza principalmente como interfaz con el Sistema de Ficheros Virtual.

source: This macro is used to invoke the internal viewer. This macro can be used alone, or with arguments. If you pass any arguments to this macro, they should be enclosed in brackets.
es: Ésta macro es usada para invocar al visor interno. Puede ser utilizada en solitario, o bien con argumentos. Si pasamos algún argumento a esta macro, deberá ser entre paréntesis.
