Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: The arguments are: I<ascii> to force the viewer into ascii mode; I<hex> to force the viewer into hex mode; I<nroff> to tell the viewer that it should interpret the bold and underline sequences of nroff; I<unformated> to tell the viewer to not interpret nroff commands for making the text bold or underlined.
es: Los argumentos son: I<ascii> para forzar al visor a modo ascii; I<hex> para forzar al visor a modo hexadecimal; I<nroff> para indicar al visor que debe interpretar las secuencias de negrita y subrayado de nroff; I<unformated> para indicar al visor que no interprete los comandos nroff referentes a texto resaltado o subrayado.

source: The % character
es: El carácter %

source: I<%{some text}>
es: I<%{cualquier texto}>

source: Prompt for the substitution. An input box is shown and the text inside the braces is used as a prompt. The macro is substituted by the text typed by the user. The user can press ESC or F10 to cancel. This macro doesn't work on the command line yet.
es: Pregunta sobre la substitución. Un cuadro de entrada es mostrado y el texto dentro de las llaves se usa como mensaje. La macro es substituída por el texto tecleado por el usuario. El usuario puede pulsar ESC o F10 para cancelar. Esta macro no funciona aún sobre la línea de comandos.

source: The subshell support
es: Soporte de Subshell

source: The subshell support is a compile time option, that works with the shells: bash, tcsh and zsh.
es: El soporte del subshell es una opción de tiempo de compilación, que funciona con los shells: bash, tcsh y zsh.

source: When the subshell code is activated the Midnight Commander will spawn a concurrent copy of your shell (the one defined in the B<SHELL> variable and if it is not defined, then the one in the /etc/passwd file) and run it in a pseudo terminal, instead of invoking a new shell each time you execute a command, the command will be passed to the subshell as if you had typed it. This also allows you to change the environment variables, use shell functions and define aliases that are valid until you quit the Midnight Commander.
es: Cuando el código del subshell es activado Midnight Commander engendrará una copia de nuestro shell (la definida en la variable B<SHELL> y si no está definida, el que aparece en el fichero /etc/passwd) y lo ejecuta en un pseudoterminal, en lugar de invocar un nuevo shell cada vez que ejecutamos un comando, el comando será pasado al subshell como si lo hubiésemos escrito. Esto además permite cambiar las variables de entorno, usaremos las funciones del shell y los alias definidos que serán válidos hasta salir de Midnight Commander.

source: If you are using B<bash> you can specify startup commands for the subshell in your ~/.mc/bashrc file and special keyboard maps in the ~/.mc/inputrc file. B<tcsh> users may specify startup commands in the ~/.mc/tcshrc file.
es: Si estamos usando B<bash> podremos especificar comandos de arranque para el subshell en nuestro fichero ~/.mc/bashrc y mapas de teclado especiales en el fichero ~/.mc/inputrc. Los usuarios de B<tcsh> podrán especificar los comandos de arranque en el fichero ~/.mc/tcshrc.

source: When the subshell code is used, you can suspend applications at any time with the sequence C-o and jump back to the Midnight Commander, if you interrupt an application, you will not be able to run other external commands until you quit the application you interrupted.
es: Cuando utilizamos el código del subshell, podemos suspender aplicaciones en cualquier momento con la secuencia C-o y volver a Midnight Commander, si interrumpimos una aplicación, no podremos ejecutar otros comandos externos hasta que quitemos la aplicación que hemos interrunmpido.

source: An extra added feature of using the subshell is that the prompt displayed by the Midnight Commander is the same prompt that you are currently using in your shell.
es: Una característica extra añadida de uso del subshell es que el prompt mostrado por Midnight Commander es el mismo que estamos usando en nuestro shell.

source: The OPTIONS section has more information on how you can control the subshell code.
es: La sección OPCIONES tiene más información sobre cómo controlar el cçodigo del subshell.

source: Controlling Midnight Commander
es: Controlando Midnight Commander

source: The Midnight Commander defines an environment variable MC_CONTROL_FILE. The commands executed by MC may give instructions to MC by writing to the file specified by this variable. This is only available if you compiled your copy of the Midnight Commander with the WANT_PARSE option.
es: Midnight Commander define la variable de entorno MC_CONTROL_FILE. Los comandos ejecutados por MC pueden dar instrucciones a MC escribiendo en el fichero especificado por ésta variable. Esto solamente está disponible si compilamos nuestra copia de the Midnight Commander con la opción WANT_PARSE.

source: The following instructions are supported.
es: Son soportadas las siguientes instrucciones.

source: clear_tags Clear all tags. tag E<lt>filenameE<gt> Tag specified file. untag E<lt>filenameE<gt> Untag specified file. select E<lt>filenameE<gt> Move pointer to file. change_panel Switch between panels. cd E<lt>pathE<gt> Change directory.
es: clear_tags Elimina todas las marcas. tag E<lt>ficheroE<gt> Marca un fichero especificado. untag E<lt>ficheroE<gt> Desmarca un fichero especificado. select E<lt>ficheroE<gt> Desplaza el puntero el fichero. change_panel Intercambia entre los paneles. cd E<lt>rutaE<gt> Cambia de deirectorio.

source: If the first letter of the instruction is in lower case it operates on the current panel. If the letter is in upper case the instruction operates on the other panel. The additional letters must be in lower case. Instructions must be separated by exactly one space, tab or newline. The instructions don't work in the Info, Tree and Quick views. The first error causes the rest to be ignored.
es: Si la primera letra de la instrucción está en minúscula opera en el panel actual. Si la letra está en mayúsculas, la instrucción opera sobre el otro panel. Las letras adicionales deben estar en minúsculas. Las instrucciones deben estarseparadas exáctamente por un espacio, tabulador o Abvance de línea. Las instrucciones no funcionan en la presentación de Información, Árbol o Rápida. El primer error provoca que el resto sea ignorado.

source: The Chmod window is used to change the attribute bits in a group of files and directories. It can be invoked with the C-x c key combination.
es: La ventana de Chmod se usa para cambiar los bits de atributo en un grupo de ficheros y directorios. Puede ser invocada con la combinación de teclas C-x c.

source: The Chmod window has two parts - I<Permissions> and I<File>
es: La ventana de Chmod tiene dos partes - I<Permisos> y I<Archivo>

source: In the File section are displayed the name of the file or directory and its permissions in octal form, as well as its owner and group.
es: En la sección Archivo se muestran el nombre del fichero o directorio y sus permisos en formato numérico octal, así como su propietario y grupo.

source: In the Permissions section there is a set of check buttons which correspond to the file attribute bits. As you change the attribute bits, you can see the octal value change in the File section.
es: En la sección de permisos hay hay un grupo de botones que corresponden a los bits de atributos del fichero. Conforme cambiamos los bits de atributo, podemos ver el valor octal cambiando en la sección Archivo.

source: To move between the widgets (buttons and check buttons) use the I<arrow keys> or the I<Tab> key. To change the state of the check buttons or to select a button use I<Space.> You can also use the hotkeys on the buttons to quickly activate that selection (they are the highlit letters on the buttons).
es: Para desplazarse entre widgets (botones y celdas marcables) usaremos las I<teclas del cursor> o la tecla I<Tab>. Para cambiar el estado de las celdas o para seleccionar un botón usaremos I<Espacio>. Podemos usar los atajos de teclado con los botones para activar rápidamente esa selección (son las letras destacadas en los botones).

source: To set the attribute bits, use the Enter key.
es: Para aceptar los atributos, usaremos la tecla Enter.

source: When working with a group of files or directories, you just click on the bits you want to set or clear. Once you have selected the bits you want to change, you select one of the action buttons (Set marked or Clear marked).
es: Cuando trabajamos con un grupo de ficheros o directorios, basta pulsar con el ratón sobre los bits que queremos activar o desactivar. Una vez seleccionados los bits que queremos cambiar, seleccionamos uno de los botones (Marca activa o marca desactiva).

source: Finally, to set the attributes exactly to those specified, you can use the B<[Set all]> button, which will act on all the tagged files.
es: Finalmente, para ajustar los atributos exactamente a los especificados, podemos usar el botón B<[Activar todos]> , que actuará sobre todos los ficheros marcados.

source: B<[Marked all]> set only marked attributes to all selected files
es: B<[Todos los Marcados]> actúa sólo sobre los atributos marcados de los ficheros seleccionados

source: B<[Set marked]> set marked bits in attributes of all selected files
es: B<[Activar los marcados]> Activa los bits marcados de los atributos de los ficheros seleccionados

source: B<[Clean marked]> clear marked bits in attributes of all selected files
es: B<[Borrar los marcados]> Borra los bits marcados de los atributos de los ficheros seleccionados

source: B<[Set]> set the attributes of one file
es: B<[Activar]> Activa los atributos de un fichero

source: B<[Cancel]> cancel the Chmod command
es: B<[Cancelar]> cancela el comando Chmod

source: The Chown command is used to change the owner/group of a file. The hot key for this command is C-x o.
es: El comando Chown permite cambiar el propietario/grupo de un fichero. La tecla rápida para este comando es C-x o.

source: File Operations
es: Operaciones con Ficheros

source: When you copy, move or delete files the Midnight Commander shows the file operations dialog. It shows the files currently being operated on and there are at most three progress bars. The file bar tells how big part of the current file has been copied so far. The count bar tells how many of tagged files have been handled so far. The bytes bar tells how big part of total size of the tagged files has been handled so far. If the verbose option is off the file and bytes bars are not shown.
es: Cuando copiamos, movemos o borramos ficheros Midnight Commander muestra el diálogo de operaciones con ficheros. Muestra los ficheros sobre los que se actuará y hay al menos tres barras de progreso. La barra de fichero indica qué parte del fichero ha sido copiada hasta ahora. La barra de contador informa de cuántos de los ficheros marcados marcados han sido gestionados hasta el momento. La barra de bytes nos dice qué parte del tamaño total de ficheros marcados ha sido gestionado E<.SM adhuc>. Si la opción comentada está desactivada no se muestran las barras del fichero y bytes.

source: There are two buttons at the bottom of the dialog. Pressing the Skip button will skip the rest of the current file. Pressing the Abort button will abort the whole operation, the rest of the files are skipped.
es: Hay dos botones bajo el diálogo. Pulsando el botón Skip button ignorará el resto del fichero actual. Pulsando el botón Abortar se anulará toda la operación, el resto de ficheros son obviados.

source: There are three other dialogs which you can run into during the file operations.
es: Hay otros tres diálogos que pueden ejecutarse durante operaciones de ficheros.

source: The error dialog informs about error conditions and has three choices. Normally you select either the Skip button to skip the file or the Abort button to abort the operation altogether. You can also select the Retry button if you fixed the problem from another terminal.
es: El diálogo de error informa sobre una condición de error y tiene tres posibilidades. Normalmente seleccionaremos el botón Saltar para saltar el fichero o el botón Abortar para abortar la operación. También podemos seleccionar el botón Reintentar si pudimos corragir el problema desde otro terminal.

source: The replace dialog is shown when you attempt to copy or move a file on the top of an existing file. The dialog shows the dates and sizes of the both files. Press the Yes button to overwrite the file, the No button to skip the file, the alL button to overwrite all the files, the nonE button to never overwrite and the Update button to overwrite if the source file is newer than the target file. You can abort the whole operation by pressing the Abort button.
es: El diálogo Reemplazar aparece cuando intentamos copiar o mover un fichero sobre otro ya existente. El mensaje muestra fechas y tamaños de ambos ficheros. Pulsaremos el botón Sí para sobreescribir el fichero, el botón No para saltarlo, el botón Todos para sobreescribir todos los ficheros, Ninguno para no sobreescribir en ningún caso y Actualizar para sobreescribir si el fichero origen es posterior al fichero objeto. Podemos abortar toda la operación pulsando el botón Abortar.

source: The recursive delete dialog is shown when you try to delete a directory which is not empty. Press the Yes button to delete the directory recursively, the No button to skip the directory, the alL button to delete all the directories and the nonE button to skip all the non-empty directories. You can abort the whole operation by pressing the Abort button. If you selected the Yes or alL button you will be asked for a confirmation. Type "yes" only if you are really sure you want to do the recursive delete.
es: El diálogo de eliminación recursiva aparece cuando intentamos borrar un directorio no vacío. Pulsaremos Sí para borrar el directorio recursivamente, No para saltar el directorio, Todo para borrar todos los directorios y Ninguno para saltarlos todos los directorios no vacíos. Podemos abortar toda la operación pulsando el botón Abortar. Si seleccionamos el botón Sí o Todo se nos pedirá confirmación. Diremos "sí" sólo si estamos realmente de que queremos una eliminación recursiva. B<Nota del traductor:> Para aquellos que no sean informáticos y/o no sepan lo que es la recursividad, les diré que es algo definido en base a sí mismo, y que, lejos de ser de ámbito estrictamente informático, o matemático, está muy presente en la naturaleza. Gráficamente, pondremos de ejemplo una escalera de caracol vista desde arriba que, girando, nunca llega a su extremo, pareciendo ésta de longitud infinita. Esto es lo que se denomina en psicología una imagen recurrente. matemáticamente, la recursividad está presente cuando demostramos cuáles son los números naturales y comprendemos cuáles son sin enumerarlos uno por uno (pueso que son potencialmente infinitos). Esto nos lleva a la utilización de la recursividad en informática, muy próxima a la matemática, claro está. Básicamente, podemos decir que un algoritmo es recursivo, si empleamos un conjunto de instrucciones o mandatos finito para abarcar un conjunto infinito. Así, ejemplos típicos de esto es el cálculo del factorial de un número, en el que con una sola "formula", podemos calcular todos los factoriales posibles. Aunque esto sea tan sólo "potencialmente", dado que un ordenador no puede calcular números infinitos al ser una representación discreta de la realidad (una aproximación finita de una realidad infinita, vamos). hecho este no muy breve inciso, que espero sea útil, sigamos.

source: If you have tagged files and perform an operation on them only the files on which the operation succeeded are untagged. Failed and skipped files are left tagged.
es: Si hemos marcado ficheros y realizamos una operación sobre ellos, sólo los ficheros sobre los que la operación fue exitosa son desmarcados. Los ficheros saltados y aquellos en los que la operación falló se dejan marcados.

source: Mask Copy/Rename
es: Mascara de Copiar/Renombrar

source: The copy/move operations lets you translate the names of files in an easy way. To do it, you have to specify the correct source mask and usually in the trailing part of the destination specify some wildcards. All the files matching the source mask are copied/renamed according to the target mask. If there are tagged files, only the tagged files matching the source mask are renamed.
es: Las operaciones de copiar/mover nos permiten traducir los nombres de ficheros de manera sencilla. Para conseguirlo, deberemos especificar la máscara fuente correcta y normalmente en la parte final del destino algunos caracteres comodín. Todos los ficheros coincidentes con la máscara fuente son copiados/remonbrados a la máscara destino. Si hay ficheros marcados, sólo aquellos que encajen en la máscara fuente son renombrados.

source: There are other option which you can set:
es: Hay otra opción que podemos seleccionar:

source: Follow links tells whether make the symlinks and hardlinks in the source directory (recursively in subdirectories) new links in the target directory or whether would you like to copy their content.
es: Seguir enlaces indica cúando los enlaces simbólicos o físicos en el directorio origen (recursivamente en subdirectorios) nuevos enlaces en el directorio destino o cuando nos gustaría copiar su contenido.

source: Dive into subdirs tells what to do if in the target directory exists a directory with the same name as the file/directory being copied. The default action is to copy it's content into that directory, by enabling this you can copy the source directory into that directory. Perhaps an example will help:
es: Copias recursivas si existen directorios indica qué hacer si en directorio de origen existe un directorio con el mismo nombre que el fichero/directorio que está siendo copiado. La acción por defecto es copiar su contenido en ese directorio, habilitando esto podemos copiar el directorio de origen a ese directorio. Quizás un ejemplo pueda ayudar:

source: You want to copy content of a directory foo to /bla/foo, which is an already existing directory. Normally (when Dive is not set), mc would copy it exactly into /bla/foo. By enabling this option you will copy the content into /bla/foo/foo, because the directory already exists.
es: Si queremos copiar el contenido de un directorio foo a /bla/foo, que es un directorio ya existente. Normalmente (cuando las Copias recursivas no están habilitadas), mc podría copiarlos exactamente a /bla/foo. habilitando esta opción copiaremos el contenido en /bla/foo/foo, porque el directorio ya existe.

source: Preserve attributes tells whether to preserve the original files' permissions, timestamps and if you are root whether to preserve the original files' UID and GID. If this option is not set the current value of the umask will be respected.
es: Preservar atributos cuando respetar los permisos originales de los ficheros, marcas temporales y si somos root cuándo preservar los identificadores de usuario (UID) y grupo (GID) originales. Si esta opción no está activa el valor actual de la máscara será respetado.

source: B<Use shell patterns on>
es: B<Usar patrones del shell activada>

source: When the shell patterns option is on you can use the '*' and '?' wildcards in the source mask. They work like they do in the shell. In the target mask only the '*' and '\eE<lt>digitE<gt>' wildcards are allowed. The first '*' wildcard in the target mask corresponds to the first wildcard group in the source mask, the second '*' corresponds to the second group and so on. The '\e1' wildcard corresponds to the first wildcard group in the source mask, the '\e2' wildcard corresponds to the second group and so on all the way up to '\e9'. The '\e0' wildcard is the whole filename of the source file.
es: Cuando la opción de patrones del shell está activada podemos usar los caracteres comodín '*' y '?' en la máscara de origen (máscara fuente). Funcionará tal y como lo hace en el shell. En la máscara destino, sólo los comodines '*' y '\eE<lt>númeroE<gt>' wildcards están permitidos. El primer comodín '*' en la máscara destino corresponde al primer grupo de comodines en la máscara de origen, el segundo '*' corresponde al segundo grupo, etcétera. El comodín '\e1' corresponde al primer grupo de comodínes en la máscara de origen, el comodín '\e2' corresponde al segundo grupo y así sucesivamente hasta '\e9'. El comodín '\e0' es el nombre de fichero completo del fichero fuente.

source: Two examples:
es: Dos ejemplos:

source: If the source mask is "*.tar.gz", the destination is "/bla/*.tgz" and the file to be copied is "foo.tar.gz", the copy will be "foo.tgz" in "/bla".
es: Si la máscara fuente es "*.tar.gz", el destino es "/bla/*.tgz" y el fichero a ser copiado es "foo.tar.gz", la copia será "foo.tgz" en "/bla".

source: Let's suppose you want to swap basename and extension so that "file.c" will become "c.file" and so on. The source mask for this is "*.*" and the destination is "\e2.\e1".
es: Supongamos que queremos intercambiar el nombre base y la extensión de modo que "fichero.c" se convierta en "c.fichero". La máscara fuente para esto es "*.*" y la de destino es "\e2.\e1".

source: B<Use shell patterns off>
es: B<Usar patrones del shell desactivada>

source: When the shell patterns option is off the MC doesn't do automatic grouping anymore. You must use '\e(...\e)' expressions in the source mask to specify meaning for the wildcards in the target mask. This is more flexible but also requires more typing. Otherwise target masks are similar to the situation when the shell patterns option is on.
es: Cuando la opción de patrones del shell está desactivada MC no realiza una agrupación automática. Deberemos usar expresiones '\e(...\e)' en la máscara fuente para especificar el significado de los comodínes en la máscara destino. Esto es más flexible pero también necerita más escritura. En otro caso las máscaras destino son similares a la situación en que los patrones del shell están activos.

source: If the source mask is "^\e(.*\e)\e.tar\e.gz$", the destination is "/bla/*.tgz" and the file to be copied is "foo.tar.gz", the copy will be "/bla/foo.tgz".
es: Si la máscara fuente es "^\e(.*\e)\e.tar\e.gz$", el destino es "/bla/*.tgz" y el fichero a ser copiado es "foo.tar.gz", la copia será "/bla/foo.tgz".

source: Let's suppose you want to swap basename and extension so that "file.c" will become "c.file" and so on. The source mask for this is "^\e(.*\e)\e.\e(.*\e)$" and the destination is "\e2.\e1".
es: Supongamos que queremos intercambiar el nombre base y la extensión siendo "fichero.c" se transforme en "c.fichero". La máscara fuente para esto es "^\e(.*\e)\e.\e(.*\e)$" y la de destino es "\e2.\e1".

source: B<Case Conversions>
es: B<Conversiones de casos>

source: You can also change the case of the filenames. If you use '\eu' or
es: Podemos cambiar el caso de los nombres de ficheros. Si usamos '\eu' o

source: uppercase or lowercase correspondingly.
es: mayúsculas o minúsculas correspondientemente.

source: If you use '\eU' or '\eL' in the target mask the next characters will be converted to uppercase or lowercase correspondingly up to the next
es: Si usamos '\eU' o '\eL' en la máscara destino los caracteres siguientes serán convertidos a mayúsculas o minúsculas correspondientemente al siguiente '\eE' oo próximo '\eU', '\eL' o fin del nombre del fichero.

source: The '\eu' and '\el' are stronger than '\eU' and '\eL'.
es: '\eu' y '\el' son más fuertes que '\eU' y '\eL'.
