Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: Another option is to set the I<ftpfs_always_use_proxy> parameter in the initialization file. This will configure the program to always use the proxy host. If this variable is set, the program will do two things: consult the /usr/lib/mc.no_proxy file for lines containing host names that are local (if the host name starts with a dot, it is assumed to be a domain) and to assume that any hostnames without dots in their names are directly accessible.
es: Otra opción es modificar el parámetro I<ftpfs_always_use_proxy> en el fichero de inicio. Esto instará al programa a utilizar siempre el proxy. si esta variable existe, el programa hará dos cosas: consultar el fichero /usr/lib/mc.no_proxy para leer las líneas que contienen nombres de máquinas locales (si el nombre de máquina empieza con un punto, se supone que es un dominio) y se asume que cualquier cualquier máquina sin puntos en su nombre es directamente accesible.

source: If you are using the ftpfs code with a filtering packet router that does not allow you to use the regular mode of opening files, you may want to force the program to use the passive-open mode. To use this, set the ftpfs_use_passive_connections option.
es: Si estamos usando el código de ftpfs sin un encaminador con filtración paquetes no nos permitirá usar el modo regular de apertura de ficheros, podríamos querer forzar al programa a usar el modo de apertura pasivo. Para hacerlo, usaremos la opción ftpfs_use_passive_connections.

source: The Midnight Commander keeps the directory listing in a cache. The cache expire time is configurable in the Virtual File System dialog box. This has the funny behavior that even if you make changes to a directory, they will not be reflected in the directory listing until you force a cache reload with the C-r key. This is a feature (when you think it's a bug, think about manipulating files on the other side of the Atlantic with ftpfs).
es: Midnight Commander guarda la lista de directorios en una caché. La vida de la caché es configurable en el cuadro de diálogo del Sistema de Ficheros Virtual. Esto tiene el curioso comportamiento que incluso si cambiamos a un directorio, no será reflejado en la lista de directorios hasta que la recarga de la caché con la tecla C-r. Esta es una característica (si creemos que es un defecto, pensemos en manipular ficheros en el otro lado del Atlántico con ftpfs).

source: Tar File System
es: Sistema de Archivos Tar

source: The tar file system provides you with read-only access to your tar files and compressed tar files by using the chdir command. To change your directory to a tar file, you change your current directory to the tar file by using the following syntax:
es: El sistema de ficheros tar y los ficheros tar comprimidos pueden consultarse usando el comando cdhdir. Para cambiar nuestro directorio a un fichero tar, cambiaremos nuestro directorio actual al fichero tar utilizando la siguiente sintaxis:

source: I<tar:filename.tar[dir-inside-tar]>
es: I<tar:NombreDeFichero.tar[Directorio-dentro_de-tar]>

source: The mc.ext file already provides a shortcut for tar files, this means that usually you just point to a tar file and press return to enter into the tar file, see the Extension File Edit section for details on how this is done.
es: El fichero mc.ext también ofrece un atajo para los ficheros tar, esto quiere decir que normalmente basta con apuntar a un fichero tar y pulsar Return para entrar en el fichero tar, véase la sección Edición del Fichero de Extensiones para obtener más detalles respecto a cómo hacer esto.

source: The latter specifies the full path of the tar archive.
es: Lo último indica el camino completo hasta el archivo tar.

source: Network File System
es: Sistema de Ficheros de Red

source: The Midnight Commander file system is a network base file system that allows you to manipulate the files in a remote machine as if they were local. To use this, the remote machine must be running the mcserv(8) server program.
es: El sistema de ficheros de Midnight Commander es un sistema de ficheros de red básico que nos permite manipular ficheros en una máquina remota como si estuviesen accesibles localmente. Para utilizar esto, la máquina remota debe estar ejecutando el programa servidor mcserv(8).

source: To connect to a remote machine, you just need to chdir into a special directory which name is in the following format:
es: Para conectar a una máquina remota, sólo necesitamos hacer un chdir a un directorio especial cuyo nombre sigue el siguiente formato:

source: I<mc:[user@]machine[:port][remote-dir]>
es: I<mc:[usuario@]máquina[:puerto][directorio-remoto]>

source: The, I<user, port> and I<remote-dir> elements are optional. If you specify the I<user> element then the Midnight Commander will try to logon on the remote machine as that user, otherwise it will use your login name.
es: Los elementos I<usuario>, I<puerto> y I<directorio-remoto> son opcionales. Si especificamos el elemento I<usuario> entonces Midnight Commander intentará acceder a la máquina como ese usuario, si no usarña nuestro login.

source: The I<port> element is used when the remote machine running on a special port (see the mcserv(8) manual page for more information about ports); finally, if the I<remote-dir> element is present, your current directory on the remote machine will be set to this one.
es: El elemento I<puerto> es utilizado cuando la máquina remota se ejecuta en un puerto especial (véase la página del manual de mcserv(8) para mayor información sobre puertos); finalmente, si el elemento I<directorio remoto> está presente, nuestro directorio actual en la máquina remota será éste.

source: mc:ftp.nuclecu.unam.mx/linux/local mc:joe@foo.edu:11321/private
es: mc:ftp.nuclecu.unam.mx/linux/local mc:Pepe@foo.edu:11321/privado mc:Gabriel@Dersu.ArocaSoft.es:1235/SolidarityWare

source: Undelete File System
es: Sistema de Archivos de Recuperación

source: On Linux systems, if you asked configure to use the ext2fs undelete facilities, you will have the undelete file system available. Recovery of deleted files is only available on ext2 file systems. The undelete file system is just an interface to the ext2fs library to: retrieve all of the deleted files names on an ext2fs and provides and to extract the selected files into a regular partition.
es: En sistemas Linux, si el programa de configuración nos preguntó si queríamos usar las facilidades de recuperación de archivos de ext2fs, tendremos el sistema de ficheros recuperables accesible. La recuperación de ficheros borrados está disponible sólo en los sistemas de ficheros ext2. El sistema de ficheros recuperable es sólo un interface de la librería ext2fs con: restaurar todos los ficheros borrados en un ext2fs y proporciona la extracción selectiva de ficheros en una partición regular.

source: To use this file system, you have to chdir into the special file name formed by the "undel:" prefix and the file name where the actual file system resides.
es: Para usar este sistema de ficheros, tendremos que hacer un chdir a un nombre de fichero especial formado por el prefijo "undel:" y el nombre de fichero donde se encuentra el sistema de ficheros actual.

source: For example, to recover deleted files on the second partition of the first scsi disk on Linux, you would use the following path name:
es: Por ejemplo, para recuperar ficheros borrados en la segunda partición del primer disco scsi en Linux, usaríamos el siguiente nombre de ruta:

source: It may take a while for the undelfs to load the required information before you start browsing files there.
es: Esto le llevaría un tiempo a undelfs para cargar la información antes de empezar a navegar por los ficheros allí contenidos.

source: Colors
es: Colores

source: The Midnight Commander will try to detect if your terminal supports color using the terminal database and your terminal name. Sometimes it gets confused, so you may force color mode or disable color mode using the -c and -b flag respectively.
es: Midnight Commander intentará determinar si nuestro terminal soporta el uso de color utilizando la base de datos del terminal y nuestro nombre de terminal. Algunas veces estará confundido, por lo que deberemos forzar el modo en color o deshabilitar el modo de color usando el argumento -c y -b respectivamente.

source: If the program is compiled with the Slang screen manager instead of ncurses, it will also check the variable B<COLORTERM,> if it is set, it has the same effect as the -c flag.
es: Si el programa está compilado con el gestor pantallas Slang en lugar de ncurses, también chequeará la variable B<COLORTERM,> si existe, lo que tiene el mismo efecto que la opción -c.

source: You may specify terminals that always force color mode by adding the I<color_terminals> variable to the Colors section of the initialization file. This will prevent the Midnight Commander from trying to detect if your terminal supports color. Example:
es: Podemos especificar a los terminales que siempre fuercen el modo en color añadiendo la variable I<color_terminals> a la sección Colors del fichero de inicialización. Esto evitará que Midnight Commander intente la detección de soporte de color. Ejemplo:

source: color_terminals=terminal-name1,terminal-name2...
es: color_terminals=nombre-terminal1,nombre-terminal2...

source: The program can be compiled with both ncurses and slang, ncurses does not provide a way to force color mode: ncurses uses just the information in the terminal database.
es: El programa puede compilarse con ncurses y slang, ncurses no ofrece la posibilidad de forzar el modo en color: ncurses utiliza la información de en la base de datos del terminal.

source: The Midnight Commander provides a way to change the default colors. Currently the colors are configured using the environment variable B<MC_COLOR_TABLE> or the Colors section in the initialization file.
es: Midnight Commander ofrece una forma de cambiar los colores por defecto. Actualmente los colores se configuran a través de la variable de entorno B<MC_COLOR_TABLE> o o la sección Colors en el fichero de inicialización.

source: In the Colors section, the default color map is loaded from the I<base_color> variable. You can specify an alternate color map for a terminal by using the terminal name as the key in this section. Example:
es: En la seccción Colors, se carga el mapa por defecto de colores desde la variable I<base_color>. Podemos especificar un mapa de colores alternativo para un terminal utilizando el nombre del terminal como clave en ésta sección. Ejemplo:

source: The format for the color definition is:
es: El formato de la definición de color es:

source: E<lt>keywordE<gt>=E<lt>foregroundcolorE<gt>,E<lt>backgroundcolorE<gt>:E<lt>keywordE<gt>= ...
es: E<lt>PalabraClaveE<gt>=E<lt>ColorTextoE<gt>,E<lt>ColorFondoE<gt>:E<lt>PalabraClaveE<gt>= ...

source: The colors are optional, and the keywords are: normal, selected, marked, markselect, errors, input, reverse menu, menusel, menuhot, menuhotsel, gauge; the dialog colors are: dnormal, dfocus, dhotnormal, dhotfocus; Help colors are: helpnormal, helpitalic, helpbold, helplink, helpslink; Viewer color is: viewunderline; Special highlighting mode: executable, directory, link, device, special.
es: Los colores son opcionales, y las palabras claves son: normal, selected, marked, markselect, errors, input, reverse menu, menusel, menuhot, menuhotsel, gauge; los colores por defecto son: dnormal, dfocus, dhotnormal, dhotfocus; Los colores de Ayuda son: helpnormal, helpitalic, helpbold, helplink, helpslink; Color del visor: viewunderline; Modo especial resaltado: executable, directory, link, device, special.

source: The dialog boxes use the following colors: I<dnormal> is used for the normal text, I<dfocus> is the color used for the currently selected component, I<dhotnormal> is the color used to differentiate the hotkey color in normal components, whereas the I<dhotfocus> color is used for the highlighted color in the currently selected component.
es: Los cuadros de diálogo usan los siguientes colores: I<dnormal> usado para el texto normal, I<dfocus> usado para el componente actualmente seleccionado, I<dhotnormal> usado para diferenciar el color de la tecla activa en los componentes normales, mientras que el color I<dhotfocus> se utiliza para el color resaltado en el componente seleccionado.

source: Menus use the same scheme but uses the menu, menusel, menuhot and menuhotsel tags instead.
es: Los menús utilizan el mismo esquema equivalente con los nombres menu, menusel, menuhot and menuhotsel en lugar de los anteriores.

source: Help uses the following colors: I<helpnormal> is used for normal text, I<helpitalic> is used for text which is emphasized in italic in the manual page, I<helpbold> is used for text which is emphasized in bold in the manual page, I<helplink> is used for not selected hyperlinks and I<helpslink> is used for selected hyperlink.
es: La ayuda utiliza los siguientes colores: I<helpnormal> texto normal, I<helpitalic> utilizado para el texto enfatizado con letra itálica en la página del manual, I<helpbold> usado para el texto enfatizado en negrita en la página del manual, I<helplink> usado para los hiperenlaces no seleccionados y I<helpslink> es uilizado para el hiperenlace seleccionado.

source: I<gauge> determines color of filled part of the progress bar (gauge), which shows how many percent of files were copied etc. in a graphical way.
es: I<gauge>(I<indicador>) determina el color de la parte completada de la barra de progresión (gauge), que muestra que porcentage de ficheros fueron copiados etc. de modo gráfico.

source: For file type highlighting mode I<directory> specifies the color in which directories are shown; I<executable> for executable files; I<link> is used to represent links; I<device> for character and block devices; I<special> is for special files, such as FIFO and IPC sockets; I<core> is for core files (see also the option B<highlight_mode> at the section on Special Settings).
es: Para el modo de resaltado del tipo de ficheros, I<directory> especifica el color con que se muestran los directorios; I<executable> para los ficheros ejecutables; I<link> usado para representar enlaces; I<device> para dispositivos de caracteres y de bloque; I<special> para ficheros especiales, tales como colas (FIFO) e IPC sockets; I<core> es para los ficheros volcados (véase también la opción B<highlight_mode> en la sección sobre Ajustes Especiales).

source: The possible colors are: black, gray, red, brightred, green, brightgreen, brown, yellow, blue, brightblue, magenta, brightmagenta, cyan, brightcyan, lightgray and white.
es: Los colores posibles son: negro (black), gris (gray), rojo (red), rojo brillante (brightred), verde (green), verde claro (brightgreen), marrón (brown), amarillo (yellow), azul oscuro (blue), azul brillante (brightblue), rosa (magenta), rosa claro (brightmagenta), azul celeste (cyan), celeste claro (brightcyan), gris claro (lightgray) y blanco (white).

source: Special Settings
es: Ajustes Especiales

source: Most of the settings of the Midnight Commander can be changed from the menus. However, there are a small number of settings which can only be changed by editing the setup file.
es: La mayoría de las opciones de Midnight Commander pueden cambiarse desde los menús. Sin embargo, hay un pequeño número de ajustes que sólo pueden ser modificados editando el fichero de configuración.

source: These variables may be set in your ~/.mc/ini file:
es: Esas variables pueden seleccionarse en nuestro fichero ~/.mc/ini:

source: By default the Midnight Commander clears the screen before executing a command. If you would prefer to see the output of the command at the bottom of the screen, edit your ~/mc.ini file and change the value of the field clear_before_exec to 0.
es: Por defecto Midnight Commander limpia la pantalla antes de ejecutar un comando. Si preferimos ver la salida del comando en la parte inferior de la pantalla, editaremos nuestro fichero ~/mc.ini y cambiaremos el valor del campo clear_before_exec a 0.

source: If you press F3 on a directory, normally MC enters that directory. If this flag is set to 1, then MC will ask for confirmation before changing the directory if you have files tagged.
es: Si pulsamos F3 en un directorio, normalmente MC entra en ese directorio. Si este valor está a 1, entonces MC pedirá confirmación antes de cambiar el directorio si tenemos ficheros marcados.

source: If this variable is set, when you press the F9 key, the pull down menus will be activated, else, you will only be presented with the menu title, and you will have to select the entry with the arrow keys or the first letter and from there select your option in the menu.
es: Si existe esta variable cuando pulsamos F9, los menús desplegables serán activados , si no, sólo aparecerá la cabecera de menú, y tendremos que seleccionar la entrada con las teclas del cursor o la primera letra y desde ahí seleccionar nuestra opción en el menú.

source: This value is the number of seconds the Midnight Commander will wait before attempting a reconnection to an ftp server that has denied the login. If the value is zero, the the program will not retry the login.
es: Este valor es el número de segundos que Midnight Commander esperará antes de intentar volver a conectar con un servidor de ftp que ha denegado el acceso. Si el valor es cero, el programa no reintentará el acceso.

source: This option is by off default. This makes the ftpfs code use the passive open mode for transfering files. This is used by people that are behind a filtering packet router. This option just works if you are not using an ftp proxy.
es: Esta opción está desactivada por defecto. Hace que el código de ftpfs utilice el modo de apertura pasivo para transferir ficheros. Esto es usado por aquellos que están detrás de un encaminador con filtrado de paquetes. Ésta opción sólo funciona si estamos utilizando un proxy para ftp.

source: Specifies how many screen updates can be skipped at most in the internal file viewer. Normally this value is not significant, because the code automatically adjusts the number of updates to skip according to the rate of incoming keypresses. However, on very slow machines or terminals with a fast keyboard auto repeat, a big value can make screen updates too jumpy.
es: Especifica cuantas actualizaciones de pantalla pueden saltarse al menos en el visor de ficheros interno. normalmente este valor no es significativo, porque el código automáticamente ajusta el número de actualizaciones a saltar de acuerdo alvolumen de pulsaciones de teclas recibidas. Empero, en máquinas muy lentas o en terminales con autorepetición de teclado rápida, un gran valor puede hacer que la pantalla se actualice dando saltos.

source: It seems that setting max_dirt_limit to 10 causes the best behavior, and that is the default value.
es: Parece ser que poniendo max_dirt_limit a 10 produce el mejor comportamiento, y éste es el valor por defecto.

source: Controls whenever scrolling with the mouse is done by pages or line by line on the panels.
es: Controla cuando el desplazamiento de pantalla realizado con el ratón se realiza por páginas o línea a línea en los paneles.

source: Controls if scrolling with the mouse is done by pages or line by line on the internal file viewer.
es: Controla cuando el desplazamiento de pantalla realizado con el ratón se realiza por páginas o línea a línea en el visor de ficheros interno.

source: If this setting is turned on, then you may use the arrows keys to automatically chdir if the current selection is a subdirectory and the shell command line is empty. By default, this setting is off.
es: Si esa opción está activada, entonces podremos utilizar las teclas del cursor para cambiar automáticamente de directorio si la selección actual es un subdirectorio y la línea de comandos del shell está vacía. Por defecto, esta opción estrá desactivada.

source: When on, this flag causes the commander to show a rotating dash as a work in progress indicator.
es: Cuando está activa, el Comandante mostrará una hélice como indicador de realización de trabajos.

source: By default the Midnight Commander treats the ESC key as a key prefix (old_esc_mode=0), if you set this option (old_esc_mode=1), then the ESC key will act as a prefix key for one second, and if no extra keys have arrived, then the ESC key is interpreted as a cancel key (ESC ESC).
es: Por defecto Midnight Commander trata la tecla ESC como prefijo de tecla (old_esc_mode=0), si activamos esta opción (old_esc_mode=1), entonces la tecla ESC actuará como prefijo de tecla durante un segundo , y si no hay pulsaciones, entonces ESC será interpretado como la tecla de cancelación (ESC ESC).

source: set special treatment for '+', '-', '*' in command line (select, unselect, reverse selection) only if command line is empty. No need to quote this characters in the middle of the command line. But we can not change selection when command line is not empty. I<panel_scroll_pages>
es: Produce un tratamiento especial para '+', '-', '*' en la línea de comandos (seleccionar, desseleccionar, selección inversa) sólo si la línea de comandos está vacía. No necesitamos entrecomillar estos caracteres en la línea de comandos . Pero no podremos cambiar la selección cuando la línea de comandos no esté vacía. I<panel_scroll_pages>

source: If set (the default), panel will scroll by half the display when the cursor reaches the end or the beginning of the panel, otherwise it will just scroll a file at a time.
es: Si existe (por defecto), el panel se desplazará media pantalla cuando el cursor alcance el final o el principio del panel, en otro caso se desplazará un fichero cada vez.

source: If this option is set (the default), when logged in as root the default will be to preserve the UID and the GID of files. Some users prefer to disable this option, so that's why it's configurable.
es: Si esta opción esta activa (por defecto), cuando entremos como root la norma será conservar los UID y GID de los ficheros. Algunos usuarios prefieren deshabilitar esta opción, por eso puede configurarse.

source: This variable only works if you are not using the subshell support. When you use the C-o keystroke to go back to the user screen, if this one is set, you will get a fresh shell. Otherwise, pressing any key will bring you back to the Midnight Commander.
es: Esta variable sólo funciona si no se utiliza el soporte de subshell. Cuando utilizamos la combinación C-o para volver a la pantalla de usuario, si está activada, tendremos un nuevo shell. De otro modo, pulsando cualquier tecla nos devolverá a Midnight Commander.

source: By default the Midnight Commander pops up all possible completions if the completion is ambiguous if you press B<M-Tab> for the second time, for the first time it just completes as much as possible and in the case of ambiguity beeps. If you want to see all the possible completions already after the first B<M-Tab> pressing, set this option to 1.
es: Por defecto Midnight Commander muestra todas las posibles terminaciones si la solución es ambígüa si pulsamos B<M-Tab> por segunda vez, la primera vez sólo completa hasta donde le sea posible y en caso de ambigüedad pita. Si queremos ver todas las posibles conclusiones antes de pulsar B<M-Tab> , pondremos esta opción a 1.

source: If this flag is set, then the home and end keys will work slightly different on the panels, instead of moving the selection to the first and last files in the panels, they will act as follows:
es: Si este modificador existe, entonces las teclas Inicio y Fin funcionarán de manera diferente en los paneles, en lugar de mover la selección al primer o último fichero en los paneles, actuarán como sigue:
