Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: For example, if you want to manipulate in one of the panels all the symbolic links in the current directory, you can use external panelization to run the following command:
es: Por ejemplo, si queremos manipular en uno de los paneles todos los enlaces simbólicos del directorio actual, ppodemos usar la panelización externa para ejecutar el siguiente comando:

source: Upon command completion, the directory contents of the panel will no longer be the directory listing of the current directory, but all the files that are symbolic links.
es: Hasta la finalización del comando, el contenido del directorio del panel no será el listado de directorios del directorio actual, pero sí todos los ficheros que son enlaces simbólicos.

source: If you want to panelize all of the files that have been downloaded from your ftp server, you can use this awk command to extract the file name from the transfer log files:
es: Si queremos panelizar todos los ficheros que hemos bajado de nuestro servidor ftp, podemos usar el comando awk para extraer el nombre del fichero de los ficheros de registro (log) de la transferencia:

source: You may want to save often used panelize commands under a descriptive name, so that you can recall them quickly. You do this by typing the command on the input line and pressing Add new button. Then you enter a name under which you want the command to be saved. Next time, you just choose that command from the list and do not have to type it again.
es: Tal vez podríamos necesitar guardar los comandos de panelización externa utilizados frecuentemente bajo un nombre descriptivo, de manera que podamos llamarlos rápidamente. Haremos ésto tecleando el comando en la línea de entrada y pulsando el botón "Añadir nuevo". Entonces introduciremos un nombre bajo el cual queremos que el comando sea guardado. La prosima vez, bastará elegir ese comando de la lista y no habrá que escribirlo de nuevo.

source: Hotlist
es: Lista de Directorios Frecuentes

source: The Directory hotlist command shows the labels of the directories in the directory hotlist. The Midnight Commander will change to the directory corresponding to the selected label. From the hotlist dialog, you can remove already created label/directory pairs and add new one. For adding you may want to use a standalone Add to hotlist command (C-x h), which adds the current directory into the directory hotlist, as well. The user is prompted for a label for the directory.
es: El historial de directorios muestra las etiquetas de los directorios en el histórico de directorios. Midnight Commander cambiará al directorio correspondiente a la etiqueta seleccionada. Desde el diálogo de la lista, podemos eliminar parejas etiqueta/directorio ya creadas y añadir una nueva. Para añadir podríamos necesitar de la utilización del comando Añadir a la lista (C-x h), que añade el directorio actual ( no el seleccionado) a la lista de directorios frecuentes. Se preguntará al usuario respecto a la etiqueta para el directorio.

source: This makes cd to often used directories faster. You may consider using the CDPATH variable as described in internal cd command description.
es: Esto hace el posicionamiento en directorios usados frecuentemente más rápido. Deberíamos considerar el uso de la variable CDPATH tal y como se describe en comando cd interno.

source: Extension File Edit
es: Edicion del Archivo de Extensiones

source: This will invoke your editor on the file ~/.mc/ext. The format of this file is as follows (the format has changed with version 3.0):
es: Esto invocará nuestro editor con el fichero ~/.mc/ext. El formato de este fichero es como sigue (el formato fue cambiado con la versión 3.0):

source: All lines starting with # or empty lines are thrown away.
es: Todas las líneas que empiezan con # o estaán vacías serán ignoradas.

source: Lines starting in the first column should have following format:
es: Las líneas que comiencen en la primera columna deberán tener el siguiente formato:

source: I<keyword/descNL,> i.e. everything after I<keyword/> until new line is I<desc>
es: I<PalabraClave/Descripción+NuevaLínea,> p.e. cualquier cosa después de I<palabraClave/> hasta el fin de línea es I<descripción>

source: keyword can be:
es: las palabras clave posibles son:

source: (desc is then any extension (no wildcards), i.e. matches all the files *desc . Example: .tar matches *.tar)
es: (desc es entonces cualquier extensión (sin comodines), p.e. para indicar todos los ficheros con extensión desc (*desc). Ejemplo: .tar indica *.tar)

source: (desc is a regular expression)
es: (desc es una expresión regular)

source: (file matches this if `file %f` matches regular expression desc (the filename: part from `file %f` is removed))
es: (el fichero coincide si `file %f` coincide con la expresión reular indicada en desc (el nombre de fichero: parte de `file %f` es eliminada))

source: (matches any file no matter what desc is)
es: (coincide con todo fichero sin importar su descripción)

source: Other lines should start with a space or tab and should be of the format:
es: Osus líneas deben comenzar con un espacio o tabulador y deben ser del siguiente formato:

source: I<keyword=commandNL> (with no spaces around =), where I<keyword> should be:
es: I<PalabraClave=comando+NuevaLínea> (sin espacios junto al =), donde I<PalabraClave> debe ser:

source: I<Open> (if the user presses Enter or doubleclicks it), I<View> (F3), I<Edit> (F4), I<Drop> (user drops some files on it) or any other user defined name (those will be listed in the extension dependent pop-up menu). I<Icon> name is reserved for future use by mc.
es: I<Open> (si el usuario pulsa Enter o dos veces el ratón), I<View> (F3), I<Edit> (F4), I<Drop> (user drops some files on it) or any other user defined name (those will be listed in the extension dependent pop-up menu). I<Icon> clave reservada para su futuro uso con mc.

source: I<command> is any one-line shell command, with the simple macro substitution.
es: I<comando> es cualquier comando en línea del shell, con substitución de macro simple.

source: Target are evaluated from top to bottom (order is thus important). If some actions are missing, search continues as if this target didn't match (i.e. if a file matches the first and second entry and View action is missing in the first one, then on pressing F3 the View action from the second entry will be used. default should catch all the actions.
es: El objetivo es evaluado de arriba abajo (el orden es importante). Si no están definidas algunas acciones, la búsqueda continúa como si el objetivo no coincidiese (p.e. si un fichero encaja con la primera y la segunda entrada y la acción Ver no está definida en la segunda, entonces al pulsar F3 la acción Ver desde la segunda entrada será utilizada. default debe capturar todas las acciones.

source: Background jobs
es: Trabajos en Segundo Plano

source: This lets you control the state of any background Midnight Commander process (only copy and move files operations can be done in the background). You can stop, restart and kill a background job from here.
es: Nos permite controlar el estado de cualquier proceso de Midnight Commander en segundo plano (sólolas operaciones de copiar y mover ficheros pueden realizarse en segundo plano). Podemos parar, reiniciar y eliminar procesos en segundo plano desde aquí.

source: Menu File Edit
es: Edicion del Archivo de Menu

source: The user menu is a menu of useful actions that can be customized by the user. When you access the user menu, the file .mc.menu from the current directory is used if it exists, but only if it is owned by user or root and is not world-writable. If no such file found, ~/.mc/menu is tried in the same way, and otherwise mc uses the default system-wide menu /usr/lib/mc/mc.menu.
es: El menú de usuario es un menú de acciones útilies que puede ser personalizado por el usuario. Cuando accedemos al menú de usuario, el fichero \&.mc.menu del directorio actual es utilizado si existe, pero sólo si es propiedad del usuario o del root y no es modificable por todos. Si ese fichero no es encontrado, se intenta con ~/.mc/menu del mismo modo, y si no, mc utiliza el menú por defecto para todo el sistema /usr/lib/mc/mc.menu.

source: The format of the menu file is very simple. Lines that start with anything but space or tab are considered entries for the menu (in order to be able to use it like a hot key, the first character should be a letter). All the lines that start with a space or a tab are the commands that will be executed when the entry is selected.
es: El formato del menú de fichero es muy simple. Las líneas que empiezan con todo excepto espacio o tab son consideradas entradas para el menú (para posibilitar su uso como atajo de teclado, el primer carácter deberá ser una letra). Todas las líneas que comienzan con tab o espacio son los comandos que serán ejecutados cuando la entrada es seleccionada.

source: When an option is selected all the command lines of the option are copied to a temporary file in the temporary directory (usually /usr/tmp) and then that file is executed. This allows the user to put normal shell constructs in the menus. Also simple macro substitution takes place before executing the menu code. For more information, see macro substitution.
es: Cuando se selecciona una opción todas las líneas de comandos de la opción se copian a un fichero temporal del directorio homónimo (normalmente /usr/tmp) y entonces es ejecutado el fichero. Esto permite al usuario poner constructores normales del shell en los menus. También tiene lugar una substitución simple de macros antes de ejecutar el código del menú. Para mayor información, ver Substitución de macro.

source: Here is a sample mc.menu file:
es: He aquí un ejemplo de fichero mc.menu:

source: A Dump the currently selected file od -c %f
es: A Vuelca el contenido del fichero seleccionado od -c %f

source: B Edit a bug report and send it to root vi /tmp/mail.$$ mail -s "Midnight Commander bug" root E<lt> /tmp/mail.$$
es: B Edita un informe de errores y lo envía al root vi /tmp/mail.$$ mail -s "Error Midnight Commander" root E<lt> /tmp/mail.$$

source: M Read mail emacs -f rmail
es: M Lee al correo emacs -f rmail

source: N Read Usenet news emacs -f gnus
es: N Lee las noticias de Usenet emacs -f gnus

source: H Call the info hypertext browser info
es: H Realiza una llamada al navegador hypertexto info info

source: J Copy current directory to other panel recursively tar cf - . | (cd %D && tar xvpf -)
es: J Copia recursivamente el directorio actual al otro panel tar cf - . | (cd %D && tar xvpf -)

source: K Make a release of the current subdirectory echo -n "Name of distribution file: " read tar ln -s %d `dirname %d`/$tar cd .. tar cvhf ${tar}.tar $tar
es: K Realiza una versión del directorio actual echo -n "Nombre del fichero de distribución: " read tar ln -s %d `dirname %d`/$tar cd .. tar cvhf ${tar}.tar $tar

source: = f *.tar.gz | f *.tgz & t n X Extract the contents of a compressed tar file tar xzvf %f
es: = f *.tar.gz | f *.tgz & t n X Extrae los contenidos de un fichero tar comprimido tar xzvf %f

source: B<Default Conditions>
es: B<Condiciones por Defecto>

source: Each menu entry may be preceded by a condition. The condition must start from the first column with a '=' character. If the condition is true, the menu entry will be the default entry.
es: Cada entrada del menú puede ir precedida por una condición. La condición debe comenzar desde la primera columna con un carácter '='. Si la condición es verdadera, la entrada del menú será la entrada por defecto.

source: Condition syntax: = E<lt>sub-condE<gt> or: = E<lt>sub-condE<gt> | E<lt>sub-condE<gt> ... or: = E<lt>sub-condE<gt> & E<lt>sub-condE<gt> ...
es: Sintaxs condicional: = E<lt>sub-condE<gt> o: = E<lt>sub-condE<gt> | E<lt>sub-condE<gt> ... o: = E<lt>sub-condE<gt> & E<lt>sub-condE<gt> ...

source: Sub-condition is one of following:
es: Sub-condición es una de las siguientes:

source: f E<lt>patternE<gt> current file matching pattern? F E<lt>patternE<gt> other file matching pattern? d E<lt>patternE<gt> current directory matching pattern? D E<lt>patternE<gt> other directory matching pattern? t E<lt>typeE<gt> current file of type? T E<lt>typeE<gt> other file of type? ! E<lt>sub-condE<gt> negate the result of sub-condition
es: f E<lt>patrónE<gt> ¿ el fichero actual encaja con el patrón? F E<lt>patrónE<gt> ¿ otro fichero encaja con el patrón? d E<lt>patrónE<gt> ¿ el directorio actual encaja con el patrón? D E<lt>patrónE<gt> ¿ otro directorio encaja con el patrón? t E<lt>tipoE<gt> ¿ fichero actual de tipo E<lt>tipoE<gt>? T E<lt>tipoE<gt> ¿ otro fichero de tipo E<lt>tipoE<gt>? ! E<lt>sub-condE<gt> niega el resultado de la sub-condición

source: Pattern is a normal shell pattern or a regular expression, according to the shell patterns option. You can override the global value of the shell patterns option by writing "shell_patterns=x" on the first line of the menu file (where "x" is either 0 or 1).
es: Patrón es un patrón normal del shell o una expresión regular, de acuerdo con la opción de patrones del shell. Podemos cambiar el valor global de la opción de los patrones del shell escribiendo "shell_patterns=x" en la primera línea del fichero de menú (donde "x" es 0 o 1).

source: Type is one or more of the following characters:
es: Tipo es uno o más de los siguientes caracteres:

source: n not directory r regular file d directory l link c char special b block special f fifo s socket x executable t tagged
es: n no directorio r fichero regular d directorio l enlace c carácter especial b bloque special f cola (fifo) s socket x ejecutable t marcado (tagged)

source: For example 'rlf' means either regular file, link or fifo. The 't' type is a little special because it acts on the panel instead of the file. The condition '=t t' is true if there are tagged files in the current panel and false if not.
es: Por ejemplo 'rlf' significa fichero regular, enlace o cola. El tipo 't' es un poco especial porque actúa sobre el panel en vez de sobre un fichero. La condición '=t t' es verdadera si existen ficheros marcados en el panel actual y falsa si no los hay.

source: If the condition starts with '=?' instead of '=' a debug trace will be shown whenever the value of the condition is calculated.
es: Si la condición comienza con '=?' en vez de '=' se mostrará un trazado de depuración mientras el valor de la condición es calculado.

source: The conditions are calculated from left to right. This means
es: Las condiciones son calculadas de izquierda a derecha. Esto significa que

source: is calculated as
es: es calculado como

source: Here is a sample of the use of conditions:
es: He aquí un ejemplo de uso de condiciones:

source: = f *.tar.gz | f *.tgz & t n L List the contents of a compressed tar-archive gzip -cd %f | tar xvf -
es: = f *.tar.gz | f *.tgz & t n L Lista el contenido de un archivo tar comprimido gzip -cd %f | tar xvf -

source: B<Addition Conditions>
es: B<Condiciones aditivas>

source: If the condition begins with '+' (or '+?') instead of '=' (or '=?') it is an addition condition. If the condition is true the menu entry will be included in the menu. If the condition is false the menu entry will not be included in the menu.
es: Si la condición comienza con '+' (o '+?') en lugar de '=' (o '=?') es una condición aditiva. Si la condición es verdadera la entrada de menú será incluida en el menú. Sin embargo, si la condición es falsa, la entrada de menú no será incluída en el menú.

source: You can combine default and addition conditions by starting condition with '+=' or '=+' (or '+=?' or '=+?' if you want debug trace). If you want to use two different conditions, one for adding and another for defaulting, you can precede a menu entry with two condition lines, one starting with '+' and another starting with '='.
es: Podemos combinar condiciones por defecto y aditivas comenzando la condición con '+=' o '=+' (o '+=?' o '=+?' si queremos depurar). Si nosotros queremos condiciones diferentes, una para añadir y otra por defecto, una entrada de menú con dos líneas de condición, una comenzando con '+' y otra con '='.

source: Comments are started with '#'. The additional comment lines must start with '#', space or tab.
es: Los comentarios empiezan con '#'. Las líneas adicionales de comentarios deben empezar con '#', espacio o tab.

source: Options Menu
es: Menu de Opciones

source: The Configuration command pops up a dialog from which you can change most of settings of the Midnight Commander.
es: El comando Configuración sobreimpresiona un diálogo desde el cual podemos cambiar la mayoría de opciones de Midnight Commander.

source: The Display bits command pops up a dialog from which you may select which characters is your terminal able to display.
es: El comando bits de despliegue sobreimpresiona un diálogo desde el que podemos seleccionar que caracteres es capaz de visualizar nuestro terminal.

source: The Confirmation command pops up a dialog from which you specify which actions you want to confirm.
es: El comando Confirmación Sobreimpresiona un diálogo desde el cual podemos especificar que acciones queremos confirmadas antes de ser realizadas.

source: The Learn keys command pops up a dialog from which you test some keys which are not working on some terminals and you may fix them.
es: El comando Aprender teclas Sobreimpresiona un diálogo desde el cual podemos testear algunas teclas que no funcionan en algunos terminales y podríamos solucionarlo.

source: The Virtual FS command pops up a dialog from which you specify some VFS related options.
es: El comando Opciones del VFS Sobreimpresiona un diálogo desde el cual podemos especificar algunas opciones relacionadas con VFS (Sistema de Archivos Virtual).

source: The Layout command pops up a dialog from which you specify a bunch of options how mc looks like on the screen.
es: El comando Disposición Sobreimpresiona un diálogo desde el cual podemos especificar unas cuantas opciones de cómo mc se presenta en pantalla.

source: The Save setup command saves the current settings of the Left, Right and Options menus. A small number of other settings is saved, too.
es: El comando Guardar configuración guarda los valores actuales de los menús Izquierdo, Derecho y Opciones. También es guardado un pequeño grupo de otros valores.

source: Configuration
es: Configuracion

source: The program has some options that may be toggled on and off from the Configuration dialog. Options are enabled if they have an asterisk or "x" in front of them. These options are divided into three groups: Screen Colors, Panel Options and Other Options.
es: El programa tiene algunas opciones que pueden ser activadas o desactivadas desde el diálogo de Configuración. Las opcioes están activas si tienen un asterisco o "x" delante. Esas opciones están divididas en tres grupos: Colores de Pantalla, Opciones del Panel y Otras Opciones.

source: B<Screen Colors>
es: B<Colores de Pantalla>

source: You can select whether your display supports color or not. Normally this information is in the terminfo database. If you want to know how to change individual colors see the section on Colors.
es: Podemos seleccionar cuando nuestra pantalla soporta color o no. Normalmente esta información está en la base de datos de terminfo. Para saber cómo cambiar colores individuales ver la sección sobre Colores.

source: B<Panel Options>
es: B<Opciones de Panel>

source: I<Show Backup Files.> By default the Midnight Commander doesn't show files ending in '~' (like GNU's ls option -B).
es: I<Mostrar Ficheros de Copia de Seguridad.> Por defecto, Midnight Commander no muestra ficheros terminados en '~' (como la opción -B de ls de GNU).

source: I<Show Hidden Files.> By default the Midnight Commander will show all files that start with a dot (like ls -a).
es: I<Mostrar Ficheros Ocultos.> Por defecto, Midnight Commander mostrará todos los ficheros que comienzan con un punto (como ls -a).

source: I<Mark moves down.> By default when you mark a file (with either C-t or the Insert key) the selection bar will move down.
es: I<Marcar Mueve el Cursor Hacia Abajo.> Por defecto, cuando marcamos un fichero (con C-t o la tecla Insert) la barra de selección se desplaza hacia abajo.

source: I<Show Mini-Status.> If enabled, show one line of status information at the bottom of the panels about the currently selected item.
es: I<Mostrar Mini-Estado.> Si está activa, muestra una línea de información de estado en la parte inferior de los paneles sobre el ítem actualmente seleccionado.

source: I<Mix all files.> When this option is enabled, all files and directories are shown mixed together. If the option is off, directories (and links to directories) are shown at the beginning of the listing, and other files afterwards.
es: I<Mezclar todos los archivos.> Cuando esta opción está habilitada, todos los ficheros y directorios son mostrados mezclados juntos. Si la opción está desactivada, los directorios (y enlaces a los mismos) son mostrados al principio de la lista, y el resto de ficheros a continuación.

source: I<Fast directory reload.> This option is off by default. If you activate the fast reload, the Midnight Commander will use a trick to determine if the directory contents have changed. The trick is to reload the directory only if the i-node of the directory has changed; this means that reloads only happen when files are created or deleted. If what changes is the i-node for a file in the directory (file size changes, mode or owner changes, etc) the display is not updated. In these cases, if you have the option on, you have to rescan the directory manually (with C-r).
es: I<Carga rápida de contenido del directorio.> Esta opción está desactivada por defecto. Si la activamos, Midnight Commander usará un truco para determiar si los contenidos del directorio han cambiado. El truco consiste en recargar el directorio sólo si el nodo-i del directorio ha cambiado; esto significa que las recargas suceden sólo cuando los ficheros son creados o borrados. Si lo que cambia es el nodo-i de un fichero en el directorio (cambia el tamaño del fichero, cambia el modo o propietario, etc) la pantalla nos es actualizada. En esos casos, si tenemos la opción activada, deberemos reescanear el directorio manualmente (con C-r).

source: B<Other Options>
es: B<Otras Opciones>

source: I<Verbose operation.> This toggles whether the file Copy, Rename and Delete operations are verbose (i.e., display a dialog box for each operation). If you have a slow terminal, you may wish to disable the verbose operation. It is automatically turned off if the speed of your terminal is less than 9600 bps.
es: I<Operación detallada.> Indica cuando las operaciones de copia, renombrado y eliminación de ficheros son detalladas (p.e., muestra un cuadro de diálogo para cada operación). Si tenemos un terminal lento, podríamos querer desactivar la operación detallada. Ésta es automáticamente desactivada si la velocidad de nuestro terminal es menor de 9600 bps.

source: I<Pause after run.> After executing your commands, the Midnight Commander can pause, so that you can examine the output of the command. There are three possible settings for this variable:
es: I<Pausa después de ejecutar.> Tras ejecutar nuestros comandos, Midnight Commander puede pausar, de tal modo que podamos examinar la salida del comando. Hay tres posibles selecciones para ésta variable:

source: I<Never> Means that you do not want to see the output of your command. If you are using the Linux or SCO console or an xterm, you will be able to see the output of the command by typing C-o.
es: I<Nunca> Significa que no queremos ver la salida de nuestros comandos. Si estamos utilizando la consola Linux o SCO o un xterm, podremos ver la salida del comando pulsando C-o.
