Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: The home key will: Go up to the middle line, if below it; else go to the top line unless it is already on the top line, in this case it will go to the first file in the panel.
es: La tecla Inicio: Irá a la línea central del panel, si está bajo ella; sino va a la primera línea a menos que ya esté allí, en este caso irá al primer fichero del panel.

source: The end key has a similar behavior: Go down to the middle line, if over it; else go to the bottom line unless you already are at the bottom line, in such case it will move the selection to the last file name in the panel.
es: La tecla Fin tiene un comportamiento similar: Irá a la línea central del panel, si está situada en la mitad superior del panel; si no irá a la línea inferior del panel a menos que ya estémos ahí, en cuyo caso movera la selección al último nombre de fichero del panel.

source: I<highlight_mode> By default all information on panels displayed with the same color. If this variable is set to 1, then I<perm> or I<mode> tokens in display format get ability to show access rights of the user to the shown file. Appropriate triplet of reading, writing and execution rights highlighted with the yellow ( I<selected> ) color. In addition, if the variable is equal to 2, then all lines are displaying by the color according to their type (see Colors). Permissions highlighting also works in this mode.
es: I<highlight_mode> Por defecto toda la información de los paneles se mostrará con el mismo color. Si esta variable está a 1, entonces las señales I<perm> o I<mode> en el formato de pantalla tendrán la habilidad de mostrar los derechos de acceso del usuario para el fichero mostrado. Un trio adecuado de derechos de lectura, escritura y ejecución destacados con el color amarillo ( I<selected> ). Además, si la variable es igual a 2, entonces todas las líneas serán mostradas con el color que corresponda a su tipo (véase Colores). La enfatización por colores también funciona en este modo.

source: If this variable is on (the default) it will spawn the file command to match the file types listed on the mc.ext file.
es: Si esta variable está activa (por defecto) engendrará el comando de fichero para corresponder con los tipos de ficheros listados en el fichero mc.ext.

source: If this variable is on (default is off) when you browse the file system on a Tree panel, it will automatically reload the other panel with the contents of the selected directory.
es: Si esta variable es activada (por defecto no) cuando naveguemos por el sistema de ficheros en un panel en árbol, será recargado automáticamente el otro panel con los contenidos del directorio seleccionado.

source: Terminal databases
es: Bases de Datos del Terminal

source: The Midnight Commander provides a way to fix your system terminal database without requiring root privileges. The Midnight Commander searches in the system initialization file (the mc.lib file located in the Midnight Commander library directory) or in the ~/.mc/ini file for the section "terminal:your-terminal-name" and then for the section "terminal:general", each line of the section contains a key symbol that you want to define, followed by an equal sign and the definition for the key. You can use the special \eE form to represent the escape character and the ^x to represent the control-x character.
es: Midnight Commander ofrece un modo de solucionar nuestra base de datos del terminal del sistemasin necesidad de los privilegios del root. Midnight Commander busca en el fichero de inicialización el sistema (el fichero mc.lib localizado en directorio de librería de Midnight Commander) o en el fichero ~/.mc/ini en la sección "terminal:nuestro-nombre-de-terminal" y si no en la sección "terminal:general", cada línea de la sección contiene un símbolo de la tecla que queremos definir, seguido de un signo igual y la definición para la tecla. Podemos usar el formato especial \eE para representar el carácter escape y ^x para representar el carácter control-x.

source: The possible key symbols are:
es: Los símbolos posibles de tecla son:

source: f0 to f20 Function keys f0-f20 bs backspace home home key end end key up up arrow key down down arrow key left left arrow key right right arrow key pgdn page down key pgup page up key insert the insert character delete the delete character complete to do completion
es: f0 a f20 Teclas de función f0-f20 bs retroespacio (BS o E<lt>--) home tecla Inicio end tecla Fin up tecla cursor arriba down tecla cursor abajo left tecla cursor izquierda right tecla cursor derecha pgdn tecla Avance de página (Av Pág) pgup tecla Retroceso de página (Re Pág) insert tecla Insertar carácter (Insert) delete tecla Suprimir carácter (Supr) complete tecla de terminación de nombres

source: For example, to define the key insert to be the Escape + [ + O + p, you set this in the ini file:
es: Por ejemplo, para definir la tecla insert como Escape + [ + O + p, seleccionamos esto en el fichero ini:

source: The I<complete> key symbol represents the escape sequences used to invoke the completion process, this is invoked with M-tab, but you can define other keys to do the same work (on those keyboard with tons of nice and unused keys everywhere).
es: El símbolo de tecla I<complete> representa la secuencia de escape usada para invocar el proceso de terminación de nombres, lo que se hace con M-tab, pero podemos definir otras teclas para que realizen el mismo trabajo (en esos teclados con toneladas de preciosas e inútiles teclas por todas partes).

source: FILES
es: FICHEROS

source: The help file for the program.
es: Fichero de ayuda para el programa.

source: The default system-wide extensions file.
es: fichero genérico de extensiones de sistema.

source: User's own extension, view configuration and edit configuration file. They override the contents of the system wide files if present.
es: Fichero de extensiones del usuario, configuración del visor y el editor. Sobreescribe el contenido del fichero genérico del sistema si está presente.

source: The default system-wide setup for the Midnight Commander, used only if the user lacks his own ~/.mc/ini file.
es: Fichero de configuración genérico de sistema para Midnight Commander, sólo si el usuario estropea su propio fichero ~/.mc/ini.

source: Global settings for the Midnight Commander. Settings in this file are global to any Midnight Commander, it is useful to define site-global terminal settings.
es: Opciones globales de Midnight Commander. La configuración de este fichero es global para cualquier Midnight Commander, es útil definir las opciones globales de la configuración del terminal.

source: User's own setup. If this file is present then the setup is loaded from here instead of the system-wide startup file.
es: Configuración personal del usuario. Si este fichro está presente entonces se cargará la configuración desde aquí en lugar de desde el fichero genérico de configuración para todo el sistema.

source: This file contains the hints (cookies) displayed by the program.
es: Este fichero contiene las pistas (caramelos) mostradas por el programa.

source: This file contains the default system-wide applications menu.
es: Este fichero contiene el menú de aplicaciones por defecto para el sistema.

source: User's own application menu. If this file is present it is used instead of the system-wide applications menu.
es: Menú personal de aplicaciones del usuario. si este fichero se halla presente será utilizado en lugar del fichero genérico de aplicaciones.

source: The directory list for the directory tree and tree view features. Each line is one entry. The lines starting with a slash are full directory names. The lines starting with a number have that many characters equal to the previous directory. If you want you may create this file by giving the command "find / -type d -print | sort E<gt> ~/.mc.tree". Normally there is no sense in doing it because the Midnight Commander automatically updates this file for you.
es: La lista de directorios para el árbol de directorios y las características de la vista de árbol. Cada línea es una entrada. Las líneas que comienzan con una barra son nombres de directorio completos. Las líneas que comienzan con un número caracteres igual al directorio anterior. Si queremos crear este fichero dando el comando "find / -type d -print | sort E<gt> ~/.mc.tree". Normalmente no tiene sentido hacerlo porque Midnight Commander automáticamente actualiza por nosotros este fichero.

source: Local user-defined menu. If this file is present it is used instead of the home or system-wide applications menu.
es: Menú local definido por el usuario. Si este fichero está presente será usado en lugar del menú de aplicaciones personal o de sistema.

source: LICENSE
es: LICENCIA

source: This program is distributed under the terms of the GNU General Public License as published by the Free Software Foundation. See the built-in help for details on the License and the lack of warranty.
es: Este programa es distribuido bajo los términos de la Licencia Pública General de GNU License as published by the Free Software Foundationcomo fue publicado por la Fundación de Software Libre (Free Software Foundation). Véase la ayuda incorporada para más detalles sobre la Licencia y la ausencia de garantía.

source: AVAILABILITY
es: DISPONIBILIDAD

source: The latest version of this program can be found at ftp.nuclecu.unam.mx in the directory /linux/local and from Europe at sunsite.mff.cuni.cz in the directory /GNU/mc and at ftp.teuto.de in the directory /lmb/mc.
es: La última versión de este programa puede encontrarse en ftp.nuclecu.unam.mx en el directorio /linux/local y desde Europa en sunsite.mff.cuni.cz en el directorio /GNU/mc y en ftp.teuto.de en el directorio /lmb/mc.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: The Midnight Commander page on the World Wide Web: http://mc.blackdown.org/mc
es: La página de Midnight Commander en el Web: http://mc.blackdown.org/mc

source: AUTHORS
es: AUTORES

source: Miguel de Icaza (miguel@roxanne.nuclecu.unam.mx), Janne Kukonlehto (jtklehto@paju.oulu.fi), Radek Doulik (rodo@earn.cvut.cz), Fred Leeflang (fredl@nebula.ow.org), Dugan Porter (dugan@b011.eunet.es), Jakub Jelinek (jj@sunsite.mff.cuni.cz), Ching Hui (mr854307@cs.nthu.edu.tw), Andrej Borsenkow (borsenkow.msk@sni.de), Norbert Warmuth (k3190@fh-sw.de), Mauricio Plaza (mok@roxanne.nuclecu.unam.mx) and Paul Sheer (psheer@icon.co.za) are the developers of this package; Alessandro Rubini (rubini@ipvvis.unipv.it) has been especially helpful debugging and enhancing the program's mouse support, John Davis (davis@space.mit.edu) also made his S-Lang library available to us under the GPL and answered my questions about it, and the following people have contributed code and many bug fixes (in alphabetical order):
es: Miguel de Icaza (miguel@roxanne.nuclecu.unam.mx), Janne Kukonlehto (jtklehto@paju.oulu.fi), Radek Doulik (rodo@earn.cvut.cz), Fred Leeflang (fredl@nebula.ow.org), Dugan Porter (dugan@b011.eunet.es), Jakub Jelinek (jj@sunsite.mff.cuni.cz), Ching Hui (mr854307@cs.nthu.edu.tw), Andrej Borsenkow (borsenkow.msk@sni.de), Norbert Warmuth (k3190@fh-sw.de), Mauricio Plaza (mok@roxanne.nuclecu.unam.mx) y Paul Sheer (psheer@icon.co.za) son los desarrolladores de este paquete; Alessandro Rubini (rubini@ipvvis.unipv.it) ha sido especialmente útil depurando y mejorando el soporte de ratón del programa, John Davis (davis@space.mit.edu) también hizo su librería S-Lang disponible para nosotros bajo la GPL y respondió a mis preguntas sobre ella, y la siguientes personashan contribuido con código y la corrección de muchos errores (en orden alfabético):

source: BUGS
es: FALLOS

source: See the file TODO in the distribution for information on what remains to be done.
es: Vésase el fichero "TODO" en la distribución para saber que falta por hacer.

source: If you want to report a problem with the program, please send mail to this address: mc-bugs@roxanne.nuclecu.unam.mx.
es: Si quieres informar de algún problema con el programa, por favor envía un mensaje a ésta dirección: mc-bugs@roxanne.nuclecu.unam.mx.

source: Provide a detailed description of the bug, the version of the program you are running (mc -V display this information), the operating system you are running the program on and if the program crashes, we would appreciate a stack trace.
es: informa detalladamente sobre el error, la versión del programa que estás ejecutando (mc -V muestra esta información), el sistema operativo en el que estás ejecutando el programa y si el programa se estrella, apreciaríamos mucho un trazado de la pila.
