Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/mc.1.po
Languages: es

source: For example, if the source mask is '*' (shell patterns on) or '^\e(.*\e)$' (shell patterns off) and the target mask is '\eL\eu*' the file names will be converted to have initial upper case and otherwise lower case.
es: Por ejemplo, si la máscara fuente es '*' (patrones del shell activo) o '^\e(.*\e)$' (patrones del shell desactivo) y la máscara destino es '\eL\eu*' los nombres de ficheros serán convertidos para que tengan su inicial en mayúscula y el resto del nombre minúscula.

source: You can also use '\e' as a quote character. For example, '\e\e' is a backslash and '\e*' is an asterisk.
es: También podemos usar '\e' como carácter de comentario. Por ejemplo, '\e\e' es una contrabarra y '\e*' es un asterisco.

source: Internal File Viewer
es: Visor de Ficheros Interno

source: The internal file viewer provides two display modes: ASCII and hex. To toggle between modes, use the F4 key. If you have the GNU gzip program installed, it will be used to automatically decompress the files on demand.
es: El visor de ficheros interno posee dos modos de pantalla: ASCII y hexadecimal. Para intercambiar entre modos, usaremos la tecla F4. Si tenemos el programa GNU gzip instalado, se usará automáticamente para descomprimir los ficheros según se necesite.

source: The viewer will try to use the best method provided by your system or the file type to display the information. The internal file viewer will interpret some string sequences to set the bold and underline attributes, thus making a pretty display of your files.
es: El visor intentará usar el mejor método posible en nuestro sistema o o el tipo de fichero para mostrar la información. El visor interno de ficheros interpretará algunas secuencias de cadenas para activar los atributos de negrita y subrayado, para conseguir una apariencia mejor de nuestros ficheros.

source: When in hex mode, the search function accepts text in quotes as well as hexadecimal constants.
es: En modo hexadecimal, la función de búsqueda acepta texto entre comillas así como constantes hexadecimales.

source: You can mix quoted text with constants like this: "String" 0xFE 0xBB "more text". Text between constants and quoted text is just ignored.
es: Podemos intercalar ambas al mismo tiempo como sigue: "Cadena" 0xFE 0xBB "más texto". Todo texto entre constantes y comillas será ignorado.

source: Some internal details about the viewer: On systems that provide the mmap(2) system call, the program maps the file instead of loading it; if the system does not provide the mmap(2) system call or the file matches an action that requires a filter, then the viewer will use it's growing buffers, thus loading only those parts of the file that you actually access (this includes compressed files).
es: Angunos detalles internos del visualizador: En sistemas con acceso a la llamada del sistema mmap(2), el programa mapea el fichero en vez de cargarlo; si el sistema no provee de la llamada al sistema mmap(2) o o el fichero realiza una acción que necesita de un filtro, entonces el visor usará sus cachés de crecimiento, cargando sólo las partes del fichero a las que actualmente estamos accediendo (esto incluye a los ficheros comprimidos).

source: Here is a listing of the actions associated with each key that the Midnight Commander handles in the internal file viewer.
es: He aquí unalista de las acciones asociadas a cada tecla que Midnight Commander gestiona en el visor interno de ficheros.

source: B<F1> Invoke the builtin hypertext help viewer.
es: B<F1> Invoca el visor de ayuda de hipertexto interno.

source: B<F2> Toggle the wrap mode.
es: B<F2> Cambia el modo de ajuste de líneas en pantalla. E<.SM N. del T.-> Envuelta (Ajustada), si muestra toda la información de la línea en la pantalla, de modo que si ésta ocupa más del ancho de la pantalla aparece como si fuese otra línea aparte o bien desenvuelta (desajustada), truncando el contenido de la línea que sobresale de la pantalla. Éste contenido puede ser consultado utilizando las teclas del cursor.

source: B<F4> Toggle the hex mode.
es: B<F4> Cambia entre el modo hexadecimal y el Ascii.

source: B<F5> Goto line. This will prompt you for a line number and will display that line.
es: B<F5> Ir a la línea. Nos pedirá el número de línea en el que deseamos posicionarnos y y mostrará el fichero a partir de esa línea.

source: B<F6, /.> Regular expression search.
es: B<F6, /.> Búsqueda de expresión regular desde la posición actual hacia adelante.

source: B<?,> Reverse regular expression search.
es: B<?,> Búsqueda de expresión regular desde la posición actual hacia atrás.

source: B<F7> Normal search / hex mode search.
es: B<F7> Búsqueda normal/ búsqueda en modo hexadecimal.

source: B<C-s.> Start normal search if there was no previous search expression else find next match.
es: B<C-s.> Comienza una búsqueda normal si no existe una expresión de búsqueda previa si no buscar la próxima coincidencia.

source: B<C-r.> Start reverse search if there was no previous search expression else find next match.
es: B<C-r.> Comienza una búsqueda hacia atrás si no había expresión de búsqueda anterior si no buscar la próxima coincidencia.

source: B<n.> Find next match.
es: B<n.> Buscar la proxima coincidencia.

source: B<F8> Toggle Raw/Parsed mode: This will show the file as found on disk or if a processing filter has been specified in the mc.ext file, then the output from the filter. Current mode is always the other than written on the button label, since on the button is the mode which you enter by that key.
es: B<F8> Intercambia entre el modo crudo y procesado: esto mostrará el fichero como se encuentra en disco o si se ha especificado un filtro de visualización en el fichero mc.ext, entonces la salida filtrada. El modo actual es siempre el contrario al mostrado en la etiqueta del botón, entanto que el botón muestra el modo en el que entraremos con la pulsación de esa tecla.

source: B<F10, Esc.> Exit the internal file viewer.
es: B<F10, Esc.> Sale del visor interno.

source: B<next-page, space, C-v.> Scroll one page forward.
es: B<Av pág, espacio, C-v.> Avanza una página hacia abajo.

source: B<prev-page, M-v, C-b, backspace.> Scroll one page backward.
es: B<Re pág, M-v, C-b, Retroespacio.> Retrocede una página hacia arriba.

source: B<down-key> Scroll one line forward.
es: B<Cursor Abajo> Despaza el texto una línea hacia arriba, mostrando en la línea inerior de la pantalla una nueva línea que antes quedaba oculta.

source: B<up-key> Scroll one line backward.
es: B<Cursor Arriba> Desplaza una línea hacia abajo.

source: B<C-l> Refresh the screen.
es: B<C-l> Redibuja el contenido de la pantalla.

source: B<!> Spawn a shell in the currently working directory.
es: B<!> Engendra un nuevo shell en el directorio de trabajo actual.

source: B<[n] m> Set the mark n.
es: B<[n] m> Coloca la marca n.

source: B<[n] r> Jump to the mark n.
es: B<[n] r> Salta hasta la marca n.

source: B<C-f> Jump to the next file.
es: B<C-f> Salta al fichero siguiente.

source: B<C-b> Jump to the previous file.
es: B<C-b> Idem al fichero anterior.

source: B<M-r> Toggle the ruler.
es: B<M-r> Intercambia entre los diferentes modos de regla: desactivado, arriba, abajo.

source: It's possible to instruct the file viewer how to display a file, look at the Extension File Edit section
es: Es posible adiestrar al visor de ficheros sobre cómo mostrar un fichero, mírese la sección Editar Archivo de Extensiones.

source: Internal File Editor
es: Editor de Ficheros Interno

source: The internal file editor provides most of the features of common full screen editors. It is invoked using B<F4> provided the I<use_internal_edit> option is set in the initialization file. It has an extensible file size limit of sixteen megabytes and edits binary files flawlessly.
es: El editor interno proporciona la mayoría de funcionalidades de los editores comunes de pantalla completa. Es invocado pulsando B<F4> indicado por la variable I<use_internal_edit> en el fichero de inicialización. Tiene un tamaño límite de fichero extensible de dieciseis megabytes y edita los ficheros binarios de manera impecable.

source: The features it presently supports are: Block copy, move, delete, cut, paste; I<key for key undo ;> pull-down menus; file insertion; macro definition; regular expression search and replace (and our own scanf-printf search and replace); shift-arrow MSW-MAC text highlighting (for the linux console only); insert-overwrite toggle; and an option to pipe text blocks through shell commands like indent.
es: Las características actualmente soportadas son: Copia desplazamiento, borrado, corte, y pegado de bloques; I<tecla para tecla Deshacer ;> menús emergentes; inserción de ficheros; definición de macros; expresión regular buscar y reemplazar (y nuestra propia localizar y cambiar de scanf-printf ); resaltado de texto tipo MS Windows-Macintosh con mayúsculas-cursor (para la consola de linux sólo); intercambio insertar-sobreescribir ; y una opción para pasar bloques de texto a los comandos del shell sangrado.

source: The editor is very easy to use and requires no tutoring. To see what keys do what, just consult the appropriate pull-down menu. Other keys are: Shift movement keys do text highlighting. B<Ctrl-Ins> copies to the file B<cooledit.clip and> B<Shift-Ins> pastes from cooledit.clip. B<Shift-Del> cuts to B<cooledit.clip,> and B<Ctrl-Del> deletes highlighted text. The completion key also does a Return with an automatic indent. Mouse highlighting also works, and you can override the mouse as usual by holding down the shift key while dragging the mouse to let normal terminal mouse highlighting work.
es: El editor es muy fácil de utilizar y no requiere de aprendizaje alguno. Para conocer la función de las teclas, basta consultar el menú emergente apropiado. Otras teclas son: Mayúsculas + teclas de movimiento producen el resaltado de texto. B<Ctrl-Insert> copia al fichero B<cooledit.clip>y B<Mayúsculas-Insert> pega desde B<cooledit.clip.> B<Mayúsculas-Supr> corta a B<cooledit.clip,> y B<Ctrl-Supr> Elimina el texto resaltado. La tecla de terminación también realiza un Return con un sangrado automático. la selección con ratón también funciona, y podemos utilizar el ratón normalmente manteniendo pulsada la tecla mayúsculas mientras arrastramos el ratón para permitir el trabajo normal del ratón en el terminal.

source: To define a macro, press B<Ctrl-R> and then type out the key strokes you want to be executed. Press B<Ctrl-R> again when finished. You can then assign the macro to any key you like by pressing that key. The macro is executed when you press B<Ctrl-A and then the assigned key. The macro is also executed if> you press Meta, Ctrl, or Esc and the assigned key, provided that the key is not used for any other function. Once defined, the macro commands go into the file B<cedit/cooledit.macros> in your home directory. You can delete a macro by deleting the appropriate line in this file.
es: Para definir una macro, pulsar B<Ctrl-R> y entonces teclearemos las secuencias de teclas que deseamos sean ejecutadas B<Ctrl-R> de nuevo al finalizar. Podemos asignar la macro a la tecla que queramos pulsándo sobre ella. La macro será ejecutada cuando pulsemos B<Ctrl-A> seguido de la tecla asignada. También será ejecutada si pulsamos Meta (Alt), Ctrl, o Escape y la tecla asignada, siempre y cuando la tecla no sea usada por ninguna otra función. Una vez definida, los comandos de macro irán al fichero B<cedit/cooledit.macros> en nuestro directorio de inicio. Podemos eliminar una macro borrando la línea adecuada en este fichero.

source: B<F19 will format C code when it is highlighted. For this> to work, make an executable file called B<cedit/edit.indent.rc> in your home directory containing the following:
es: B<F19> formateará código C cuando esté resaltado. Para que funcione esto, crearemos un fichero ejecutable llamado B<cedit/edit.indent.rc> en nuestro directorio de inicio conteniendo lo siguiente:

source: You can use scanf search and replace to search and replace a C format string. First take a look at the B<sscanf> and B<sprintf man pages to see what a format string> is and how it works. An example is as follows: Suppose you want to replace all occurences of say, an open bracket, three comma seperated numbers, and a close bracket, with the word I<apples,> the third number, the word I<oranges> and then the second number, I would fill in the Replace dialog box as follows:
es: Podemos usar la búsqueda scanf y Buscar y cambiar una cadena en formato C. Primero miraremos las páginas del manual de B<sscanf> y B<sprintf para saber qué formato de cadena> es y cómo funciona. Un ejemplo es como sigue: Supongamos que queremos cambiar todas las apariciones de un paréntesis abierto, tres números separados por coma, y un paréntesis cerrado, con la palabra I<Melones_De_Pozo-Estrecho,> el tercer número, la palabra I<Tomates_De_Mazarrón> y el segundo número, Completaremos el diálogo del cuadro de Reemplazo como sigue:

source: Enter search string (%d,%d,%d) Enter replace string apples %d oranges %d Enter replacement argument order 3,2
es: Introduce la cadena a buscar (%d,%d,%d) Introduce la cadena de remplazo Melones_De_Pozo-Estrecho %d Tomates_De_Mazarrón %d Introduce el orden de los argumentos de reemplazo 3,2

source: The last line specifies that the third and then the second number are to be used in place of the first and second.
es: La última línea especifica que el tercer y el segundo deben ser usados en lugar de la primera y la segunda.

source: It is advisable to use this feature with Prompt on replace on, because a match is thought to be found whenever the number of arguments found matches the number given, which is not always a real match. Scanf also treats whitespace as being elastic. Note that the scanf format % is very useful for scanning strings, and whitespace.
es: Es conveniente usar esta característica con "Confirmar cambios" marcado, porque una coincidencia es aquella que se encuentra cuando el número de argumentos coincide con el número dado, lo cual no siempre es cierto. Scanf también trata el espacio en blanco como si fuese elástico. Démonos cuenta de que el formato de scanf format % es muy útil para rastrear cadenas, y el espacio en blanco.

source: The editor also displays non-us characters (160+). When editing binary files, you should set B<display bits> to 7 bits in the options menu to keep the spacing clean.
es: El editor también visualiza caracteres no estadounidenses (160+). Cuando se editan ficheros binarios, deberíamos configurar los B<bits de pantalla> a 7 bits en el menú de opciones para guardar el espacio limpio.

source: See also the file B<README.edit> in the source tree for some more info.
es: Véase también el fichero B<LEAME.edit> para mayor información.

source: Completion
es: Terminación

source: Let the Midnight Commander type for you.
es: Permite a Midnight Commander escribir por nosotros.

source: Attempt to perform completion on the text before current position. MC attempts completion treating the text as variable (if the text begins with B<$> ), username (if the text begins with B<~> ), hostname (if the text begins with B<@> ) or command (if you are on the command line in the position where you might type a command, possible completions then include shell reserved words and shell builtin commands as well) in turn. If none of these produces a match, filename completion is attempted.
es: Intenta realizar la terminación del texto antes de la posición actual. MC intenta la terminación tratando el texto como una variable (si el texto comienza con B<$> ), nombre de usuario (si el texto empieza por B<~> ), nombre de máquina (si el texto es comenzado con B<@> ) o comando (si estamos en la línea de comandos en la posición donde podríamos escribir un comando, las terminaciones posibles entonces incluyen palabras reservadas del shell así como comandos internos del shell) en turno. Si nada de lo anterior coincide, se intenta la terminación con nombres de fichero.

source: Filename, username, variable and hostname completion works on all input lines, command completion is command line specific. If the completion is ambiguous (there are more different possibilities), MC beeps and the following action depends on the setting of the show_all_if_ambiguous variable in the Initialization file. If it is nonzero, a list of all possibilities pops up next to the current position and you can select with the arrow keys and B<Enter> the correct entry. You can also type the first letters in which the possibilities differ to move to a subset of all possibilities and complete as much as possible. If you press B<M-Tab> again, only the subset will be shown in the listbox, otherwise the first item which matches all the previous characters will be highlighted. As soon as there is no ambiguity, dialog disappears, but you can hide it by canceling keys B<Esc,> B<F10> and left and right arrow keys. If show_all_if_ambiguous is set to zero, the dialog pops up only if you press B<M-Tab> for the second time, for the first time MC just beeps.
es: La terminación de nombre de fichero, de usuario y máquina funciona en todas las líneas de entrada, la terminación de comando es específica de la línea de comandos. Si la terminación es ambigüa (hay más posibilidades diferentes), MC pita y la acción siguiente depende de la configuración de la variable show_all_if_ambiguous en el fichero de inicialización. si no es cero, una lista de todas las posibilidades aparece cerca de la posición y podemos seleccionar con las teclas del cursor y B<Enter> la entrada correcta. Podemos escribir también las letras iniciales en las que las distintas posibilidades se mueven a un conjunto de todas las posibilidades y completan tanto como sea posible. Si pulsamos B<M-Tab> de nuevo, sólo el subconjunto será mostrado en el cuadro de la lista, el resto el primer ítem que coincida con todos los caracteres preios será resaltado. Tan pronto como no haya ambigüedad, el diálogo desaparece, pero podemos ocultarlo con las teclas de cancelación B<Esc,> B<F10> y las teclas de movimiento del cursor horizontal. Si show_all_if_ambiguous es puesto a cero, el diálogo se sobreimpresiona en pantalla sólo si pulsamos B<M-Tab> por segunda vez, con la primera MC sólo hace sonar un pitido.

source: Virtual File System
es: Sistema de Ficheros Virtual

source: The Midnight Commander is provided with a code layer to access the file system; this code layer is known as the virtual file system switch. The virtual file system switch allows the Midnight Commander to manipulate files not located on the Unix file system.
es: Midnight Commander se entrega con una capa de código para acceder al sistema de ficheros; esta capa de código es conocida como el selector del sistema virtual de ficheros. El selector del Sistema de Ficheros Virtual (SFV) permite a Midnight Commander manipular ficheros no localizados en el sistema de ficheros Unix.

source: Currently the Midnight Commander is packaged with five Virtual File Systems (VFS): the local file system, used for accessing the regular Unix file system; the ftpfs, used to manipulate files on remote systems with the FTP protocol; the tarfs, used to manipulate tar and compressed tar files; the undelfs, used to recover deleted files on ext2 file systems (the default file system for Linux systems) and finally the mcfs (Midnight Commander file system), a network based file system.
es: Actualente Midnight Commander está preparado para cinco SFV: el sistema de ficheros local, utilizado para acceder al sitema Unix común; el ftpfs, que manipula ficheros en sistemas remotos a través del protocolo FTP (File Transfer Protocol); el tarfs, usado para manipular ficheros tar o tar comprimidos; el undelfs, utilizado para recuperar ficheros borrados en sistemas de ficheros ext2 (el sistema de ficheros por defecto para sistemas Linux) y finalmente el mcfs (Midnight Commander file system), un sistema de ficheros de red.

source: The VFS switch code will interpret all of the path names used and will forward them to the correct file system, the formats used for each one of the file systems is described later in their own section.
es: El código selector de VFS interpretará todos los nombres de ruta usados y los encaminará al SF correcto, el formato usado para cada uno de los sistemas de ficheros es descrito más tarde en su propia sección.

source: FTP File System
es: Sistema de Ficheros FTP

source: The ftpfs allows you to manipulate files on remote machines, to actually use it, you may try to use the panel command FTP link (accessible from the menubar) or you may directly change your current directory to it using the cd command to a path name that looks like this:
es: El ftpfs permite manpular ficheros en máquinas remotas, para usarlo ahora, deberíamos intentar usar el comando del panel "Conexión FTP" (accesible desde los menús laterales iz. y der.) o podemos cambiar directamente nuestro directorio actual utilizando el comando cd con la ruta tal como esto:

source: I<ftp://[!][user[:pass]@]machine[:port][remote-dir]>
es: I<ftp://[!][usuario[:clave]@]maquina[:puerto][directorio-remoto]>

source: The, I<user, port> and I<remote-dir> elements are optional. If you specify the I<user> element, then the Midnight Commander will try to logon on the remote machine as that user, otherwise it will use your login name. The optional I<pass> element, if present is the password used for the connection. This use is not recomented (nor keeping this in your hotlist, unless you set the appropiate permissions there, and then, it may not be entirely safe anyways).
es: Los elementos, I<usuario>, I<puerto> y I<directorio-remoto> son opcionales (Entre corchetes, []). Si especificamos el elemento I<usuario>, entonces Midnight Commander intentará entrar en la máquina remota como ese usuario, en otro caso usará nuestro login. El elemento opcional I<clave>, si está presente es la clave de acceso usada para autentificar la conexión. Ésto no se recomienda (no guardarlo en nuestra lista de accesos frecuentes, a menos que seleccionemos los atributos adecuados aquí, y aún así, no será seguro de ninguna manera).

source: Examples:
es: Ejemplos:

source: ftp://ftp.nuclecu.unam.mx/linux/local ftp://tsx-11.mit.edu/pub/linux/packages ftp://!behind.firewall.edu/pub ftp://guest@remote-host.com:40/pub ftp://miguel:xxx@server/pub
es: ftp://ftp.nuclecu.unam.mx/linux/local ftp://tsx-11.mit.edu/pub/linux/packages ftp://!behind.firewall.edu/pub ftp://guest@remote-host.com:40/pub ftp://miguel:xxx@server/pub ftp://ftp.um.es/pub

source: To connect to sites behind a firewall, you will need to use the prefix ftp://! (ie, with a bang character after the double slash) to make the Midnight Commander use a proxy host for doing the ftp transfer. You can define the proxy host in the Virtual File System dialog box.
es: Para acceer a lugares tras un cortafuegos usaremos el prefijo ftp://! (es decir, con una exclamación tras la doble barra) para hacer que Midnight Commander utilice un proxy para realizar la tranferencia ftp. Podemos el proxy en el cuadro de diálogo Sistema de Ficheros Virtual.
