Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/passwd.1.po
Languages: es

source: 11 November 1996
es: 11 Noviembre 1996

source: Linux Programmer's Manual
es: Manual del Programador de Linux

source: NAME
es: NOMBRE

source: passwd - change password
es: passwd - cambia contraseñas

source: SYNOPSIS
es: SINOPSIS

source: B<passwd> [B< -o >] [B< -q >] [B< -v >] [I< name >[I< password >]]
es: B<passwd> [B< -o >] [B< -q >] [B< -v >] [I< usuario >[I< contraseña >]]

source: B<passwd -f > [I< arguments to chfn >]
es: B<passwd -f > [I< parámetros para el cambio de nombre completo del usuario >]

source: B<passwd -s > [I< arguments to chsh >]
es: B<passwd -s > [I< parámetros para el cambio de shell >]

source: DESCRIPTION
es: DESCRIPCIÓN

source: Without arguments B<passwd> will change the password for the current user. First the user is asked for the old password, then prompted twice for the new password in order to catch typing errors.
es: Cuando se utiliza sin parámetros B<passwd> cambia la contraseña para el usuario que lo invoca. Primero le exigirá la contraseña vigente, y a continuación pedirá dos veces la nueva para prevenir errores de escritura.

source: Giving an empty string as the second argument erases the password for the user, but only in combination with the B<-o> option.
es: Indicar una cadena vacía como el segundo parámetro borra la contraseña para el usuario, pero sólo en combinación de la opción B<-o>.

source: Password changes may get logged using the B<syslog>(3) facility, depending on compile-time defines (on by default). If so, every change will be logged at a low level as auth.notice, except for changing the root password with will be logged with auth.warning.
es: Los cambios de contraseña pueden registrarse utilizando el servicio B<syslog>(3), dependiendo de las definiciones hechas en tiempo de compilación del programa (estando esta característica activa por omisión). Si es así, todos los cambios se registrarán a un nivel bajo como auth.notice, excepto para cambiar la contraseña del superusuario (root); en este caso se registrarán con nivel auth.warning.

source: OPTIONS
es: OPCIONES

source: Change the user's full name (the GECOS field of the passwd entry). Invokes /usr/bin/chfn with the non-option command line arguments.
es: Cambia el nombre completo del usuario (el campo GECOS del registro de contraseñas). Invoca el programa /usr/bin/chfn utilizando los parámetros que ha recibido que no son opciones.

source: Turn off simplicity checks on the new password. This option may only be used by the super user. This is intend to allow simple initial passwords given by the superuser.
es: Desactiva las verificaciones de validación sobre la nueva contraseña . Sólo puede ser utilizada por el superusuario, y está pensado para permitirle asignar contraseñas iniciales simples.

source: Change the user's shell by invoking /usr/bin/chsh with the non-option command line arguments.
es: Cambia el shell del usuario mediante la invocación del programa /usr/bin/chsh con los parámetros recibidos que no son opciones.

source: In this mode passwd won't tell that the passwd get's changed.
es: En este modo de funcionamiento passwd no indica que la contraseña se haya cambiado.

source: Prints version information and exits.
es: Muestra información acerca de la versión del programa y finaliza.

source: PASSWORD RULES
es: REGLAS DE CONTRASEÑAS

source: The new password must fulfill these rules:
es: La nueva contraseña debe cumplir estas reglas:

source: be at least six characters long;
es: tener como mínimo seis caracteres;

source: must not be equal to the old password;
es: no ser igual a la contraseña anterior;

source: must contain characters out of at least two of the following classes: upper and lower case letters, digits and non alphanumeric characters;
es: contener caracteres que pertenezcan, como mínimo, a dos de las siguientes categorías: mayúsculas y minúsculas, dígitos y caracteres no alfanuméricos;

source: must not match neither the username nor any word of the realname, neither in normal nor in reverse order, neither at the beginning nor at the end.
es: no debe coincidir ni con el nombre del usuario, ni con ninguna de las palabras que forman su nombre completo (real), tanto en orden normal como inverso, ni al principio ni al final.

source: BUGS
es: FALLOS

source: If you change your mind there is no escaping from this program. It will insist on a new password until killed from another terminal. (This is caused by a bug in getpass(3): it ignores signals.)
es: Si cambia de opinión no hay escape del programa. Insistirá en obtener una contraseña nueva hasta que sea muerto (mediante kill) desde otro terminal. (Esto es provocado por un fallo en getpass(3): e ignora las señales.)

source: FILES
es: FICHEROS

source: The password file.
es: El archivo que contiene las contraseñas.

source: SEE ALSO
es: VÉASE TAMBIÉN

source: AUTHOR
es: AUTOR

source: Martin Schulze (joey@infodrom.north.de) with extensive rewriting and improving done.
es: Martin Schulze (joey@infodrom.north.de) con extensas mejoras y reescrituras.

source: MAINTAINER
es: MANTENIMIENTO
