Repository: krisfremen/manpages-l10n
Catalog: po/*/archive/man1/tload.1.po
Languages: hu

source: 20 Mar 1993
hu: 1993. március 20.

source: Linux Programmer's Manual
hu: Linux felhasználói kézikönyv

source: NAME
hu: NÉV

source: tload - graphic representation of system load average
hu: tload - a rendszer átlagos terhelésének grafikus ábrázolása

source: SYNOPSIS
hu: ÁTTEKINTÉS

source: B<tload> [B<-V>] [B<-s> I<scale>] [ B<-d>I< delay> ] [I<tty>]
hu: B<tload> [B<-V>] [B<-s> I<skála>] [ B<-d>I< késleltetés> ] [I<tty>]

source: DESCRIPTION
hu: LEÍRÁS

source: B<tload> prints a graph of the current system load average to the specified I<tty> (or the tty of the tload process if none is specified).
hu: A B<tload> egy grafikont rajzol ki a jelenlegi rendszerterhelés alapján, a megadott I<tty> -re (vagy ha ezt elhagyjuk, akkor arra, amelyikről a tload elindult).

source: Options
hu: Kapcsolók

source: The B<-s>I< scale> option allows a vertical scale to be specified for the display (in characters between graph ticks); thus, a smaller value represents a larger scale, and vice versa.
hu: A B<-s>I< skála> kapcsoló megjelenítéskor egy függőleges beosztást ad (az egyes beosztások közti távolságot karakter léptékben adhatjuk meg). Így alacsony értékeknél nagyobb beosztást célszerű megadni, és fordítva.

source: The B<-d>I< delay> sets the delay between graph updates in seconds.
hu: A B<-d>I< késleltetés> -sel két grafikon kirajzolása közti időt adhatjuk meg másodpercekben.

source: FILES
hu: FÁJLOK

source: I</proc/loadavg> load average information
hu: I</proc/loadavg> az átlagos terhelés adatai

source: SEE ALSO
hu: LÁSD MÉG

source: BUGS
hu: HIBÁK

source: The B<-d>I< delay> option sets the time argument for an B<alarm>(2); if -d 0 is specified, the alarm is set to 0, which will never send the B<SIGALRM> and update the display.
hu: A B<-d>I< késleltetés> kapcsoló átállítja az idő paraméterét az B<alarm>(2) függvénynek. Ha a -d 0 van beállítva, akkor az alarm is 0-ra állítódik, és így sosem fogja kiküldeni a B<SIGALRM> -ot és frissíteni a képernyőt.

source: AUTHORS
hu: KÉSZÍTŐK

source: Branko Lankester, David Engel E<lt>david@ods.comE<gt>, and Michael K. Johnson E<lt>johnsonm@redhat.comE<gt>.
hu: Branko Lankester, David Engel E<lt>david@ods.comE<gt>, és Michael K. Johnson E<lt>johnsonm@redhat.comE<gt>.

source: Please send bug reports to E<lt>procps-bugs@redhat.comE<gt>
hu: Ha hibát találnál a programban, akkor a pontos leírását küldd el procps-bugs@redhat.com címre (angolul). Ha a fordításban találsz kivetnivalót, akkor ugyanezt az aries@vlug.vein.hu címre tedd. Köszönjük.
