Repository: krisfremen/manpages-l10n
Catalog: po/man7/iso_8859-7.7.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: iso_8859-7 - ISO 8859-7 character set encoded in octal, decimal, and hexadecimal
de: iso_8859-7 - ISO 8859-7-Zeichensatz in oktaler, dezimaler und hexadezimaler Kodierung

source: DESCRIPTION
de: BESCHREIBUNG

source: The ISO 8859 standard includes several 8-bit extensions to the ASCII character set (also known as ISO 646-IRV). ISO 8859-7 encodes the characters used in modern monotonic Greek.
de: Der Standard ISO 8859 enthält verschiedene 8-Bit-Erweiterungen des ASCII- Zeichensatzes (auch als ISO 646-IRV bekannt). ISO 8859-7 kodiert die Zeichen, die in der modernen monotonischen griechischen Sprache verwendet werden.

source: ISO 8859 alphabets
de: ISO-8859-Alphabete

source: The full set of ISO 8859 alphabets includes:
de: Der vollständige Satz von ISO-8859-Alphabeten umfasst:

source: ISO 8859-1 West European languages (Latin-1)
de: ISO 8859-1 Westeuropäische Sprachen (Latin-1)

source: ISO 8859-2 Central and East European languages (Latin-2)
de: ISO 8859-2 Mittel- und Osteuropäische Sprachen (Latin-2)

source: ISO 8859-3 Southeast European and miscellaneous languages (Latin-3)
de: ISO 8859-3 Südosteuropäische und sonstige Sprachen (Latin-3)

source: ISO 8859-4 Scandinavian/Baltic languages (Latin-4)
de: ISO 8859-4 Skandinavische/Baltische Sprachen (Latin-4)

source: ISO 8859-5 Latin/Cyrillic
de: ISO 8859-5 Lateinisch/Kyrillisch

source: ISO 8859-6 Latin/Arabic
de: ISO 8859-6 Lateinisch/Arabisch

source: ISO 8859-7 Latin/Greek
de: ISO 8859-7 Lateinisch/Griechisch

source: ISO 8859-8 Latin/Hebrew
de: ISO 8859-8 Lateinisch/Hebräisch

source: ISO 8859-9 Latin-1 modification for Turkish (Latin-5)
de: ISO 8859-9 Latin-1-Anpassung für Türkisch (Latin-5)

source: ISO 8859-10 Lappish/Nordic/Eskimo languages (Latin-6)
de: ISO 8859-10 Sami/Nordische/Eskimo-Sprachen (Latin-6)

source: ISO 8859-11 Latin/Thai
de: ISO 8859-11 Lateinisch/Thai

source: ISO 8859-13 Baltic Rim languages (Latin-7)
de: ISO 8859-13 Skandinavische/Baltische Sprachen (Latin-7)

source: ISO 8859-14 Celtic (Latin-8)
de: ISO 8859-14 Keltisch (Latin-8)

source: ISO 8859-15 West European languages (Latin-9)
de: ISO 8859-15 Westeuropäische Sprachen (Latin-9)

source: ISO 8859-16 Romanian (Latin-10)
de: ISO 8859-16 Rumänisch (Latin-10)

source: ISO 8859-7 characters
de: ISO-8859-7-Zeichen

source: The following table displays the characters in ISO 8859-7, which are printable and unlisted in the B<ascii>(7) manual page.
de: Die folgende Tabelle enthält die druckbaren Zeichen von ISO 8859-7, die nicht in der Handbuchseite von B<ascii>(7) aufgeführt sind.

source: Oct Dec Hex Char Description
de: Okt Dez Hex Zeichen Beschreibung

source: 240 160 A0 \ NO-BREAK SPACE
de: 240 160 A0 \ GESCHÜTZTES LEERZEICHEN

source: 241 161 A1 ‘ LEFT SINGLE QUOTATION MARK
de: 241 161 A1 ‘ LINKES EINFACHES ANFÜHRUNGSZEICHEN

source: 242 162 A2 ’ RIGHT SINGLE QUOTATION MARK
de: 242 162 A2 ’ RECHTES EINFACHES ANFÜHRUNGSZEICHEN

source: 243 163 A3 £ POUND SIGN
de: 243 163 A3 £ BRITISCHES PFUND

source: 244 164 A4 € EURO SIGN
de: 244 164 A4 € EUROZEICHEN

source: 245 165 A5 ₯ DRACHMA SIGN
de: 245 165 A5 ₯ DRACHME-ZEICHEN

source: 246 166 A6 ¦ BROKEN BAR
de: 246 166 A6 ¦ UNTERBROCHENE VERTIKALE LINIE

source: 247 167 A7 § SECTION SIGN
de: 247 167 A7 § PARAGRAPH (SECTION SIGN)

source: 250 168 A8 ¨ DIAERESIS
de: 250 168 A8 ¨ TREMA, DIÄRESE (UMLAUTZEICHEN)

source: 251 169 A9 © COPYRIGHT SIGN
de: 251 169 A9 © COPYRIGHTZEICHEN

source: 252 170 AA ͺ GREEK YPOGEGRAMMENI
de: 252 170 AA ͺ GRIECHISCHES IOTA SUBSCRIPTUM

source: 253 171 AB « LEFT-POINTING DOUBLE ANGLE QUOTATION MARK
de: 253 171 AB « LINKSWEISENDES GUILLEMET

source: 254 172 AC ¬ NOT SIGN
de: 254 172 AC ¬ NICHT-ZEICHEN

source: 255 173 AD ­ SOFT HYPHEN
de: 255 173 AD ­ WEICHES TRENNZEICHEN

source: 257 175 AF ― HORIZONTAL BAR
de: 257 175 AF ― HORIZONTALE LINIE

source: 260 176 B0 ° DEGREE SIGN
de: 260 176 B0 ° GRAD

source: 261 177 B1 ± PLUS-MINUS SIGN
de: 261 177 B1 ± PLUS-MINUS-ZEICHEN

source: 262 178 B2 ² SUPERSCRIPT TWO
de: 262 178 B2 ² HOCHGESTELLTE ZWEI

source: 263 179 B3 ³ SUPERSCRIPT THREE
de: 263 179 B3 ³ HOCHGESTELLTE DREI

source: 264 180 B4 ΄ GREEK TONOS
de: 264 180 B4 ΄ GRIECHISCHER TONOS

source: 265 181 B5 ΅ GREEK DIALYTIKA TONOS
de: 265 181 B5 ΅ GRIECHISCHE DIALYTIKA TONOS

source: 266 182 B6 Ά GREEK CAPITAL LETTER ALPHA WITH TONOS
de: 266 182 B6 Ά GRIECHISCHER GROSSBUCHSTABE ALPHA MIT TONOS

source: 267 183 B7 · MIDDLE DOT
de: 267 183 B7 · MITTELPUNKT (DIAKRITISCHES ZEICHEN)

source: 270 184 B8 Έ GREEK CAPITAL LETTER EPSILON WITH TONOS
de: 270 184 B8 Έ GRIECHISCHER GROSSBUCHSTABE EPSILON MIT TONOS

source: 271 185 B9 Ή GREEK CAPITAL LETTER ETA WITH TONOS
de: 271 185 B9 Ή GRIECHISCHER GROSSBUCHSTABE ETA MIT TONOS

source: 272 186 BA Ί GREEK CAPITAL LETTER IOTA WITH TONOS
de: 272 186 BA Ί GRIECHISCHER GROSSBUCHSTABE IOTA MIT TONOS

source: 273 187 BB » RIGHT-POINTING DOUBLE ANGLE QUOTATION MARK
de: 273 187 BB » RECHTSWEISENDES GUILLEMET

source: 274 188 BC Ό GREEK CAPITAL LETTER OMICRON WITH TONOS
de: 274 188 BC Ό GRIECHISCHER GROSSBUCHSTABE OMIKRON MIT TONOS

source: 275 189 BD ½ VULGAR FRACTION ONE HALF
de: 275 189 BD ½ GEWÖHNLICHER BRUCH EIN HALB

source: 276 190 BE Ύ GREEK CAPITAL LETTER UPSILON WITH TONOS
de: 276 190 BE Ύ GRIECHISCHER GROSSBUCHSTABE YPSILON MIT TONOS

source: 277 191 BF Ώ GREEK CAPITAL LETTER OMEGA WITH TONOS
de: 277 191 BF Ώ GRIECHISCHER GROSSBUCHSTABE OMEGA MIT TONOS

source: GREEK SMALL LETTER IOTA WITH
de: GRIECHISCHER KLEINBUCHSTABE IOTA MIT

source: DIALYTIKA AND TONOS
de: DIALYTIKA UND TONOS

source: 301 193 C1 Α GREEK CAPITAL LETTER ALPHA
de: 301 193 C1 Α GRIECHISCHER GROSSBUCHSTABE ALPHA

source: 302 194 C2 Β GREEK CAPITAL LETTER BETA
de: 302 194 C2 Β GRIECHISCHER GROSSBUCHSTABE BETA

source: 303 195 C3 Γ GREEK CAPITAL LETTER GAMMA
de: 303 195 C3 Γ GRIECHISCHER GROSSBUCHSTABE GAMMA

source: 304 196 C4 Δ GREEK CAPITAL LETTER DELTA
de: 304 196 C4 Δ GRIECHISCHER GROSSBUCHSTABE DELTA

source: 305 197 C5 Ε GREEK CAPITAL LETTER EPSILON
de: 305 197 C5 Ε GRIECHISCHER GROSSBUCHSTABE EPSILON

source: 306 198 C6 Ζ GREEK CAPITAL LETTER ZETA
de: 306 198 C6 Ζ GRIECHISCHER GROSSBUCHSTABE ZETA

source: 307 199 C7 Η GREEK CAPITAL LETTER ETA
de: 307 199 C7 Η GRIECHISCHER GROSSBUCHSTABE ETA

source: 310 200 C8 Θ GREEK CAPITAL LETTER THETA
de: 310 200 C8 Θ GRIECHISCHER GROSSBUCHSTABE THETA

source: 311 201 C9 Ι GREEK CAPITAL LETTER IOTA
de: 311 201 C9 Ι GRIECHISCHER GROSSBUCHSTABE IOTA

source: 312 202 CA Κ GREEK CAPITAL LETTER KAPPA
de: 312 202 CA Κ GRIECHISCHER GROSSBUCHSTABE KAPPA

source: 313 203 CB Λ GREEK CAPITAL LETTER LAMBDA
de: 313 203 CB Λ GRIECHISCHER GROSSBUCHSTABE LAMBDA

source: 314 204 CC Μ GREEK CAPITAL LETTER MU
de: 314 204 CC Μ GRIECHISCHER GROSSBUCHSTABE MY

source: 315 205 CD Ν GREEK CAPITAL LETTER NU
de: 315 205 CD Ν GRIECHISCHER GROSSBUCHSTABE NY

source: 316 206 CE Ξ GREEK CAPITAL LETTER XI
de: 316 206 CE Ξ GRIECHISCHER GROSSBUCHSTABE XI

source: 317 207 CF Ο GREEK CAPITAL LETTER OMICRON
de: 317 207 CF Ο GRIECHISCHER GROSSBUCHSTABE OMIKRON

source: 320 208 D0 Π GREEK CAPITAL LETTER PI
de: 320 208 D0 Π GRIECHISCHER GROSSBUCHSTABE PI

source: 321 209 D1 Ρ GREEK CAPITAL LETTER RHO
de: 321 209 D1 Ρ GRIECHISCHER GROSSBUCHSTABE RHO

source: 323 211 D3 Σ GREEK CAPITAL LETTER SIGMA
de: 323 211 D3 Σ GRIECHISCHER GROSSBUCHSTABE SIGMA

source: 324 212 D4 Τ GREEK CAPITAL LETTER TAU
de: 324 212 D4 Τ GRIECHISCHER GROSSBUCHSTABE TAU

source: 325 213 D5 Υ GREEK CAPITAL LETTER UPSILON
de: 325 213 D5 Υ GRIECHISCHER GROSSBUCHSTABE YPSILON

source: 326 214 D6 Φ GREEK CAPITAL LETTER PHI
de: 326 214 D6 Φ GRIECHISCHER GROSSBUCHSTABE PHI

source: 327 215 D7 Χ GREEK CAPITAL LETTER CHI
de: 327 215 D7 Χ GRIECHISCHER GROSSBUCHSTABE CHI

source: 330 216 D8 Ψ GREEK CAPITAL LETTER PSI
de: 330 216 D8 Ψ GRIECHISCHER GROSSBUCHSTABE PSI

source: 331 217 D9 Ω GREEK CAPITAL LETTER OMEGA
de: 331 217 D9 Ω GRIECHISCHER GROSSBUCHSTABE OMEGA

source: 332 218 DA Ϊ GREEK CAPITAL LETTER IOTA WITH DIALYTIKA
de: 332 218 DA Ϊ GRIECHISCHER GROSSBUCHSTABE IOTA MIT DIALYTIKA

source: 333 219 DB Ϋ GREEK CAPITAL LETTER UPSILON WITH DIALYTIKA
de: 333 219 DB Ϋ GRIECHISCHER GROSSBUCHSTABE YPSILON MIT DIALYTIKA

source: 334 220 DC ά GREEK SMALL LETTER ALPHA WITH TONOS
de: 334 220 DC ά GRIECHISCHER KLEINBUCHSTABE ALPHA MIT TONOS

source: 335 221 DD έ GREEK SMALL LETTER EPSILON WITH TONOS
de: 335 221 DD έ GRIECHISCHER KLEINBUCHSTABE EPSILON MIT TONOS

source: 336 222 DE ή GREEK SMALL LETTER ETA WITH TONOS
de: 336 222 DE ή GRIECHISCHER KLEINBUCHSTABE ETA MIT TONOS

source: 337 223 DF ί GREEK SMALL LETTER IOTA WITH TONOS
de: 337 223 DF ί GRIECHISCHER KLEINBUCHSTABE IOTA MIT TONOS

source: GREEK SMALL LETTER UPSILON WITH
de: GRIECHISCHER KLEINBUCHSTABE YPSILON MIT

source: 341 225 E1 α GREEK SMALL LETTER ALPHA
de: 341 225 E1 α GRIECHISCHER KLEINBUCHSTABE ALPHA

source: 342 226 E2 β GREEK SMALL LETTER BETA
de: 342 226 E2 β GRIECHISCHER KLEINBUCHSTABE BETA

source: 343 227 E3 γ GREEK SMALL LETTER GAMMA
de: 343 227 E3 γ GRIECHISCHER KLEINBUCHSTABE GAMMA

source: 344 228 E4 δ GREEK SMALL LETTER DELTA
de: 344 228 E4 δ GRIECHISCHER KLEINBUCHSTABE DELTA

source: 345 229 E5 ε GREEK SMALL LETTER EPSILON
de: 345 229 E5 ε GRIECHISCHER KLEINBUCHSTABE EPSILON

source: 346 230 E6 ζ GREEK SMALL LETTER ZETA
de: 346 230 E6 ζ GRIECHISCHER KLEINBUCHSTABE ZETA

source: 347 231 E7 η GREEK SMALL LETTER ETA
de: 347 231 E7 η GRIECHISCHER KLEINBUCHSTABE ETA

source: 350 232 E8 θ GREEK SMALL LETTER THETA
de: 350 232 E8 θ GRIECHISCHER KLEINBUCHSTABE THETA

source: 351 233 E9 ι GREEK SMALL LETTER IOTA
de: 351 233 E9 ι GRIECHISCHER KLEINBUCHSTABE IOTA

source: 352 234 EA κ GREEK SMALL LETTER KAPPA
de: 352 234 EA κ GRIECHISCHER KLEINBUCHSTABE KAPPA

source: 353 235 EB λ GREEK SMALL LETTER LAMBDA
de: 353 235 EB λ GRIECHISCHER KLEINBUCHSTABE LAMBDA

source: 354 236 EC μ GREEK SMALL LETTER MU
de: 354 236 EC μ GRIECHISCHER KLEINBUCHSTABE MY

source: 355 237 ED ν GREEK SMALL LETTER NU
de: 355 237 ED ν GRIECHISCHER KLEINBUCHSTABE NY

source: 356 238 EE ξ GREEK SMALL LETTER XI
de: 356 238 EE ξ GRIECHISCHER KLEINBUCHSTABE XI

source: 357 239 EF ο GREEK SMALL LETTER OMICRON
de: 357 239 EF ο GRIECHISCHER KLEINBUCHSTABE OMIKRON

source: 360 240 F0 π GREEK SMALL LETTER PI
de: 360 240 F0 π GRIECHISCHER KLEINBUCHSTABE PI

source: 361 241 F1 ρ GREEK SMALL LETTER RHO
de: 361 241 F1 ρ GRIECHISCHER KLEINBUCHSTABE RHO

source: 362 242 F2 ς GREEK SMALL LETTER FINAL SIGMA
de: 362 242 F2 ς GRIECHISCHER KLEINBUCHSTABE SIGMA AM WORTENDE

source: 363 243 F3 σ GREEK SMALL LETTER SIGMA
de: 363 243 F3 σ GRIECHISCHER KLEINBUCHSTABE SIGMA

source: 364 244 F4 τ GREEK SMALL LETTER TAU
de: 364 244 F4 τ GRIECHISCHER KLEINBUCHSTABE TAU

source: 365 245 F5 υ GREEK SMALL LETTER UPSILON
de: 365 245 F5 υ GRIECHISCHER KLEINBUCHSTABE YPSILON

source: 366 246 F6 φ GREEK SMALL LETTER PHI
de: 366 246 F6 φ GRIECHISCHER KLEINBUCHSTABE PHI

source: 367 247 F7 χ GREEK SMALL LETTER CHI
de: 367 247 F7 χ GRIECHISCHER KLEINBUCHSTABE CHI

source: 370 248 F8 ψ GREEK SMALL LETTER PSI
de: 370 248 F8 ψ GRIECHISCHER KLEINBUCHSTABE PSI

source: 371 249 F9 ω GREEK SMALL LETTER OMEGA
de: 371 249 F9 ω GRIECHISCHER KLEINBUCHSTABE OMEGA

source: 372 250 FA ϊ GREEK SMALL LETTER IOTA WITH DIALYTIKA
de: 372 250 FA ϊ GRIECHISCHER KLEINBUCHSTABE IOTA MIT DIALYTIKA

source: 373 251 FB ϋ GREEK SMALL LETTER UPSILON WITH DIALYTIKA
de: 373 251 FB ϋ GRIECHISCHER KLEINBUCHSTABE YPSILON MIT DIALYTIKA

source: 374 252 FC ό GREEK SMALL LETTER OMICRON WITH TONOS
de: 374 252 FC ό GRIECHISCHER KLEINBUCHSTABE OMIKRON MIT TONOS

source: 375 253 FD ύ GREEK SMALL LETTER UPSILON WITH TONOS
de: 375 253 FD ύ GRIECHISCHER KLEINBUCHSTABE YPSILON MIT TONOS

source: 376 254 FE ώ GREEK SMALL LETTER OMEGA WITH TONOS
de: 376 254 FE ώ GRIECHISCHER KLEINBUCHSTABE OMEGA MIT TONOS

source: NOTES
de: ANMERKUNGEN

source: ISO 8859-7 was formerly known as ELOT-928 or ECMA-118:1986.
de: ISO 8859-7 war früher als ELOT-928 oder ECMA-118:1986 bekannt.

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 3.65 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at \%http://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 3.65 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts und Informationen, wie Fehler gemeldet werden können, finden sich unter \%http://www.kernel.org/doc/man-pages/.
