Repository: krisfremen/manpages-l10n
Catalog: po/man7/iso_8859-6.7.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: iso_8859-6 - ISO 8859-6 character set encoded in octal, decimal, and hexadecimal
de: iso_8859-6 - ISO 8859-6-Zeichensatz in oktaler, dezimaler und hexadezimaler Kodierung

source: DESCRIPTION
de: BESCHREIBUNG

source: The ISO 8859 standard includes several 8-bit extensions to the ASCII character set (also known as ISO 646-IRV). ISO 8859-6 encodes the characters used in the Arabic language.
de: Der Standard ISO 8859 enthält verschiedene 8-Bit-Erweiterungen des ASCII- Zeichensatzes (auch als ISO 646-IRV bekannt). ISO 8859-6 kodiert die Zeichen, die in der arabischen Sprache verwendet werden.

source: ISO 8859 alphabets
de: ISO-8859-Alphabete

source: The full set of ISO 8859 alphabets includes:
de: Der vollständige Satz von ISO-8859-Alphabeten umfasst:

source: ISO 8859-1 West European languages (Latin-1)
de: ISO 8859-1 Westeuropäische Sprachen (Latin-1)

source: ISO 8859-2 Central and East European languages (Latin-2)
de: ISO 8859-2 Mittel- und Osteuropäische Sprachen (Latin-2)

source: ISO 8859-3 Southeast European and miscellaneous languages (Latin-3)
de: ISO 8859-3 Südosteuropäische und sonstige Sprachen (Latin-3)

source: ISO 8859-4 Scandinavian/Baltic languages (Latin-4)
de: ISO 8859-4 Skandinavische/Baltische Sprachen (Latin-4)

source: ISO 8859-5 Latin/Cyrillic
de: ISO 8859-5 Lateinisch/Kyrillisch

source: ISO 8859-6 Latin/Arabic
de: ISO 8859-6 Lateinisch/Arabisch

source: ISO 8859-7 Latin/Greek
de: ISO 8859-7 Lateinisch/Griechisch

source: ISO 8859-8 Latin/Hebrew
de: ISO 8859-8 Lateinisch/Hebräisch

source: ISO 8859-9 Latin-1 modification for Turkish (Latin-5)
de: ISO 8859-9 Latin-1-Anpassung für Türkisch (Latin-5)

source: ISO 8859-10 Lappish/Nordic/Eskimo languages (Latin-6)
de: ISO 8859-10 Sami/Nordische/Eskimo-Sprachen (Latin-6)

source: ISO 8859-11 Latin/Thai
de: ISO 8859-11 Lateinisch/Thai

source: ISO 8859-13 Baltic Rim languages (Latin-7)
de: ISO 8859-13 Skandinavische/Baltische Sprachen (Latin-7)

source: ISO 8859-14 Celtic (Latin-8)
de: ISO 8859-14 Keltisch (Latin-8)

source: ISO 8859-15 West European languages (Latin-9)
de: ISO 8859-15 Westeuropäische Sprachen (Latin-9)

source: ISO 8859-16 Romanian (Latin-10)
de: ISO 8859-16 Rumänisch (Latin-10)

source: ISO 8859-6 characters
de: ISO-8859-6-Zeichen

source: The following table displays the characters in ISO 8859-6, which are printable and unlisted in the B<ascii>(7) manual page.
de: Die folgende Tabelle enthält die druckbaren Zeichen von ISO 8859-6, die nicht in der Handbuchseite von B<ascii>(7) aufgeführt sind.

source: Oct Dec Hex Char Description
de: Okt Dez Hex Zeichen Beschreibung

source: 240 160 A0 \ NO-BREAK SPACE
de: 240 160 A0 \ GESCHÜTZTES LEERZEICHEN

source: 244 164 A4 ¤ CURRENCY SIGN
de: 244 164 A4 ¤ WÄHRUNGSZEICHEN

source: 254 172 AC ، ARABIC COMMA
de: 254 172 AC ، ARABISCHES KOMMA

source: 255 173 AD ­ SOFT HYPHEN
de: 255 173 AD ­ WEICHES TRENNZEICHEN

source: 273 187 BB ؛ ARABIC SEMICOLON
de: 273 187 BB ؛ ARABISCHES SEMIKOLON

source: 277 191 BF ؟ ARABIC QUESTION MARK
de: 277 191 BF ؟ ARABISCHES FRAGEZEICHEN

source: 301 193 C1 ء ARABIC LETTER HAMZA
de: 301 193 C1 ء ARABISCHER BUCHSTABE HAMZA

source: 302 194 C2 آ ARABIC LETTER ALEF WITH MADDA ABOVE
de: 302 194 C2 آ ARABISCHER BUCHSTABE ALIF MIT MADDA DARÜBER

source: 303 195 C3 أ ARABIC LETTER ALEF WITH HAMZA ABOVE
de: 303 195 C3 أ ARABISCHER BUCHSTABE ALIF MIT HAMZA DARÜBER

source: 304 196 C4 ؤ ARABIC LETTER WAW WITH HAMZA ABOVE
de: 304 196 C4 ؤ ARABISCHER BUCHSTABE WAW MIT HAMZA DARÜBER

source: 305 197 C5 إ ARABIC LETTER ALEF WITH HAMZA BELOW
de: 305 197 C5 إ ARABISCHER BUCHSTABE ALIF MIT HAMZA DARUNTER

source: 306 198 C6 ئ ARABIC LETTER YEH WITH HAMZA ABOVE
de: 306 198 C6 ئ ARABISCHER BUCHSTABE YA MIT HAMZA DARÜBER

source: 307 199 C7 ا ARABIC LETTER ALEF
de: 307 199 C7 ا ARABISCHER BUCHSTABE ALIF

source: 310 200 C8 ب ARABIC LETTER BEH
de: 310 200 C8 ب ARABISCHER BUCHSTABE BA

source: 311 201 C9 ة ARABIC LETTER TEH MARBUTA
de: 311 201 C9 ة ARABISCHER BUCHSTABE TA MARBUTA

source: 312 202 CA ت ARABIC LETTER TEH
de: 312 202 CA ت ARABISCHER BUCHSTABE TA

source: 313 203 CB ث ARABIC LETTER THEH
de: 313 203 CB ث ARABISCHER BUCHSTABE THA

source: 314 204 CC ج ARABIC LETTER JEEM
de: 314 204 CC ج ARABISCHER BUCHSTABE DSCHIM

source: 315 205 CD ح ARABIC LETTER HAH
de: 315 205 CD ح ARABISCHER BUCHSTABE HA

source: 316 206 CE خ ARABIC LETTER KHAH
de: 316 206 CE خ ARABISCHER BUCHSTABE CHA

source: 317 207 CF د ARABIC LETTER DAL
de: 317 207 CF د ARABISCHER BUCHSTABE DAL

source: 320 208 D0 ذ ARABIC LETTER THAL
de: 320 208 D0 ذ ARABISCHER BUCHSTABE DHAL

source: 321 209 D1 ر ARABIC LETTER REH
de: 321 209 D1 ر ARABISCHER BUCHSTABE RA

source: 322 210 D2 ز ARABIC LETTER ZAIN
de: 322 210 D2 ز ARABISCHER BUCHSTABE ZAY

source: 323 211 D3 س ARABIC LETTER SEEN
de: 323 211 D3 س ARABISCHER BUCHSTABE SIN

source: 324 212 D4 ش ARABIC LETTER SHEEN
de: 324 212 D4 ش ARABISCHER BUCHSTABE SCHIN

source: 325 213 D5 ص ARABIC LETTER SAD
de: 325 213 D5 ص ARABISCHER BUCHSTABE SAD

source: 326 214 D6 ض ARABIC LETTER DAD
de: 326 214 D6 ض ARABISCHER BUCHSTABE DAD

source: 327 215 D7 ط ARABIC LETTER TAH
de: 327 215 D7 ط ARABISCHER BUCHSTABE TA

source: 330 216 D8 ظ ARABIC LETTER ZAH
de: 330 216 D8 ظ ARABISCHER BUCHSTABE ZA

source: 331 217 D9 ع ARABIC LETTER AIN
de: 331 217 D9 ع ARABISCHER BUCHSTABE AIN

source: 332 218 DA غ ARABIC LETTER GHAIN
de: 332 218 DA غ ARABISCHER BUCHSTABE GHAIN

source: 340 224 E0 ـ ARABIC TATWEEL
de: 340 224 E0 ـ ARABISCHES TATWEEL

source: 341 225 E1 ف ARABIC LETTER FEH
de: 341 225 E1 ف ARABISCHER BUCHSTABE FA

source: 342 226 E2 ق ARABIC LETTER QAF
de: 342 226 E2 ق ARABISCHER BUCHSTABE QAF

source: 343 227 E3 ك ARABIC LETTER KAF
de: 343 227 E3 ك ARABISCHER BUCHSTABE KAF

source: 344 228 E4 ل ARABIC LETTER LAM
de: 344 228 E4 ل ARABISCHER BUCHSTABE LAM

source: 345 229 E5 م ARABIC LETTER MEEM
de: 345 229 E5 م ARABISCHER BUCHSTABE MIM

source: 346 230 E6 ن ARABIC LETTER NOON
de: 346 230 E6 ن ARABISCHER BUCHSTABE NUN

source: 347 231 E7 ه ARABIC LETTER HEH
de: 347 231 E7 ه ARABISCHER BUCHSTABE HA

source: 350 232 E8 و ARABIC LETTER WAW
de: 350 232 E8 و ARABISCHER BUCHSTABE WAW

source: 351 233 E9 ى ARABIC LETTER ALEF MAKSURA
de: 351 233 E9 ى ARABISCHER BUCHSTABE ALIF MAQSURA

source: 352 234 EA ي ARABIC LETTER YEH
de: 352 234 EA ي ARABISCHER BUCHSTABE YA

source: 353 235 EB ً ARABIC FATHATAN
de: 353 235 EB ً ARABISCHES FATHATAN

source: 354 236 EC ٌ ARABIC DAMMATAN
de: 354 236 EC ٌ ARABISCHES DAMMATAN

source: 355 237 ED ٍ ARABIC KASRATAN
de: 355 237 ED ٍ ARABISCHES KASRATAN

source: 356 238 EE َ ARABIC FATHA
de: 356 238 EE َ ARABISCHES FATHA

source: 357 239 EF ُ ARABIC DAMMA
de: 357 239 EF ُ ARABISCHES DAMMA

source: 360 240 F0 ِ ARABIC KASRA
de: 360 240 F0 ِ ARABISCHES KASRA

source: 361 241 F1 ّ ARABIC SHADDA
de: 361 241 F1 ّ ARABIC SCHADDA

source: 362 242 F2 ْ ARABIC SUKUN
de: 362 242 F2 ْ ARABISCHES SUKUN

source: NOTES
de: ANMERKUNGEN

source: ISO 8859-6 lacks the glyphs required for many related languages, such as Urdu and Persian (Farsi).
de: In ISO 8859-6 fehlen Zeichen, die für viele verwandte Sprachen benötigt werden, beispielsweise Urdu und Persisch (Farsi).

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 3.61 of the Linux I<man-pages> project. A description of the project, and information about reporting bugs, can be found at \%http://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 3.61 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts und Informationen, wie Fehler gemeldet werden können, finden sich unter \%http://www.kernel.org/doc/man-pages/.
