Repository: krisfremen/manpages-l10n
Catalog: po/man7/suffixes.7.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: suffixes - list of file suffixes
de: suffixes - Liste der Dateiendungen

source: DESCRIPTION
de: BESCHREIBUNG

source: It is customary to indicate the contents of a file with the file suffix, which consists of a period, followed by one or more letters. Many standard utilities, such as compilers, use this to recognize the type of file they are dealing with. The B<make>(1) utility is driven by rules based on file suffix.
de: Es ist üblich, den Inhalt von Dateien durch Endungen der Dateinamen zu kennzeichnen. Die Endungen bestehen aus einem Punkt gefolgt von einem oder mehreren Buchstaben. Viele Standard(hilfs)werkzeuge wie Compiler erkennen daran den in Bearbeitung befindlichen Dateityp. Das Hilfswerkzeug B<make>(1) wird durch Regeln basierend auf den Dateiendungen gesteuert.

source: Following is a list of suffixes which are likely to be found on a Linux system.
de: Es folgt eine Liste der Endungen, die wahrscheinlich auf einem Linux-System gefunden werden können.

source: Suffix File type
de: Endung Dateityp

source: ,v files for RCS (Revision Control System)
de: ,v Dateien für RCS (Revision Control System)

source: - backup file
de: - Sicherungsdatei

source: .C C++ source code, equivalent to I<.cc>
de: .C C++-Quellcode, äquivalent zu I<.cc>

source: .F Fortran source with B<cpp>(1) directives
de: .F Fortran-Quellcode mit B<cpp>(1)-Direktiven

source: or file compressed using freeze
de: oder Datei, die mit Freeze komprimiert wurde

source: .S assembler source with B<cpp>(1) directives
de: .S Assembler-Quellcode mit B<cpp>(1)-Direktiven

source: .Y file compressed using yabba
de: .Y Datei, die mit yabba komprimiert wurde

source: .Z file compressed using B<compress>(1)
de: .Z Datei, die mit B<compress>(1) komprimiert wurde

source: .[0-9]+gf TeX generic font files
de: .[0-9]+gf generische Schriftendateien von TeX

source: .[0-9]+pk TeX packed font files
de: .[0-9]+pk gepackte Schriftendateien von TeX

source: .[1-9] manual page for the corresponding section
de: .[1-9] Handbuchseite (manual page) für den entsprechenden Abschnitt

source: .[1-9][a-z] manual page for section plus subsection
de: .[1-9][a-z] Handbuchseite (manual page) für Abschnitt und Unterabschnitt

source: .a static object code library
de: .a statische Objektcode-Bibliothek

source: .ad X application default resource file
de: .ad Voreinstellungen für Ressourcen einer X-Anwendung

source: .ada Ada source (may be body, spec, or combination)
de: .ada Ada-Quelle (könnte Hauptdokument, Spezifikation oder eine Kombination sein)

source: .adb Ada body source
de: .adb Quelle des Ada-Hauptdokuments

source: .ads Ada spec source
de: .ads Quelle der Ada-Spezifikation

source: .afm PostScript font metrics
de: .afm Zeichensatz-Metrik von PostScript

source: .al Perl autoload file
de: .al Autoload-Datei von Perl

source: .am B<automake>(1) input file
de: .am B<automake>(1)-Eingabedatei

source: .arc B<arc>(1) archive
de: .arc B<arc>(1)-Archivdatei

source: .arj B<arj>(1) archive
de: .arj B<arj>(1)-Archivdatei

source: .asc PGP ASCII-armored data
de: .asc PGP-Daten mit ASCII-Hülle

source: .asm (GNU) assembler source file
de: .asm (GNU) Assember-Quelldatei

source: .au Audio sound file
de: .au Audiodatei

source: .aux LaTeX auxiliary file
de: .aux Hilfsdatei von LaTeX

source: .avi (msvideo) movie
de: .avi (msvideo-)Film

source: .awk AWK language program
de: .awk Programm in der Sprache AWK

source: .b LILO boot loader image
de: .b Boot-Loader-Image von LILO

source: .bak backup file
de: .bak Sicherungsdatei

source: .bash B<bash>(1) shell script
de: .bash B<bash>(1)-Shellskript

source: .bb basic block list data produced by
de: .bb »basic-block-list«-Daten, produziert von

source: .bbg basic block graph data produced by
de: .bbg »basic-block-graph«-Daten, produziert von

source: .bbl BibTeX output
de: .bbl BibTeX-Ausgabe

source: .bdf X font file
de: .bdf X-Schriftdatei

source: .bib TeX bibliographic database, BibTeX input
de: .bib Bibliographische Datenbank von TeX, Eingabe für BibTeX

source: .bm bitmap source
de: .bm Bitmap-Quellen

source: .bz2 file compressed using B<bzip2>(1)
de: .bz2 Datei, die mit B<bzip2>(1) komprimiert wurde

source: .c C source
de: .c C-Quellen

source: .cat message catalog files
de: .cat Nachrichten-Katalogdateien

source: .cc C++ source
de: .cc C++-Quellen

source: .cf configuration file
de: .cf Konfigurationsdatei

source: .cfg configuration file
de: .cfg Konfigurationsdatei

source: .cgi WWW content generating script or program
de: .cgi Skript oder Programm, das WWW-Inhalte generiert

source: .cls LaTeX Class definition
de: .cls LaTeX-Klassendefinition

source: .class Java compiled byte-code
de: .class kompilierter Bytecode von Java

source: .conf configuration file
de: .conf Konfigurationsdatei

source: .config configuration file
de: .config Konfigurationsdatei

source: .cpp equivalent to I<.cc>
de: .cpp äquivalent zu I<.cc>

source: .csh B<csh>(1) shell script
de: .csh B<csh>(1)-Shellskript

source: .cxx equivalent to I<.cc>
de: .cxx äquivalent zu I<.cc>

source: .dat data file
de: .dat Datendatei

source: .deb Debian software package
de: .deb Debian-Softwarepaket

source: .def Modula-2 source for definition modules
de: .def Quellen für Definitionsmodule von Modula-2

source: .def other definition files
de: .def andere Definitionsdateien

source: .desc initial part of mail message unpacked with
de: .desc initialer Teil einer E-Mail-Nachricht, die mit

source: B<munpack>(1)
de: B<munpack>(1) entpackt wurde

source: .diff file differences (B<diff>(1) command output)
de: .diff Dateiunterschiede (Ausgabe vom Befehl B<diff>(1))

source: .dir dbm data base directory file
de: .dir dbm-Datenbankverzeichnisdatei

source: .doc documentation file
de: .doc Dokumentationsdatei

source: .dsc Debian Source Control (source package)
de: .dsc Debian-Quellsteuerung (Quellpaket)

source: .dtx LaTeX package source file
de: .dtx Quelldatei eines LaTeX-Pakets

source: .dvi TeX's device independent output
de: .dvi geräteunabhängige Ausgabe von TeX

source: .el Emacs-Lisp source
de: .el Emacs-Lisp-Quellen

source: .elc compiled Emacs-Lisp source
de: .elc kompilierte Emacs-Lisp-Quellen

source: .eps encapsulated PostScript
de: .eps gekapseltes PostScript

source: .exp Expect source code
de: .exp Expect-Quellcode

source: .f Fortran source
de: .f Fortran-Quelle

source: .f77 Fortran 77 source
de: .f77 Fortran-77-Quelle

source: .f90 Fortran 90 source
de: .f90 Fortran-90-Quelle

source: .fas precompiled Common-Lisp
de: .fas vorkompilierter Common-Lisp-Code

source: .fi Fortran include files
de: .fi Fortran-Include-Dateien

source: .fig FIG image file (used by B<xfig>(1))
de: .fig FIG-Bilddatei (benutzt von B<xfig>(1))

source: .fmt TeX format file
de: .fmt Formatdatei von TeX

source: .gif Compuserve Graphics Image File format
de: .gif Compuserve Grafikdateiformat (»Graphics Image File«)

source: .gmo GNU format message catalog
de: .gmo Nachrichtenkatalog im GNU-Format

source: .gsf Ghostscript fonts
de: .gsf Ghostscript-Zeichensätze

source: .gz file compressed using B<gzip>(1)
de: .gz Datei, die mit B<gzip>(1) komprimiert wurde

source: .h C or C++ header files
de: .h C- oder C++-Header-Dateien

source: .help help file
de: .help Hilfedatei

source: .hf equivalent to I<.help>
de: .hf äquivalent zu I<.help>

source: .hlp equivalent to I<.help>
de: .hlp äquivalent zu I<.help>

source: .htm poor man's I<.html>
de: .htm I<.html> für Arme

source: .html HTML document used with the World Wide Web
de: .html HTML-Dokument, benutzt im World Wide Web

source: .hqx 7-bit encoded Macintosh file
de: .hqx 7-Bit-kodierte Macintosh-Datei

source: .i C source after preprocessing
de: .i C-Quellen nach Vorbehandlung durch Präprozessor

source: .icon bitmap source
de: .icon Bitmap-Quelle

source: .idx reference or datum-index file for hypertext
de: .idx Referenz oder Datumindexdatei für Hypertext

source: or database system
de: oder Datenbanksystem

source: .image bitmap source
de: .image Bitmap-Quelle

source: .in configuration template, especially for GNU Autoconf
de: .in Konfigurationsvorlage, besonders für GNU Autoconf

source: .info files for the Emacs info browser
de: .info Dateien für den Emacs-Info-Browser

source: .info-[0-9]+ split info files
de: .info-[0-9]+ Info-Dateienteile

source: .ins LaTeX package install file for docstrip
de: .ins LaTeX: Paketinstallationsdatei für Docstrip

source: .itcl itcl source code;
de: .itcl itcl-Quellcode

source: itcl ([incr Tcl]) is an OO extension of tcl
de: itcl ([incr Tcl]) ist eine OO-Erweiterung von tcl

source: .java a Java source file
de: .java eine Java-Quellcodedatei

source: .jpg poor man's I<.jpeg>
de: .jpg I<.jpeg> für Arme

source: .kmap B<lyx>(1) keymap
de: .kmap B<lyx>(1)-Tastaturdefinition

source: .l equivalent to I<.lex> or I<.lisp>
de: .l äquivalent zu I<.lex> oder I<.lisp>

source: .lex B<lex>(1) or B<flex>(1) files
de: .lex B<lex>(1)- oder B<flex>(1)-Dateien

source: .lha lharc archive
de: .lha lharc-Archivdatei

source: .lib Common-Lisp library
de: .lib Bibliothek für Common-Lisp

source: .lisp Lisp source
de: .lisp Lisp-Quellen

source: .ln files for use with B<lint>(1)
de: .ln Dateien für B<lint>(1)

source: .log log file, in particular produced by TeX
de: .log Protokolldatei, vor allem von TeX erstellte

source: .lsm Linux Software Map entry
de: .lsm Linux-Software-Map-Eintrag

source: .lsp Common-Lisp source
de: .lsp Common-Lisp-Quellen

source: .lzh lharc archive
de: .lzh lharc-Archivdatei

source: .m Objective-C source code
de: .m Objective-C-Quellcode

source: .m4 B<m4>(1) source
de: .m4 B<m4>(1)-Quellen

source: .mac macro files for various programs
de: .mac Makrodateien für verschiedene Programme

source: .man manual page (usually source rather than formatted)
de: .man Handbuchseite (meist Quellen statt formatiert)

source: .map map files for various programs
de: .map Map-Dateien für verschiedene Programme

source: .me Nroff source using the me macro package
de: .me Nroff-Quellen, benutzt Makropaket me

source: .mf Metafont (font generator for TeX) source
de: .mf Metafont-Quelle (Zeichensatzgenerator für TeX)

source: .mgp MagicPoint file
de: .mgp MagicPoint-Datei

source: .mm sources for B<groff>(1) in mm - format
de: .mm Quellen für B<groff>(1) im MM-Format

source: .mo Message catalog binary file
de: .mo binäre Nachrichtenkatalogdatei

source: .mod Modula-2 source for implementation modules
de: .mod Modula-2-Quelle für Implementationsmodule

source: .mov (quicktime) movie
de: .mov (Quicktime-)Film

source: .mp Metapost source
de: .mp Metapost-Quelle

source: .mp2 MPEG Layer 2 (audio) file
de: .mp2 MPEG-Layer-2-(Audio-)Datei

source: .mp3 MPEG Layer 3 (audio) file
de: .mp3 MPEG-Layer-3-(Audio-)Datei

source: .mpeg movie file
de: .mpeg Filmdatei

source: .o object file
de: .o Objektdateien

source: .old old or backup file
de: .old alte oder Sicherheitsdatei

source: .orig backup (original) version of a file, from B<patch>(1)
de: .orig Sicherungs-(Original-)version einer Datei, von B<patch>(1)

source: .out output file, often executable program (a.out)
de: .out Ausgabedatei, oftmals ausführbare Programme (a.out)

source: .p Pascal source
de: .p Pascal-Quelle

source: .pag dbm data base data file
de: .pag dbm: Datenbankdatendatei

source: .patch file differences for B<patch>(1)
de: .patch Dateiunterschiede von B<patch>(1)

source: .pbm portable bitmap format
de: .pbm Portable Bitmap, Grafikformat

source: .pcf X11 font files
de: .pcf X11-Schriftdateien

source: (use Acrobat/B<acroread> or B<xpdf>)
de: (verwenden Sie Acrobat/B<acroread> oder B<xpdf>)

source: .perl Perl source (see .ph, .pl and .pm)
de: .perl Perl-Quellen (siehe .ph, .pl and .pm)

source: .pfa PostScript font definition files, ASCII format
de: .pfa PostScript-Zeichensatzdefinitionsdatei, ASCII-Format

source: .pfb PostScript font definition files, binary format
de: .pfb PostScript-Zeichensatzdefinitionsdatei, Binärformat

source: .pgm portable greymap format
de: .pgm Portable Greymap, Grafikformat

source: .pgp PGP binary data
de: .pgp PGP-Binärdaten

source: .ph Perl header file
de: .ph Perl-Header-Datei

source: .php PHP program file
de: .php PHP-Programmdatei

source: .php3 PHP3 program file
de: .php3 PHP3-Programmdatei

source: .pid File to store daemon PID (e.g., crond.pid)
de: .pid Dateien für Daemon-PIDs (z.B. crond.pid)

source: .pl TeX property list file or Perl library file
de: .pl TeX-Eigenschaftsauflistdatei oder Perl-Bibliotheksdatei

source: .pm Perl module
de: .pm Perl-Modul

source: .png Portable Network Graphics file
de: .png Portable Network Graphics, Grafikformat

source: .po Message catalog source
de: .po Nachrichtenkatalog, Quelle

source: .pod B<perldoc>(1) file
de: .pod B<perldoc>(1)-Datei

source: .ppm portable pixmap format
de: .ppm Portable Pixmap, Grafikformat

source: .pr bitmap source
de: .pr Bitmap-Quelle

source: .ps PostScript file
de: .ps PostScript-Datei

source: .py Python source
de: .py Python-Quelle

source: .pyc compiled python
de: .pyc kompiliertes Python

source: .qt quicktime movie
de: .qt Quicktime-Film

source: .r RATFOR source (obsolete)
de: .r RATFOR-Quelle (veraltet)

source: .rej patches that B<patch>(1) couldn't apply
de: .rej Patches, die B<patch>(1) nicht anwenden konnte

source: .rpm RPM software package
de: .rpm RPM-Softwarepaket

source: .rtf Rich Text Format file
de: .rtf Rich-Text-Format-Datei

source: .rules rules for something
de: .rules Regeln für irgendwas

source: .s assembler source
de: .s Assembler-Quelle

source: .sa stub libraries for a.out shared libraries
de: .sa Stub-Bibliotheken für Laufzeit-Bibliothek im a.out-Format

source: .sc B<sc>(1) spreadsheet commands
de: .sc B<sc>(1)-Tabellenkalkulationbefehle

source: .scm Scheme source code
de: .scm Scheme-Quellcode

source: .sed sed source file
de: .sed Sed-Quelldatei

source: .sgml SGML source file
de: .sgml SGML-Quelldatei

source: .sh B<sh>(1) scripts
de: .sh B<sh>(1)-Skript

source: .shar archive created by the B<shar>(1) utility
de: .shar Archivdatei, erstellt mittels des B<shar>(1)-Hilfswerkzeugs

source: .so Shared library or dynamically loadable object
de: .so Laufzeit-Bibliothek oder dynamisch ladbares Objekt

source: .sql SQL source
de: .sql SQL-Quelle

source: .sqml SQML schema or query program
de: .sqml SQML-Schemata oder -Abfrageprogramm

source: .sty LaTeX style files
de: .sty LaTeX-Style-Datei

source: .sym Modula-2 compiled definition modules
de: .sym kompilierte Definitionsmodule von Modula-2

source: .tar archive created by the B<tar>(1) utility
de: .tar Archivdatei, erstellt mittels des B<tar>(1)-Hilfswerkzeugs

source: .tar.Z tar(1) archive compressed with B<compress>(1)
de: .tar.Z tar(1)-Archiv, komprimiert mit B<compress>(1)

source: .tar.bz2 tar(1) archive compressed with B<bzip2>(1)
de: .tar.bz2 tar(1)-Archiv, komprimiert mit B<bzip2>(1)

source: .tar.gz tar(1) archive compressed with B<gzip>(1)
de: .tar.gz tar(1)-Archiv, komprimiert mit B<gzip>(1)

source: .taz tar(1) archive compressed with B<compress>(1)
de: .taz tar(1)-Archiv, komprimiert mit B<compress>(1)

source: .tcl tcl source code
de: .tcl tcl-Quellcode

source: .tex TeX or LaTeX source
de: .tex TeX- oder LaTeX-Quellcode

source: .texi equivalent to I<.texinfo>
de: .texi äquivalent zu I<.texinfo>

source: .texinfo Texinfo documentation source
de: .texinfo Quelle von Texinfo-Dokumentation

source: .text text file
de: .text Textdatei

source: .tfm TeX font metric file
de: .tfm TeX: Zeichensatzmetrik

source: .tgz tar archive compressed with B<gzip>(1)
de: .tgz tar-Archiv komprimiert mit B<gzip>(1)

source: .tif poor man's I<.tiff>
de: .tif I<.tiff> für Arme

source: .tiff Tagged Image File Format
de: .tiff »Tagged Image File Format«, Grafikformat

source: .tk tcl/tk script
de: .tk Tcl/Tk-Skript

source: .tmp temporary file
de: .tmp temporäre Datei

source: .tmpl template files
de: .tmpl Template-Datei

source: .txt equivalent to I<.text>
de: .txt äquivalent zu I<.text>

source: .uu equivalent to I<.uue>
de: .uu äquivalent zu I<.uue>

source: .uue binary file encoded with B<uuencode>(1)
de: .uue binäre Datei kodiert mit B<uuencode>(1)

source: .vf TeX virtual font file
de: .vf virtuelle Schriftdatei von TeX

source: .vpl TeX virtual property list file
de: .vpl TeX: virtuelle Eigenschaftsliste (zu virtueller Schrift)

source: .wav wave sound file
de: .wav »Wave«-Audiodatei

source: .wml Source file for Web Meta Language
de: .wml Quelldatei für Web Meta Language

source: .xbm X11 bitmap source
de: .xbm X11-Bitmap-Quelle

source: .xcf GIMP graphic
de: .xcf GIMP-Graphik

source: .xml eXtended Markup Language file
de: .xml »eXtended-Markup-Language«-Datei

source: .xpm X11 pixmap source
de: .xpm X11-Pixmap-Quelle

source: .xs Perl xsub file produced by h2xs
de: .xs xsub-Datei von Perl erzeugt von h2xs

source: .y B<yacc>(1) or B<bison>(1) (parser generator) files
de: .y B<yacc>(1)- oder B<bison>(1)- (Parsergenerator-)Datei

source: .z File compressed using B<pack>(1) (or an old B<gzip>(1))
de: .z Datei, die mit B<pack>(1) (oder einem alten B<gzip>(1)) komprimiert wurde

source: .zip B<zip>(1) archive
de: .zip B<zip>(1)-Archiv

source: .zoo B<zoo>(1) archive
de: .zoo B<zoo>(1)-Archiv

source: ~ Emacs or B<patch>(1) backup file
de: *~ Emacs or B<patch>(1)-Sicherungsdatei

source: rc startup (`run control') file, e.g., I<.newsrc>
de: *rc Startdatei (»run control«), z.B. I<.newsrc>

source: CONFORMING TO
de: KONFORM ZU

source: General UNIX conventions.
de: Allgemeinen UNIX-Konventionen.

source: BUGS
de: FEHLER

source: This list is not exhaustive.
de: Diese Liste ist nicht erschöpfend.

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 3.74 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%http://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 3.74 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%http://www.kernel.org/doc/man-pages/.
