Repository: krisfremen/manpages-l10n
Catalog: po/man8/cytune.8.po
Languages: de

source: March 1995
de: März 1995

source: NAME
de: BEZEICHNUNG

source: cytune - tune driver parameters for Cyclades-Z multiport serial card
de: cytune – Treiberparameter für die serielle Cyclades-Z-Multiport-Karte einstellen

source: SYNOPSIS
de: ÜBERSICHT

source: B<cytune> [B<-q> [B<-i> I<interval>]] [{B<-s>|B<-S>} I<value>] [B<-g>|B<-G>] [{B<-t>|B<-T>} I<timeout>] I<tty>...
de: B<cytune> [B<-q> [B<-i> I<Intervall>]] [{B<-s>|B<-S>} I<Wert>] [B<-g>|B<-G>] [{B<-t>|B<-T>} I<Zeitbegrenzung>] I<tty> …

source: DESCRIPTION
de: BESCHREIBUNG

source: B<cytune> queries and modifies the interruption threshold for the Cyclades driver. Each serial line on a Cyclades card has a 12-byte FIFO for input (and another 12-byte FIFO for output). The "threshold" specifies how many input characters must be present in the FIFO before an interruption is raised. When a Cyclades tty is opened, this threshold is set to a default value based on baud rate:
de: B<cytune> fragt den Interrupt-Schwellwert für den Cyclades-Treiber ab und stellt diesen ein. Jede serielle Leitung einer Cyclades-Karte hat eine 12-Byte-FIFO (und eine weitere 12-Byte-FIFO für die Ausgabe). Der I<Schwellwert> gibt an, wie viele Zeichen in der Eingabe der FIFO vorhanden sein müssen, bevor ein Interrupt ausgelöst wird. Wenn ein Cyclades-tty geöffnet ist, wird dieser Schwellwert auf einen auf der Baudrate basierenden Standardwert gesetzt:

source: Baud Threshold
de: Baud Schwellwert

source: If the threshold is set too low, the large number of interruptions can load the machine and decrease overall system throughput. If the threshold is set too high, the FIFO buffer can overflow, and characters will be lost. Slower machines, however, may not be able to deal with the interrupt load, and will require that the threshold be adjusted upwards.
de: Wird der Schwellwert zu niedrig gesetzt, kann eine große Anzahl an Interrupts die Maschine belasten und den allgemeinen Datendurchsatz des Systems verringern. Wird der Schwellwert zu hoch gesetzt, kann der FIFO-Puffer überlaufen und Zeichen können verloren gehen. Langsamere Maschinen können dennoch nicht in der Lage sein, die Interrupt-Anzahl zu bewältigen, was eine Korrektur des Schwellwerts nach oben erforderlich macht.

source: If the cyclades driver was compiled with B<ENABLE_MONITORING> defined, the cytune command can be used with the B<-q> option to report interrupts over the monitoring interval and characters transferred over the monitoring interval. It will also report the state of the FIFO. The maximum number of characters in the FIFO when an interrupt occurred, the instantaneous count of characters in the FIFO, and how many characters are now in the FIFO are reported. This output might look like this:
de: Sofern der Cyclades-Treiber mit aktiviertem B<ENABLE_MONITORING> kompiliert wurde, kann der cytunes-Befehl mit der Option B<-q> verwendet werden, um die Interrupts und während des Überwachungsintervalls übertragenen Zeichen zu melden. Außerdem wird der Status der FIFO gemeldet, d. h. die maximale Anzahl der Zeichen in der FIFO bis zu einem Interrupt, die unmittelbare Anzahl der Zeichen in der FIFO sowie die gegenwärtige Anzahl der Zeichen. Die Ausgabe könnte wie folgt aussehen:

source: This output indicates that for this monitoring period, the interrupts were always being handled within one character time, because B<max> never rose above B<threshold>. This is good, and you can probably run this way, provided that a large number of samples come out this way. You will lose characters if you overrun the FIFO, as the Cyclades hardware does not seem to support the RTS RS-232 signal line for hardware flow control from the DCE to the DTE.
de: Diese Ausgabe bedeutet, dass in dieser Überwachungsperiode die Interrupts stets innerhalb der Zeit eines Zeichens geschahen, weil B<max> den B<Schwellwert> nie überstieg. Das ist gut, und Sie können wahrscheinlich so weitermachen, sofern eine größere Anzahl von Stichproben das Gleiche ergibt. Sie werden Zeichen verlieren, wenn die FIFO überläuft, da die Cyclades-Hardware die RTS RS-232-Signalleitung zur hardwareseitigen Flusskontrolle vom DCE zum DTE nicht zu unterstützen scheint.

source: In query mode B<cytune> will produce a summary report when ended with a SIGINT or when the threshold or timeout is changed.
de: Im Abfragemodus erstellt B<cytune> einen zusammenfassenden Bericht beim Beenden mit SIGINT oder wenn sich Schwellwert oder Zeitbegrenzung geändert haben.

source: There may be a responsiveness vs. throughput tradeoff. The Cyclades card, at the higher speeds, is capable of putting a very high interrupt load on the system. This will reduce the amount of CPU time available for other tasks on your system. However, the time it takes to respond to a single character may be increased if you increase the threshold. This might be noticed by monitoring B<ping>(8) times on a SLIP link controlled by a Cyclades card. If your SLIP link is generally used for interactive work such as B<telnet>(1), you may want to leave the threshold low, so that characters are responded to as quickly as possible. If your SLIP link is generally used for file transfer, WWW, and the like, setting the FIFO to a high value is likely to reduce the load on your system while not significantly affecting throughput. Alternatively, see the B<-t> or B<-T> options to adjust the time that the cyclades waits before flushing its buffer. Units are 5ms.
de: Es könnte einen Kompromiss zwischen Reaktionsfähigkeit und Datendurchsatz geben. Bei höheren Geschwindigkeiten ist die Cyclades-Karte fähig, das System mit sehr vielen Interrupts zu belasten. Das reduziert auf Ihrem System die für andere Aufgaben zur Verfügung stehende CPU-Zeit. Dennoch kann die Antwortzeit für ein einzelnes Zeichen erhöht werden, indem Sie den Schwellwert erhöhen. Sie können dies durch Erfassung der B<ping>(8)-Zeiten an einem SLIP-Link erkennen, der von einer Cyclades-Karte gesteuert wird. Falls Ihr SLIP-Link generell für interaktive Aufgaben wie B<telnet>(1) verwendet wird, dann werden Sie den Schwellwert niedrig ansetzen wollen, so dass die Antwortzeiten auf ein einzelnes Zeichen bezogen so gering wie möglich sind. Verwenden Sie den SLIP-Link eher für Dateiübertragungen wie WWW und Ähnliches, dann kann die FIFO auf einen hohen Wert gesetzt werden, was die Systemlast reduziert, ohne den Datendurchsatz signifikant zu beeinträchtigen. Alternativ können Sie die Optionen B<-t> oder B<-T> zum Anpassen der Zeit verwenden, die der Cyclades-Treiber vor dem Leeren des Puffers wartet. Einheiten sind 5 ms.

source: If you are running a mouse on a Cyclades port, it is likely that you would want to maintain the threshold and timeout at a low value.
de: Wenn Sie eine Maus an einem Cyclades-Port betreiben, werden Sie wahrscheinlich einen niedrigen Schwellwert und Zeitbegrenzung bevorzugen.

source: OPTIONS
de: OPTIONEN

source: B<-s>I< value>
de: B<-s>I< Wert>

source: Set the current threshold to I<value> characters. Note that if the I<tty> is not being held open by another process, the threshold will be reset on the next open. Only values between 1 and 12, inclusive, are permitted.
de: setzt den aktuellen Schwellwert auf I<Wert> Zeichen. Beachten Sie, dass wenn I<tty> nicht von einem anderen Prozess offen gehalten wird, der Schwellwert beim nächsten Öffnen zurückgesetzt wird. Nur Werte von 1 bis einschließlich 12 sind zulässig.

source: B<-t>I< value>
de: B<-t>I< Wert>

source: Set the current flush timeout to I<value> units. Note that if the I<tty> is not being held open by another process, the threshold will be reset on the next open. Only values between 0 and 255, inclusive, are permitted. Setting I<value> to zero forces the default, currently 0x20 (160ms), but soon to be 0x02 (10ms). Units are 5 ms.
de: setzt den aktuellen Schwellwert zum Leeren auf I<Wert> Einheiten. Beachten Sie, dass wenn I<tty> nicht von einem anderen Prozess offen gehalten wird, der Schwellwert beim nächsten Öffnen zurückgesetzt wird. Nur Werte von 0 bis einschließlich 255 sind zulässig. Das Setzen von I<Wert> auf 0 erzwingt die Voreinstellung, gegenwärtig 0x20 (160 ms), aber bald 0x02 (10 ms). Einheiten sind 5 ms.

source: Get the current threshold and timeout.
de: ermittelt den gegenwärtigen Schwellwert und die Zeitbegrenzung.

source: B<-S>I< value>
de: B<-S>I< Wert>

source: Set the default threshold to I<value> characters. When the I<tty> is next opened, this value will be used instead of the default. Only values between 1 and 12, inclusive, are permitted.
de: setzt den vorgegebenen Schwellwert auf I<Wert> Zeichen. Wenn das I<tty> das nächste Mal geöffnet wird, dann wird dieser Wert anstelle des Vorgabewertes verwendet. Nur Werte von 1 bis einschließlich 12 sind zulässig.

source: B<-T>I< value>
de: B<-T>I< Wert>

source: Set the default flush timeout to I<value> units. When the I<tty> is next opened, this value will be used instead of the default. If I<value> is zero, then the the value will default to 0x20 (160ms), soon to be 0x02 (10ms).
de: setzt den vorgegebenen Zeitbegrenzungs-Wert zum Leeren auf I<Wert> Einheiten. Beachten Sie, dass beim nächsten Öffnen von I<tty> dieser Wert anstelle des Vorgabewertes verwendet wird. Das Setzen von I<Wert> auf 0 erzwingt die Voreinstellung, gegenwärtig 0x20 (160 ms), aber bald 0x02 (10 ms).

source: Get the default threshold and flush timeout values.
de: ermittelt den vorgegebenen Schwellwert und die Zeitbegtenzung.

source: Gather statistics about the I<tty>. The results are only valid if the Cyclades driver has been compiled with B<ENABLE_MONITORING> defined. This is probably not the default.
de: ermittelt Statistiken zu I<tty>. Die Ergebnisse sind nur gültig, wenn der Cyclades-Treiber mit aktiviertem B<ENABLE_MONITORING> kompiliert wurde. Dies ist wahrscheinlich nicht die Voreinstellung.

source: B<-i>I< interval>
de: B<-i>I< Intervall>

source: Statistics will be gathered every I<interval> seconds.
de: Statistiken werden alle I<Intervall> Sekunden ermittelt.

source: BUGS
de: FEHLER

source: If you run two copies of B<cytune> at the same time to report statistics about the same port, the 'ints', 'chars', and 'max' value will be reset and not reported correctly. B<cytune> should prevent this, but does not.
de: Falls zwei Instanzen von B<cytune> gleichzeitig ausgeführt werden, die Statistiken zum gleichen Port ermitteln, werden die Werte für »ints«, »chars« und »max« zurückgesetzt und nicht korrekt ausgegeben. B<cytune> sollte dies eigentlich verhindern, tut es aber nicht.

source: FILES
de: DATEIEN

source: SEE ALSO
de: SIEHE AUCH

source: AVAILABILITY
de: VERFÜGBARKEIT

source: The cytune command is part of the util-linux package and is available from ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl cytune ist Teil des Pakets util-linux und kann von ftp://ftp.kernel.org/pub/linux/utils/util-linux/ heruntergeladen werden.
