Repository: krisfremen/manpages-l10n
Catalog: po/man8/pkgdelta.8.po
Languages: de

source: Pacman Manual
de: Pacman-Handbuch

source: NAME
de: BEZEICHNUNG

source: pkgdelta - package delta generation utility
de: pkgdelta - Dienstprogramm zum Erstellen von Differenzdateien für Pakete

source: SYNOPSIS
de: ÜBERSICHT

source: I<pkgdelta> [options] E<lt>package1E<gt> E<lt>package2E<gt>
de: I<pkgdelta> [Optionen] E<lt>Paket1E<gt> E<lt>Paket2E<gt>

source: DESCRIPTION
de: BESCHREIBUNG

source: I<pkgdelta> is used to create package delta files between two versions of the same package\&. These files are essentially binary patches\&. B<pacman>(8) can download deltas instead of full package upgrades, and use them with the previous versions of packages (in the package cache) to synthesize the upgraded version of the packages\&. This likely reduces download sizes for upgrades significantly\&.
de: I<pkgdelta> wird dazu verwendet, Differenzdateien zwischen zwei Versionen des gleichen Pakets zu erstellen\&. Diese Dateien sind im Wesentlichen Patches in binärer Form\&. B<pacman>(8) kann diese Differenzdateien anstelle der ganzen zu aktualisierenden Pakete herunterladen und diese zusammen mit den vorhandenen Paketen (im Paketzwischenspeicher) dazu nutzen, die aktualisierte Paketversion zu erstellen\&. Dies reduziert die Download-Größen bei Aktualisierungen oft erheblich\&.

source: I<pkgdelta> requires B<xdelta3>(1) to do its job\&.
de: I<pkgdelta> benötigt B<xdelta3>(1), um zu funktionieren\&.

source: OPTIONS
de: OPTIONEN

source: B<--max-delta-size E<lt>ratioE<gt>>
de: B<--max-delta-size E<lt>VerhältnisE<gt>>

source: Only create delta files if the delta is smaller than ratio * package_size\&. Possible values: 0\&.0 to 2\&.0\&. Recommended values: 0\&.2 to 0\&.9\&. Default value: 0\&.7
de: erzeugt nur dann Differenzdateien, wenn diese kleiner als das angegebene Verhältnis zur Paketgröße werden\&. Mögliche Werte: 0\&.0 bis 2\&.0\&. Empfohlene Werte: 0\&.2 bis 0\&.9\&. Vorgabewert: 0\&.7\&. Beachten Sie, dass als Dezimaltrenner ein Punkt statt ein Komma zu verwenden ist\&.

source: B<--min-pkg-size E<lt>sizeE<gt>>
de: B<--min-pkg-size E<lt>GrößeE<gt>>

source: Minimal size of the package file in bytes to be considered for delta creation\&. Default value: 1048576 bytes = 1 MiB\&. This may be any absolute size in bytes or a human-readable value such as 4MiB or 3\&.5MB\&.
de: bezeichnet die minimale Größe der Paketdatei in Byte, damit dieses für die Erstellung der Differenzdatei infrage kommt\&. Vorgabewert: 1048576 byte = 1 MiB\&. Dies kann die absolute Größe in Byte oder ein menschenlesbarer Wert wie 4MiB oder 3\&.5MB sein\&. Beachten Sie, dass als Dezimaltrenner ein Punkt statt ein Komma zu verwenden ist\&.

source: Be quiet\&. Do not output anything but warnings and errors\&.
de: unterdrückt alle Ausgaben außer Warnungen und Fehlermeldungen\&.

source: EXAMPLES
de: BEISPIELE

source: SEE ALSO
de: SIEHE AUCH

source: See the pacman website at https://www\&.archlinux\&.org/pacman/ for current information on pacman and its related tools\&.
de: Auf der Pacman-Website auf https://www\&.archlinux\&.org/pacman/ finden Sie aktuelle Informationen zu Pacman und den zugehörigen Werkzeugen\&.

source: BUGS
de: FEHLER

source: Bugs? You must be kidding; there are no bugs in this software\&. But if we happen to be wrong, send us an email with as much detail as possible to pacman-dev@archlinux\&.org\&.
de: Fehler? Sie machen wohl Witze, es gibt keine Fehler in dieser Software\&. Nun ja, sollte unsere Annahme doch falsch sein, senden Sie uns eine E-Mail (auf Englisch) mit so vielen Details wie möglich an pacman-dev@archlinux\&.org\&.

source: AUTHORS
de: AUTOREN

source: Current maintainers:
de: Derzeitige Betreuer:

source: Past major contributors:
de: Bedeutende frühere Mitwirkende:

source: For additional contributors, use git shortlog -s on the pacman\&.git repository\&.
de: Informationen zu weiteren Mitwirkenden erhalten Sie, wenn Sie den Befehl B<git shortlog -s> im Git-Repositorium von Pacman aufrufen\&.
