Repository: krisfremen/manpages-l10n
Catalog: po/man8/systemd-activate.8.po
Languages: de

source: NAME
de: BEZEICHNUNG

source: systemd-activate - Test socket activation of daemons
de: systemd-activate - Socket-Aktivierung von Hintergrunddiensten testen

source: SYNOPSIS
de: ÜBERSICHT

source: B</lib/systemd/systemd-activate> [OPTIONS...] I<daemon> [OPTIONS...]
de: B</lib/systemd/systemd-activate> [OPTIONEN …] I<Daemon> [OPTIONEN …]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<systemd-activate> can be used to launch a socket-activated daemon from the command line for testing purposes\&. It can also be used to launch single instances of the daemon per connection (inetd-style)\&.
de: B<systemd-activate> kann zum Starten eines Socket-aktivierten Hintergrunddienstes aus der Befehlszeile für Testzwecke verwendet werden\&. Weiterhin können damit verbindungsweise einzelne Instanzen des Hintergrunddienstes gestartet werden (im Inetd-Stil)\&.

source: The daemon to launch and its options should be specified after options intended for B<systemd-activate>\&.
de: Der zu startende Hintergrunddienst und dessen Optionen sollten nach den für B<systemd-activate> bestimmten Optionen angegeben werden\&.

source: If the B<-a> option is given, file descriptor of the connection will be used as the standard input and output of the launched process\&. Otherwise, standard input and output will be inherited, and sockets will be passed through file descriptors 3 and higher\&. Sockets passed through I<$LISTEN_FDS> to B<systemd-activate> will be passed through to the daemon, in the original positions\&. Other sockets specified with B<--listen> will use consecutive descriptors\&.
de: Wenn die Option B<-a> angegeben ist, wird der Dateideskriptor der Verbindung als Standardeingabe und -ausgabe des gestarteten Prozesses verwendet\&. Anderenfalls werden Standardeingabe und -ausgabe vererbt und die Sockets über die Dateideskriptoren 3 und höher übergeben\&. Über I<$LISTEN_FDS> an B<systemd-activate> übergebene Sockets werden durch den Socket in den ursprünglichen Positionen durchgeschleift\&. Andere mit B<--listen> angegebene Sockets verwenden die darauf folgenden Deskriptoren\&.

source: OPTIONS
de: OPTIONEN

source: B<-l >I<address>, B<--listen=>I<address>
de: B<-l >I<Adresse>, B<--listen=>I<Adresse>

source: Listen on this I<address>\&. Takes a string like "2000" or "127\&.0\&.0\&.1:2001"\&.
de: wartet an der angegebenen I<Adresse> auf Anfragen\&. Eine Zeichenkette wie »2000« oder »127\&.0\&.0\&.1:2001« kann übergeben werden\&.

source: Launch a separate instance of daemon per connection and pass the connection socket as standard input and standard output\&.
de: startet pro Verbindung eine separate Instanz des Hintergrunddienstes und übergibt den Verbindungs-Socket als Standardeingabe und -ausgabe\&.

source: B<-E >I<VAR>B<[=>I<VALUE>], B<--setenv=>I<VAR>B<[=>I<VALUE>]
de: B<-E >I<VARIABLE>B<[=>I<WERT>], B<--setenv=>I<VARIABLE>B<[=>I<WERT>]

source: Add this variable to the environment of the launched process\&. If I<VAR> is followed by "=", assume that it is a variable\(envalue pair\&. Otherwise, obtain the value from the environment of B<systemd-activate> itself\&.
de: fügt diese Variable zu den Umgebungsvariablen des gestarteten Prozesses hinzu\&. Falls auf die I<VARIABLE> ein »=« folgt, wird angenommen, dass es ein Variable-Wert-Paar ist\&. Anderenfalls wird der Wert aus der Umgebung von B<systemd-activate> selbst ermittelt.

source: Specify a name for the activation file descriptors\&. This is equivalent to setting I<FileDescriptorName=> in socket unit files, and enables use of B<sd_listen_fds_with_names>(3)\&.
de: gibt einen Namen für die zu aktivierenden Dateideskriptoren an\&. Dies ist gleichbedeutend mit der Einstellung I<FileDescriptorName=> in Socket-Unit-Dateien und aktiviert B<sd_listen_fds_with_names>(3)\&.

source: Print a short help text and exit\&.
de: zeigt eine kurze Hilfe an und beendet das Programm\&.

source: Print a short version string and exit\&.
de: gibt die Versionsnummer aus und beendet das Programm\&.

source: ENVIRONMENT VARIABLES
de: UMGEBUNGSVARIABLEN

source: See B<sd_listen_fds>(3)\&.
de: Siehe B<sd_listen_fds>(3)\&.

source: Same as in B<systemd>(1)\&.
de: Ebenso wie in B<systemd>(1)\&.

source: EXAMPLES
de: BEISPIELE

source: B<Example\ \&1.\ \&Run an echo server on port 2000>
de: B<Beispiel\ \&1.\ \&Einen Echo-Server auf Port 2000 starten>

source: B<Example\ \&2.\ \&Run a socket-activated instance of systemd-journal-gatewayd(8)>
de: B<Beispiel\ \&2.\ \&Eine Socket-aktivierte Instanz von B<systemd-journal-gatewayd>(8) starten>

source: SEE ALSO
de: SIEHE AUCH
