Repository: krisfremen/manpages-l10n
Catalog: po/man2/stat.2.po
Languages: de

source: I<pathname> is relative and I<dirfd> is a file descriptor referring to a file other than a directory.
de: I<Pfadname> ist relativ und I<dirfd> ist ein Dateideskriptor, der sich auf eine Datei statt auf ein Verzeichnis bezieht.

source: VERSIONS
de: VERSIONEN

source: B<fstatat>() was added to Linux in kernel 2.6.16; library support was added to glibc in version 2.4.
de: B<fstatat>() wurde zu Linux in Kernel 2.6.16 hinzugefügt; Bibliotheksunterstützung wurde zu Glibc in Version 2.4 hinzugefügt.

source: CONFORMING TO
de: KONFORM ZU

source: According to POSIX.1-2001, B<lstat>() on a symbolic link need return valid information only in the I<st_size> field and the file-type component of the I<st_mode> field of the I<stat> structure. POSIX.1-2008 tightens the specification, requiring B<lstat>() to return valid information in all fields except the permission bits in I<st_mode>.
de: Entsprechend POSIX.1-2001 benötigt B<lstat>() bei Anwendung auf einen symbolischen Link lediglich im Feld I<st_size> und der Dateityp-Komponente des I<st_mode>-Feldes der I<stat>-Struktur gültige Rückgabeinformationen. POSIX.1-2008 engt diese Spezifikation ein, indem B<lstat>() in allen Feldern außer den Zugriffsrechte-Bits in I<st_mode> gültige Informationen zurückgeben muss.

source: Use of the I<st_blocks> and I<st_blksize> fields may be less portable. (They were introduced in BSD. The interpretation differs between systems, and possibly on a single system when NFS mounts are involved.) If you need to obtain the definition of the I<blkcnt_t> or I<blksize_t> types from I<E<lt>sys/stat.hE<gt>>, then define B<_XOPEN_SOURCE> with the value 500 or greater (before including I<any> header files).
de: Die Verwendung der Felder I<st_blocks> und I<st_blksize> kann die Portabilität einschränken. Diese wurden in BSD eingeführt. Die Interpretation unterscheidet sich auf verschiedenen Systemen, und möglicherweise auf einem einzelnen System, wenn NFS-Einhängungen bestehen. Falls Sie die Definition der Typen I<blkcnt_t> oder I<blksize_t> von I<E<lt>sys/stat.hE<gt>> ermitteln wollen, dann definieren Sie B<_XOPEN_SOURCE> mit einem Wert von 500 oder größer (bevor Sie I<irgendeine> Header-Datei einbeziehen).

source: POSIX.1-1990 did not describe the B<S_IFMT>, B<S_IFSOCK>, B<S_IFLNK>, B<S_IFREG>, B<S_IFBLK>, B<S_IFDIR>, B<S_IFCHR>, B<S_IFIFO>, B<S_ISVTX> constants, but instead demanded the use of the macros B<S_ISDIR>(), and so on. The B<S_IF*> constants are present in POSIX.1-2001 and later.
de: POSIX beschreibt die Konstanten B<S_IFMT>, B<S_IFSOCK>, B<S_IFLNK>, B<S_IFREG>, B<S_IFBLK>, B<S_IFDIR>, B<S_IFCHR>, B<S_IFIFO>, B<S_ISVTX> I<nicht>, sondern verlangt stattdessen die Benutzung der Makros S_ISDIR() etc. Die B<S_IF*>-Konstanten sind in POSIX.1-2001 und neuer vorhanden.

source: The B<S_ISLNK>() and B<S_ISSOCK>() macros are not in POSIX.1-1996, but both are present in POSIX.1-2001; the former is from SVID 4, the latter from SUSv2.
de: Die Makros B<S_ISLNK>() und B<S_ISSOCK>() finden sich nicht in POSIX.1-1996, sind aber beide in POSIX.1-2001 vorhanden; ersteres ist aus SVID 4v2, letzteres aus SUSv2.

source: UNIX\ V7 (and later systems) had B<S_IREAD>, B<S_IWRITE>, B<S_IEXEC>, where POSIX prescribes the synonyms B<S_IRUSR>, B<S_IWUSR>, B<S_IXUSR>.
de: UNIX\ V7 (und später) hat B<S_IREAD>, B<S_IWRITE>, B<S_IEXEC>, wobei POSIX die Synonyme B<S_IRUSR>, B<S_IWUSR>, B<S_IXUSR> vorschreibt.

source: Other systems
de: Andere Systeme

source: Values that have been (or are) in use on various systems:
de: Werte die von verschiedenen Systemen benutzt wurden oder werden:

source: hex name ls octal description
de: Hex Name ls Oktal Beschreibung

source: f000 S_IFMT 170000 mask for file type
de: f000 S_IFMT 170000 Maske für Dateityp

source: SCO out-of-service inode; BSD unknown type; SVID-v2 and XPG2
de: SCO out-of-service INode, BSD unbekannter Typ, SVID-v2 und XPG2

source: have both 0 and 0100000 for ordinary file
de: haben beide 0 und 0100000 für normale Dateien

source: 1000 S_IFIFO p| 010000 FIFO (named pipe)
de: 1000 S_IFIFO p| 010000 FiFo (benannte Pipe)

source: 2000 S_IFCHR c 020000 character special (V7)
de: 2000 S_IFCHR c 020000 zeichenorientierte Spezialdatei (V7)

source: 3000 S_IFMPC 030000 multiplexed character special (V7)
de: 3000 S_IFMPC 030000 gemultiplexte zeichenorientierte Spezialdatei (V7)

source: 4000 S_IFDIR d/ 040000 directory (V7)
de: 4000 S_IFDIR d/ 040000 Verzeichnis (V7)

source: XENIX named special file with two subtypes, distinguished by
de: XENIX benannte Spezialdatei mit zwei Untertypen, unterschieden durch

source: I<st_rdev> values 1, 2
de: I<st_rdev> Werte 1, 2

source: 0001 S_INSEM s 000001 XENIX semaphore subtype of IFNAM
de: 0001 S_INSEM s 000001 XENIX Semaphore-Untertyp von IFNAM

source: 0002 S_INSHD m 000002 XENIX shared data subtype of IFNAM
de: 0002 S_INSHD m 000002 XENIX geteilte-Daten-Untertyp von IFNAM

source: 6000 S_IFBLK b 060000 block special (V7)
de: 6000 S_IFBLK b 060000 blockorientierte Spezialdatei (V7)

source: 7000 S_IFMPB 070000 multiplexed block special (V7)
de: 7000 S_IFMPB 070000 gemultiplexte blockorientierte Spezialdatei (V7)

source: 8000 S_IFREG - 100000 regular (V7)
de: 8000 S_IFREG - 100000 reguläre Datei (V7)

source: 9000 S_IFCMP 110000 VxFS compressed
de: 9000 S_IFCMP 110000 VxFS komprimiert

source: 9000 S_IFNWK n 110000 network special (HP-UX)
de: 9000 S_IFNWK n 110000 Netzwerk-Spezialdatei (HP-UX)

source: a000 S_IFLNK l@ 120000 symbolic link (BSD)
de: a000 S_IFLNK l@ 120000 symbolischer Link (BSD)

source: Solaris shadow inode for ACL (not seen by user space)
de: b000 S_IFSHAD 130000 Solaris Schatten-INode für ACL (nicht sichtbar für Nutzer)

source: c000 S_IFSOCK s= 140000 socket (BSD; also "S_IFSOC" on VxFS)
de: c000 S_IFSOCK s= 140000 Socket (BSD; auch »S_IFSOC« auf VxFS)

source: d000 S_IFDOOR DE<gt> 150000 Solaris door
de: d000 S_IFDOOR DE<gt> 150000 Solaris-Tür (»door«)

source: e000 S_IFWHT w% 160000 BSD whiteout (not used for inode)
de: e000 S_IFWHT w% 160000 BSD-»whiteout« (nicht für Inode benutzt)

source: sticky bit: save swapped text even after use (V7)
de: »Sticky«-Bit: Text bleibt auf Swap auch nach Benutzung (V7)

source: reserved (SVID-v2)
de: reserviert (SVID-v2)

source: On nondirectories: don't cache this file (SunOS)
de: Auf Nicht-Verzeichnisse: diese Datei nicht zwischenspeichern (SunOS)

source: On directories: restricted deletion flag (SVID-v4.2)
de: Auf Verzeichnisse: Schalter für eingeschränktes Löschen (SVID-v4.2)

source: set-group-ID on execution (V7)
de: Gruppen-ID bei Ausführung setzen(V7)

source: for directories: use BSD semantics for propagation of GID
de: Für Verzeichnisse: BSD-Semantik für Weitergeben der Gruppen-ID benutzen

source: System V file locking enforcement (shared with S_ISGID)
de: 0400 S_ENFMT 002000 SysV Sperren der Datei erzwungen (gleicher Wert wie S_ISGID)

source: 0800 S_ISUID 004000 set-user-ID on execution (V7)
de: 0800 S_ISUID 004000 Benutzer-ID bei Ausführung setzen(V7)

source: directory is a context dependent file (HP-UX)
de: Verzeichnis ist eine kontextabhängige Datei (HP-UX)

source: A sticky command appeared in Version 32V AT&T UNIX.
de: Ein »sticky«-Befehl tauchte in Version 32V AT&T UNIX auf.

source: NOTES
de: ANMERKUNGEN

source: On Linux, B<lstat>() will generally not trigger automounter action, whereas B<stat>() will (but see B<fstatat>(2)).
de: Unter Linux löst B<lstat>() generell keine Automounter-Aktion aus, während B<stat>() dies tut (aber siehe B<fstatat>(2)).

source: For most files under the I</proc> directory, B<stat>() does not return the file size in the I<st_size> field; instead the field is returned with the value 0.
de: Für die meisten Dateien unterhalb des Verzeichnisses I</proc> liefert B<stat>() nicht die Dateigröße im Feld I<st_size> zurück, stattdessen wird das Feld mit dem Wert 0 zurückgeliefert.

source: Timestamp fields
de: Zeitstempelfelder

source: Older kernels and older standards did not support nanosecond timestamp fields. Instead, there were three timestamp fields\(emI<st_atime>, I<st_mtime>, and I<st_ctime>\(emtyped as I<time_t> that recorded timestamps with one-second precision.
de: Ältere Kernel und ältere Standards unterstützen keine Zeitstempel-Felder für Nanosekunden. Stattdessen gab es die drei Zeitstempel-Felder \(emI<st_atime>, I<st_mtime> und I<st_ctime>\(em, angegeben als I<time_t>, die Zeitstempel mit Sekundengenauigkeit ergaben.

source: Since kernel 2.5.48, the I<stat> structure supports nanosecond resolution for the three file timestamp fields. The nanosecond components of each timestamp are available via names of the form I<st_atim.tv_nsec> if the B<_BSD_SOURCE> or B<_SVID_SOURCE> feature test macro is defined. Nanosecond timestamps are nowadays standardized, starting with POSIX.1-2008, and, starting with version 2.12, glibc also exposes the nanosecond component names if B<_POSIX_C_SOURCE> is defined with the value 200809L or greater, or B<_XOPEN_SOURCE> is defined with the value 700 or greater. If none of the aforementioned macros are defined, then the nanosecond values are exposed with names of the form I<st_atimensec>.
de: Seit Kernel 2.5.48 unterstützt die I<stat>-Struktur die Nanosekunden-Auflösung für die drei Zeitstempel-Felder. Die Nanosekunden-Komponenten jedes Zeitstempels sind durch Namen der Form I<st_atim.tv_nsec> verfügbar, sofern das Feature-Test-Makro B<_BSD_SOURCE> oder B<_SVID_SOURCE> definiert ist. Nanosekunden-Zeitstempel sind heutzutage standardisiert, beginnend mit POSIX.1-2008, und die Glibc bietet seit Version 2.12 ebenfalls die Namen der Nanosekunden-Komponenten, wenn B<_POSIX_C_SOURCE> mit dem Wert 200809L oder größer oder B<_XOPEN_SOURCE> mit dem Wert 700 oder größer definiert ist. Falls keines der erwähnten Makros definiert ist, dann werden die Nanosekunden-Werte mit Namen der Form I<st_atimensec> angezeigt.

source: Nanosecond timestamps are supported on XFS, JFS, Btrfs, and ext4 (since Linux 2.6.23). Nanosecond timestamps are not supported in ext2, ext3, and Reiserfs. On filesystems that do not support subsecond timestamps, the nanosecond fields are returned with the value 0.
de: Nanosekunden-Zeitstempel werden von XFS, JFS, Btrfs und ext4 (seit Linux 2.6.23) unterstützt. Nanosekunden-Zeitstempel werden von ext2, ext3 und Reiserfs nicht unterstützt. Auf Dateisystemen, die für Zeitstempel keine Sekundenbruchteile unterstützen, wird für die Nanosekunden-Felder der Wert 0 zurückgegeben.

source: Underlying kernel interface
de: Darunterliegende Kernel-Schnittstelle

source: Over time, increases in the size of the I<stat> structure have led to three successive versions of B<stat>(): I<sys_stat>() (slot I<__NR_oldstat>), I<sys_newstat>() (slot I<__NR_stat>), and I<sys_stat64()> (new in kernel 2.4; slot I<__NR_stat64>). The glibc B<stat>() wrapper function hides these details from applications, invoking the most recent version of the system call provided by the kernel, and repacking the returned information if required for old binaries. Similar remarks apply for B<fstat>() and B<lstat>().
de: Mit der Zeit führte der Größenzuwachs der I<stat>-Struktur zu drei Folgeversionen von B<stat>(): I<sys_stat>() (slot I<__NR_oldstat>), I<sys_newstat>() (slot I<__NR_stat>) und I<sys_stat64()> (neu in Kernel 2.4; slot I<__NR_stat64>). Die Glibc-Wrapper-Funktion B<stat>() verbirgt diese Details vor Anwendungen, nutzt die neueste Version des vom Kernel bereitgestellten Systemaufrufs und passt die zurückgegebenen Informationen an, falls dies für alte Binaries erforderlich ist. Ähnliches gilt für B<fstat>() und B<lstat>().

source: The underlying system call employed by the glibc B<fstatat>() wrapper function is actually called B<fstatat64>().
de: Der der Glibc-Wrapper-Funktion B<fstatat>() zugrunde liegende Systemaufruf ist tatsächlich B<fstatat64>().

source: EXAMPLE
de: BEISPIEL

source: The following program calls B<stat>() and displays selected fields in the returned I<stat> structure.
de: Das folgende Programm ruft B<stat>() auf zeigt ausgewählte Felder der zurückgelieferten Struktur I<stat> an.

source: if (argc != 2) { fprintf(stderr, "Usage: %s E<lt>pathnameE<gt>\en", argv[0]); exit(EXIT_FAILURE); }
de: if (argc != 2) { fprintf(stderr, "Aufruf: %s E<lt>PfadnameE<gt>\en", argv[0]); exit(EXIT_FAILURE); }

source: printf("File type: ");
de: printf("Dateityp: ");

source: switch (sb.st_mode & S_IFMT) { case S_IFBLK: printf("block device\en"); break; case S_IFCHR: printf("character device\en"); break; case S_IFDIR: printf("directory\en"); break; case S_IFIFO: printf("FIFO/pipe\en"); break; case S_IFLNK: printf("symlink\en"); break; case S_IFREG: printf("regular file\en"); break; case S_IFSOCK: printf("socket\en"); break; default: printf("unknown?\en"); break; }
de: switch (sb.st_mode & S_IFMT) { case S_IFBLK: printf("blockorientiertes Gerät\en"); break; case S_IFCHR: printf("zeichenorientiertes Gerät\en"); break; case S_IFDIR: printf("Verzeichnis\en"); break; case S_IFIFO: printf("FIFO/Pipe\en"); break; case S_IFLNK: printf("symbolischer Link\en"); break; case S_IFREG: printf("reguläre Datei\en"); break; case S_IFSOCK: printf("Socket\en"); break; default: printf("unbekannt?\en"); break; }

source: printf("Mode: %lo (octal)\en", (unsigned long) sb.st_mode);
de: printf("Modus: %lo (oktal)\en", (unsigned long) sb.st_mode);

source: printf("Last status change: %s", ctime(&sb.st_ctime)); printf("Last file access: %s", ctime(&sb.st_atime)); printf("Last file modification: %s", ctime(&sb.st_mtime));
de: printf("Letzte Statusänderung: %s", ctime(&sb.st_ctime)); printf("Letzter Dateizugriff: %s", ctime(&sb.st_atime)); printf("Letzte Dateiänderung: %s", ctime(&sb.st_mtime));

source: SEE ALSO
de: SIEHE AUCH

source: COLOPHON
de: KOLOPHON

source: This page is part of release 3.74 of the Linux I<man-pages> project. A description of the project, information about reporting bugs, and the latest version of this page, can be found at \%http://www.kernel.org/doc/man-pages/.
de: Diese Seite ist Teil der Veröffentlichung 3.74 des Projekts Linux-I<man-pages>. Eine Beschreibung des Projekts, Informationen, wie Fehler gemeldet werden können sowie die aktuelle Version dieser Seite finden sich unter \%http://www.kernel.org/doc/man-pages/.
