Repository: krisfremen/manpages-l10n
Catalog: po/man2/stat.2.po
Languages: de

source: Linux Programmer's Manual
de: Linux-Programmierhandbuch

source: NAME
de: BEZEICHNUNG

source: stat, fstat, lstat, fstatat - get file status
de: stat, fstat, lstat, fstatat - Dateistatus ermitteln

source: SYNOPSIS
de: ÜBERSICHT

source: B<int stat(const char *>I<pathname>B<, struct stat *>I<buf>B<);>
de: B<int stat(const char *>I<Pfadname>B<, struct stat *>I<Puffer>B<);>

source: B<int fstat(int >I<fd>B<, struct stat *>I<buf>B<);>
de: B<int fstat(int >I<fd>B<, struct stat *>I<Puffer>B<);>

source: B<int lstat(const char *>I<pathname>B<, struct stat *>I<buf>B<);>
de: B<int lstat(const char *>I<Pfadname>B<, struct stat *>I<Puffer>B<);>

source: B<#include E<lt>fcntl.hE<gt> >/* Definition of AT_* constants */ B<#include E<lt>sys/stat.hE<gt>>
de: B<#include E<lt>fcntl.hE<gt> >/* Definition der AT_*-Konstanten */ B<#include E<lt>sys/stat.hE<gt>>

source: B<int fstatat(int >I<dirfd>B<, const char *>I<pathname>B<, struct stat *>I<buf>B<,> B< int >I<flags>B<);>
de: B<int fstatat(int >I<dirfd>B<, const char *>I<Pfadname>B<, struct stat *>I<Puffer>B<,> B< int >I<Schalter>B<);>

source: Feature Test Macro Requirements for glibc (see B<feature_test_macros>(7)):
de: Mit Glibc erforderliche Makros (siehe B<feature_test_macros>(7)):

source: /* glibc 2.19 and earlier */ _BSD_SOURCE ||
de: /* Glibc 2.19 und früher */ _BSD_SOURCE ||

source: /* Since glibc 2.20 */_DEFAULT_SOURCE ||
de: /* Seit Glibc 2.20 */_DEFAULT_SOURCE ||

source: || /* Since glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L
de: || /* seit Glibc 2.10: */ _POSIX_C_SOURCE\ E<gt>=\ 200112L

source: Since glibc 2.10:
de: Seit Glibc 2.10:

source: Before glibc 2.10:
de: Bis Glibc 2.10:

source: DESCRIPTION
de: BESCHREIBUNG

source: These functions return information about a file, in the buffer pointed to by I<stat>. No permissions are required on the file itself, but\(emin the case of B<stat>(), B<fstatat>(), and B<lstat>()\(emexecute (search) permission is required on all of the directories in I<pathname> that lead to the file.
de: Diese Funktionen geben Informationen über eine Datei im Puffer zurück, auf den I<stat> zeigt. Dazu werden keinerlei Rechte an der angegebenen Datei benötigt, aber \(emim Falle von B<stat>(), B<fstatat>() und B<lstat>()\(em müssen alle Verzeichnisse im I<Pfadnamen>, der zu der Datei führt, durchsucht werden dürfen.

source: B<stat>() and B<fstatat>() retrieve information about the file pointed to by I<pathname>; the differences for B<fstatat>() are described below.
de: B<stat>() und B<fstatat>() liefern die Informationen zu der in I<Pfadname> angegebenen Datei und übergibt diese an I<fstatat>(), wie nachfolgend beschrieben.

source: B<lstat>() is identical to B<stat>(), except that if I<pathname> is a symbolic link, then it returns information about the link itself, not the file that it refers to.
de: B<lstat>() ist ähnlich B<stat>(), nur dass falls I<Pfadname> ein symbolischer Link ist, Informationen zum Link zurückgegeben werden und nicht zur Datei, auf die der Link zeigt.

source: B<fstat>() is identical to B<stat>(), except that the file about which information is to be retrieved is specified by the file descriptor I<fd>.
de: B<fstat> ist ähnlich B<stat>, außer dass die Datei, zu der Informationen ermittelt werden sollen, durch den Dateideskriptor I<fd> angegeben wird.

source: All of these system calls return a I<stat> structure, which contains the following fields:
de: Alle diese Systemaufrufe geben eine Struktur vom Typ I<stat> zurück, die folgendermaßen aufgebaut ist:

source: struct stat { dev_t st_dev; /* ID of device containing file */ ino_t st_ino; /* inode number */ mode_t st_mode; /* protection */ nlink_t st_nlink; /* number of hard links */ uid_t st_uid; /* user ID of owner */ gid_t st_gid; /* group ID of owner */ dev_t st_rdev; /* device ID (if special file) */ off_t st_size; /* total size, in bytes */ blksize_t st_blksize; /* blocksize for filesystem I/O */ blkcnt_t st_blocks; /* number of 512B blocks allocated */
de: struct stat { dev_t st_dev; /* Gerät */ ino_t st_ino; /* INode */ mode_t st_mode; /* Zugriffsrechte */ nlink_t st_nlink; /* Anzahl harter Links */ uid_t st_uid; /* UID des Besitzers */ gid_t st_gid; /* GID des Besitzers */ dev_t st_rdev; /* Typ (wenn INode-Gerät) */ off_t st_size; /* Größe in Bytes*/ blksize_t st_blksize; /* Blockgröße für Dateisystem-E/A */ blkcnt_t st_blocks; /* Anzahl der zugewiesenen 512B-Blöcke */

source: /* Since Linux 2.6, the kernel supports nanosecond precision for the following timestamp fields. For the details before Linux 2.6, see NOTES. */
de: /* Seit Linux 2.6 unterstützt der Kernel Nanosekundengenauigkeit für die folgenden Zeitstempelfelder. Für Details vor Linux 2.6 lesen Sie ANMERKUNGEN. */

source: struct timespec st_atim; /* time of last access */ struct timespec st_mtim; /* time of last modification */ struct timespec st_ctim; /* time of last status change */
de: struct timespec st_atim; /* Zeit des letzten Zugriffs */ struct timespec st_mtim; /* Zeit der letzten Veränderung*/ struct timespec st_ctim; /* Zeit der letzten Statusänderung*/

source: #define st_atime st_atim.tv_sec /* Backward compatibility */ #define st_mtime st_mtim.tv_sec #define st_ctime st_ctim.tv_sec };
de: #define st_atime st_atim.tv_sec /* Rückwärtskompatibilität */ #define st_mtime st_mtim.tv_sec #define st_ctime st_ctim.tv_sec };

source: I<Note:> the order of fields in the I<stat> structure varies somewhat across architectures. In addition, the definition above does not show the padding bytes that may be present between some fields on various architectures. Consult the the glibc and kernel source code if you need to know the details.
de: I<Hinweis:> Die Reihenfolge der Felder in der I<stat>-Struktur ist in den verschiedenen Architekturen nicht gleich. Außerdem zeigt die oben genannte Definition nicht die Auffüll-Bytes, die in verschiedenen Architekturen zwischen einigen Feldern vorhanden sind. Im Quellcode von Glibc und Kernel finden Sie bei Bedarf Details hierzu.

source: The I<st_dev> field describes the device on which this file resides. (The B<major>(3) and B<minor>(3) macros may be useful to decompose the device ID in this field.)
de: Das Feld I<st_dev> beschreibt das Gerät, auf dem sich die Datei befindet. (Die Makros B<major>(3) und B<minor>(3) können zum Zerlegen der Geräte-ID in diesem Feld nützlich sein.)

source: The I<st_rdev> field describes the device that this file (inode) represents.
de: Das Feld I<st_rdev> beschreibt das Geräte, das diese Datei (Inode) repräsentiert.

source: The I<st_size> field gives the size of the file (if it is a regular file or a symbolic link) in bytes. The size of a symbolic link is the length of the pathname it contains, without a terminating null byte.
de: Das Feld I<st_size> zeigt die Größe der Datei (falls es sich um eine reguläre Datei oder einen symbolischen Link handelt) in Bytes an. Die Größe des symbolischen Links ist die Länge des enthaltenen Pfadnamens ohne abschließendes Nullbyte.

source: The I<st_blocks> field indicates the number of blocks allocated to the file, 512-byte units. (This may be smaller than I<st_size>/512 when the file has holes.)
de: Das Feld I<st_blocks> gibt die Anzahl der Blöcke, die der Datei zugewiesen sind, in 512-Byte-Einheiten an. Dies kann kleiner als I<st_size>/512 sein, wenn die Datei Löcher enthält.

source: The I<st_blksize> field gives the "preferred" blocksize for efficient filesystem I/O. (Writing to a file in smaller chunks may cause an inefficient read-modify-rewrite.)
de: Das Feld I<st_blksize> gibt die »bevorzugte« Blockgröße für effiziente E/A-Operationen des Dateisystems an (Schreiben in eine Datei in kleineren Teilen kann ineffizientes Lesen-Ändern-Schreiben verursachen).

source: Not all of the Linux filesystems implement all of the time fields. Some filesystem types allow mounting in such a way that file and/or directory accesses do not cause an update of the I<st_atime> field. (See I<noatime>, I<nodiratime>, and I<relatime> in B<mount>(8), and related information in B<mount>(2).) In addition, I<st_atime> is not updated if a file is opened with the B<O_NOATIME>; see B<open>(2).
de: Nicht alle der Linux-Dateisysteme implementieren auch alle Zeitfelder. Einige Dateisystemtypen erlauben das Einhängen in einer Weise, dass Datei- und/oder Verzeichniszugriffe keine Aktualisierung des Feldes I<st_atime> bewirken (siehe I<noatime>, I<nodiratime> und I<relatime> in B<mount>(8) sowie diesbezügliche Informationen in B<mount>(2)). Außerdem wird I<st_atime> nicht aktualisiert, wenn eine Datei mit B<O_NOATIME> geöffnet wird; siehe B<open>(2).

source: The field I<st_atime> is changed by file accesses, for example, by B<execve>(2), B<mknod>(2), B<pipe>(2), B<utime>(2), and B<read>(2) (of more than zero bytes). Other routines, like B<mmap>(2), may or may not update I<st_atime>.
de: Das Feld I<st_atime> wird durch Dateizugriffe geändert, zum Beispiel durch B<execve>(2), B<mknod>(2), B<pipe>(2), B<utime>(2) und B<read>(2) (von mehr als 0 Bytes). Andere Routinen, wie B<mmap>(2), können I<st_atime> ändern, müssen dies aber nicht.

source: The field I<st_mtime> is changed by file modifications, for example, by B<mknod>(2), B<truncate>(2), B<utime>(2), and B<write>(2) (of more than zero bytes). Moreover, I<st_mtime> of a directory is changed by the creation or deletion of files in that directory. The I<st_mtime> field is I<not> changed for changes in owner, group, hard link count, or mode.
de: Das Feld I<st_mtime> verändert sich beim Einsatz von dateimodifizierenden Operationen, z.B. durch B<mknod>(2), B<truncate>(2), B<utime>(2) und B<write>(2) (von mehr als null Bytes). Außerdem wird I<st_mtime> durch das Anlegen oder Löschen von Dateien in diesem Verzeichnis geändert. Das Feld I<st_mtime> wird I<nicht> durch Ändern von Besitzer, Gruppe, Hardlink-Zähler oder Modus verändert.

source: The field I<st_ctime> is changed by writing or by setting inode information (i.e., owner, group, link count, mode, etc.).
de: Das Feld I<st_ctime> wird durch Beschreiben oder Setzen der Inode-Informationen geändert (d.h. Besitzer, Gruppe, Link-Zähler, Modus etc.).

source: The following mask values are defined for the file type component of the I<st_mode> field:
de: Die folgende Maskenwerte sind für die Dateityp-Komponente des Felds I<st_mode> definiert:

source: S_IFMT 0170000 bit mask for the file type bit fields
de: S_IFMT 0170000 Bitmaske für die Dateityp-Bitfelder

source: S_IFLNK 0120000 symbolic link
de: S_IFLNK 0120000 symbolischer Link

source: S_IFREG 0100000 regular file
de: S_IFREG 0100000 reguläre Datei

source: S_IFBLK 0060000 block device
de: S_IFBLK 0060000 blockorientiertes Gerät

source: S_IFDIR 0040000 directory
de: S_IFDIR 0040000 Verzeichnis

source: S_IFCHR 0020000 character device
de: S_IFCHR 0020000 zeichenorientiertes Gerät

source: Thus, to test for a regular file (for example), one could write:
de: Um beispielsweise eine reguläre Datei zu testen, könnten Sie Folgendes verwenden:

source: stat(pathname, &sb); if ((sb.st_mode & S_IFMT) == S_IFREG) { /* Handle regular file */ }
de: stat(pathname, &sb); if ((sb.st_mode & S_IFMT) == S_IFREG) { /* reguläre Datei verarbeiten */ }

source: Because tests of the above form are common, additional macros are defined by POSIX to allow the test of the file type in I<st_mode> to be written more concisely:
de: Da Tests der obigen Form häufig sind, definiert POSIX zusätzliche Makros, um präzisere Tests des Dateityps in I<st_mode> zu ermöglichen:

source: is it a regular file?
de: ist es eine reguläre Datei?

source: directory?
de: Verzeichnis?

source: character device?
de: zeichenorientiertes Gerät?

source: block device?
de: blockorientiertes Gerät?

source: FIFO (named pipe)?
de: FiFo (benannte Pipe) ?

source: symbolic link? (Not in POSIX.1-1996.)
de: symbolischer Link? (nicht in POSIX.1-1996.)

source: socket? (Not in POSIX.1-1996.)
de: Socket? (Nicht in POSIX.1-1996.)

source: The preceding code snippet could thus be rewritten as:
de: Der obige Code-Schnipsel sollte daher folgendermaßen geändert werden:

source: stat(pathname, &sb); if (S_ISREG(sb.st_mode)) { /* Handle regular file */ }
de: stat(pathname, &sb); if (S_ISREG(sb.st_mode)) { /* reguläre Datei verarbeiten */ }

source: The definitions of most of the above file type test macros are provided if any of the following feature test macros is defined: B<_BSD_SOURCE> (in glibc 2.19 and earlier), B<_SVID_SOURCE> (in glibc 2.19 and earlier), or B<_DEFAULT_SOURCE> (in glibc 2.20 and later). In addition, definitions of all of the above macros except B<S_IFSOCK> and B<S_ISSOCK>() are provided if B<_XOPEN_SOURCE> is defined. The definition of B<S_IFSOCK> can also be exposed by defining B<_XOPEN_SOURCE> with a value of 500 or greater.
de: Die Definitionen der meisten der oben genannten Testmakros für Dateitypen werden bereitgestellt, sofern irgendeines der folgenden Feature-Test-Makros definiert ist: B<_BSD_SOURCE> (in Glibc 2.19 und früher), B<_SVID_SOURCE> (in Glibc 2.19 und früher) oder B<_DEFAULT_SOURCE> (in Glibc 2.20 und neuer). Zusätzlich werden Definitionen aller oben genannten Makros außer B<S_IFSOCK> und B<S_ISSOCK>() bereitgestellt, wenn B<_XOPEN_SOURCE> definiert ist. Die Definition von B<S_IFSOCK> kann auch durch Setzen von B<_XOPEN_SOURCE> auf einen Wert von 500 oder größer erreicht werden.

source: The definition of B<S_ISSOCK>() is exposed if any of the following feature test macros is defined: B<_BSD_SOURCE> (in glibc 2.19 and earlier), B<_DEFAULT_SOURCE> (in glibc 2.20 and later), B<_XOPEN_SOURCE> with a value of 500 or greater, or B<_POSIX_C_SOURCE> with a value of 200112L or greater.
de: Die Definition von B<S_ISSOCK>() ist verfügbar, wenn eines der folgenden Feature-Test-Makros definiert ist: B<_BSD_SOURCE> (in Glibc 2.19 und früher), B<_DEFAULT_SOURCE> (in Glibc 2.20 und früher), B<_XOPEN_SOURCE> mit einem Wert von 500 oder größer oder B<_POSIX_C_SOURCE> mit einem Wert von 200112L oder größer.

source: The following mask values are defined for the file permissions component of the I<st_mode> field:
de: Die folgenden Maskenwerte sind für die Zugriffsrechte-Komponente des Felds I<st_mode> definiert:

source: S_ISUID 0004000 set-user-ID bit
de: S_ISUID 0004000 SUID-Bit

source: S_ISGID 0002000 set-group-ID bit (see below)
de: S_ISGID 0002000 SGID-Bit (siehe unten)

source: S_ISVTX 0001000 sticky bit (see below)
de: S_ISVTX 0001000 Sticky-Bit (siehe unten)

source: S_IRWXU 00700 mask for file owner permissions
de: S_IRWXU 00700 Bitmaske für Besitzerzugriffsrechte

source: S_IRUSR 00400 owner has read permission
de: S_IRUSR 00400 Besitzer hat Lesezugriff

source: S_IWUSR 00200 owner has write permission
de: S_IWUSR 00200 Besitzer hat Schreibzugriff

source: S_IXUSR 00100 owner has execute permission
de: S_IXUSR 00100 Besitzer hat Ausführungsrechte

source: S_IRWXG 00070 mask for group permissions
de: S_IRWXG 00070 Bitmaske für Gruppenzugriffsrechte

source: S_IRGRP 00040 group has read permission
de: S_IRGRP 00040 Gruppe hat Lesezugriff

source: S_IWGRP 00020 group has write permission
de: S_IWGRP 00020 Gruppe hat Schreibzugriff

source: S_IXGRP 00010 group has execute permission
de: S_IXGRP 00010 Gruppe hat Ausführungsrechte

source: mask for permissions for others (not in group)
de: Bitmaske für Zugriffsrechte Anderer (nicht in Gruppe)

source: S_IROTH 00004 others have read permission
de: S_IROTH 00004 Andere haben Lesezugriff

source: S_IWOTH 00002 others have write permission
de: S_IWOTH 00002 Andere haben Schreibzugriff

source: S_IXOTH 00001 others have execute permission
de: S_IXOTH 00001 Andere haben Ausführungsrechte

source: The set-group-ID bit (B<S_ISGID>) has several special uses. For a directory, it indicates that BSD semantics is to be used for that directory: files created there inherit their group ID from the directory, not from the effective group ID of the creating process, and directories created there will also get the B<S_ISGID> bit set. For a file that does not have the group execution bit (B<S_IXGRP>) set, the set-group-ID bit indicates mandatory file/record locking.
de: Das SGID-Bit (B<S_ISGID>) hat verschiedene besondere Nutzungsmöglichkeiten: Für ein Verzeichnis bedeutet es, das die BSD-Semantik Anwendung findet: Dateien, die in ihm erzeugt werden, erben die Gruppen-ID des Verzeichnisses und nicht die effektive Gruppen-ID des erzeugenden Prozesses, und dort erzeugte Verzeichnisse haben das B<SGID>-Bit ebenfalls gesetzt. Für eine Datei, bei der das Bit für Gruppenausführungsrechte (B<S_IXGRP>) nicht gesetzt ist, bedeutet es erzwungenes Sperren von Datei/Datensatz.

source: The sticky bit (B<S_ISVTX>) on a directory means that a file in that directory can be renamed or deleted only by the owner of the file, by the owner of the directory, and by a privileged process.
de: Das »Sticky«-Bit (B<S_ISVTX>) an einem Verzeichnis bedeutet, dass eine Datei in diesem Verzeichnis nur vom Besitzer der Datei, dem Besitzer des Verzeichnisses, und von einem privilegierten Prozess umbenannt und gelöscht werden darf.

source: The B<fstatat>() system call operates in exactly the same way as B<stat>(), except for the differences described here.
de: Der Systemaufruf B<fstatat>() funktioniert genauso wie B<stat>(), außer den hier beschriebenen Unterschieden.

source: If the pathname given in I<pathname> is relative, then it is interpreted relative to the directory referred to by the file descriptor I<dirfd> (rather than relative to the current working directory of the calling process, as is done by B<stat>() for a relative pathname).
de: Falls der in I<Pfadname> übergebene Pfadname relativ ist, wird er als relativ zu dem im Dateideskriptor I<dirfd> referenzierten Verzeichnis interpretiert (statt relativ zum aktuellen Arbeitsverzeichnis des aufrufenden Prozesses, wie es bei B<stat>() für einen relativen Pfadnamen erfolgt).

source: If I<pathname> is relative and I<dirfd> is the special value B<AT_FDCWD>, then I<pathname> is interpreted relative to the current working directory of the calling process (like B<stat>()).
de: Falls I<Pfadname> relativ ist und I<dirfd> den besonderen Wert B<AT_FDCWD> annimmt, wird I<Pfadname> als relativ zum aktuellen Arbeitsverzeichnis des aufrufenden Prozesses interpretiert (wie B<stat>()).

source: If I<pathname> is absolute, then I<dirfd> is ignored.
de: Falls I<Pfadname> absolut ist, wird I<dirfd> ignoriert.

source: I<flags> can either be 0, or include one or more of the following flags ORed:
de: I<Schalter> kann entweder 0 sein oder durch bitweises ODER eines oder mehrere der folgenden Schalter gesetzt haben:

source: B<AT_EMPTY_PATH> (since Linux 2.6.39)
de: B<AT_EMPTY_PATH> (seit Linux 2.6.39)

source: If I<pathname> is an empty string, operate on the file referred to by I<dirfd> (which may have been obtained using the B<open>(2) B<O_PATH> flag). If I<dirfd> is B<AT_FDCWD>, the call operates on the current working directory. In this case, I<dirfd> can refer to any type of file, not just a directory. This flag is Linux-specific; define B<_GNU_SOURCE> to obtain its definition.
de: Falls I<Pfadname> eine leere Zeichenkette ist, wird mit der Datei gearbeitet, auf die I<dirfd> verweist (dies kann mit dem B<O_PATH>-Schalter von B<open>(2) ermittelt werden). Falls I<dirfd> B<AT_FDCWD> ist, erfolgt der Aufruf im aktuellen Arbeitsverzeichnis. In diesem Fall kann sich I<dirfd> auf jeden Dateityp beziehen, nicht unbedingt ein Verzeichnis. Dieser Schalter ist Linux-spezifisch; definieren Sie B<_GNU_SOURCE>, um dessen Definition zu ermitteln.

source: B<AT_NO_AUTOMOUNT> (since Linux 2.6.38)
de: B<AT_NO_AUTOMOUNT> (seit Linux 2.6.38)

source: Don't automount the terminal ("basename") component of I<pathname> if it is a directory that is an automount point. This allows the caller to gather attributes of an automount point (rather than the location it would mount). This flag can be used in tools that scan directories to prevent mass-automounting of a directory of automount points. The B<AT_NO_AUTOMOUNT> flag has no effect if the mount point has already been mounted over. This flag is Linux-specific; define B<_GNU_SOURCE> to obtain its definition.
de: Die Terminal-»basename«-Komponente von I<Pfadname> wird nicht automatisch eingehängt, wenn es ein Verzeichnis ist, das selbst ein Einhängepunkt ist. Dies ermöglicht dem Aufrufenden, Informationen zu einem Auto-Einhängepunkt zu sammeln, anstatt zu dem Ort, der eingehängt werden würde. Dieser Schalter kann in Werkzeugen verwendet werden, die Verzeichnisse einlesen, um automatische Masseneinhängungen eines Verzeichnisses zu verhindern, welches Auto-Einhängepunkte enthält. Der Schalter B<AT_NO_AUTOMOUNT> ist unwirksam, wenn der Einhängepunkt bereits eingehängt wurde. Dieser Schalter ist Linux-spezifisch; definieren Sie B<_GNU_SOURCE>, um dessen Definition zu ermitteln.

source: If I<pathname> is a symbolic link, do not dereference it: instead return information about the link itself, like B<lstat>(). (By default, B<fstatat>() dereferences symbolic links, like B<stat>().)
de: Falls I<Pfadname> ein symbolischer Link ist, wird er nicht dereferenziert: Stattdessen werden Informationen zum Link selbst zurückgegeben, wie B<lstat>(). In der Voreinstellung dereferenziert B<fstatat>() symbolische Links, wie auch B<stat>().

source: See B<openat>(2) for an explanation of the need for B<fstatat>().
de: Lesen Sie B<openat>(2) für eine Beschreibung der Notwendigkeit von B<fstatat>().

source: RETURN VALUE
de: RÜCKGABEWERT

source: On success, zero is returned. On error, -1 is returned, and I<errno> is set appropriately.
de: Bei Erfolg wird Null zurückgegeben. Bei einem Fehler wird -1 zurückgegeben und I<errno> entsprechend gesetzt.

source: ERRORS
de: FEHLER

source: Search permission is denied for one of the directories in the path prefix of I<pathname>. (See also B<path_resolution>(7).)
de: Der Suchzugriff auf eines der Verzeichnisse im Pfadpräfix von I<Pfadname> wurde verweigert (siehe auch B<path_resolution>(7)).

source: I<fd> is bad.
de: I<fd> ist falsch.

source: Bad address.
de: Ungültige Adresse

source: Too many symbolic links encountered while traversing the path.
de: Beim Pfaddurchlauf wurden zu viele symbolische Links gefunden.

source: I<pathname> is too long.
de: I<Pfadname> ist zu lang.

source: A component of I<pathname> does not exist, or I<pathname> is an empty string.
de: Eine Komponente von I<Pfadname> existiert nicht oder I<Pfadname> ist die leere Zeichenkette.

source: Out of memory (i.e., kernel memory).
de: Kein Speicher mehr (das bedeutet Speicher im Kernel).

source: A component of the path prefix of I<pathname> is not a directory.
de: Eine Komponente des Pfadpräfixes von I<Pfadname> ist kein Verzeichnis.

source: I<pathname> or I<fd> refers to a file whose size, inode number, or number of blocks cannot be represented in, respectively, the types I<off_t>, I<ino_t>, or I<blkcnt_t>. This error can occur when, for example, an application compiled on a 32-bit platform without I<-D_FILE_OFFSET_BITS=64> calls B<stat>() on a file whose size exceeds I<(1E<lt>E<lt>31)-1> bytes.
de: I<Pfadname> oder I<fd> bezieht sich auf eine Datei, deren Name, Inode-Anzahl oder Anzahl der Blöcke nicht durch die Typen I<off_t>, I<ino_t> oder I<blkcnt_t> repräsentiert werden kann. Dieser Fehler kann beispielsweise auftreten, wenn eine auf einer 32-bit-Plattform kompilierte Anwendung ohne I<-D_FILE_OFFSET_BITS=64> B<stat>() für eine Datei aufruft, deren Größe I<(1E<lt>E<lt>31)-1> Byte übersteigt.

source: The following additional errors can occur for B<fstatat>():
de: Die folgenden Fehler können zusätzlichen bei B<fstatat>() auftreten:

source: I<dirfd> is not a valid file descriptor.
de: I<dirfd> ist kein zulässiger Dateideskriptor.

source: Invalid flag specified in I<flags>.
de: Unzulässiger Schalter in I<Schalter> angegeben.
