Repository: krisfremen/manpages-l10n
Catalog: po/man1/dmesg.1.po
Languages: de

source: July 2011
de: Juli 2011

source: User Commands
de: Dienstprogramme für Benutzer

source: NAME
de: BEZEICHNUNG

source: dmesg - print or control the kernel ring buffer
de: dmesg - den Kernel-Ringpuffer anzeigen und steuern

source: SYNOPSIS
de: ÜBERSICHT

source: B<dmesg> [B<options>]
de: B<dmesg> [B<Optionen>]

source: B<dmesg --read-clear> [B<options>]
de: B<dmesg --read-clear> [B<Optionen>]

source: B<dmesg --console-level> I<level>
de: B<dmesg --console-level> I<Ebene>

source: DESCRIPTION
de: BESCHREIBUNG

source: B<dmesg> is used to examine or control the kernel ring buffer.
de: B<dmesg> wird zur Untersuchung und Steuerung des Kernel-Ringpuffers verwendet.

source: The default action is to read all messages from kernel ring buffer.
de: Die Vorgabeaktion beinhaltet das Lesen aller Meldungen des Kernel-Ringpuffers.

source: OPTIONS
de: OPTIONEN

source: The --clear, --read-clear, --console-on, --console-off and --console-level options are mutually exclusive.
de: Die Optionen --clear, --read-clear, --console-on, --console-off und --console-level schließen sich gegenseitig aus.

source: Clear the ring buffer.
de: leert den Ringpuffer.

source: Clear the ring buffer contents after printing.
de: löscht den Inhalt des Ringpuffers, nachdem er ausgegeben wurde.

source: Disable printing messages to the console.
de: deaktiviert die Ausgabe der Meldungen in der Konsole.

source: Display the timestamp and time delta spent between messages. If used together with --notime then only the time delta without the timestamp is printed.
de: zeigt den Zeitstempel und die zwischen den Meldungen vergangene Zeit an. Wenn Sie dies zusammen mit --notime verwenden, werden nur die Zeiträume ohne Zeitstempel angezeigt.

source: Enable printing messages to the console.
de: aktiviert die Ausgabe der Meldungen in der Konsole.

source: B<-f, --facility >I<list>
de: B<-f, --facility >I<Liste>

source: Restrict output to defined (comma separated) list of facilities. For example
de: begrenzt die Ausgabe auf eine (durch Kommata getrennte) Liste der Leistungen. Zum Beispiel gibt

source: will print messages from system daemons only. For all supported facilities see B<dmesg --help> output.
de: ausschließlich Meldungen von Daemons (Systemdiensten) aus. Eine Liste aller möglichen Leistungen finden Sie in der Ausgabe von B<dmesg --help>.

source: Print a help text and exit.
de: gibt eine Hilfe aus und beendet das Programm.

source: Print kernel messages.
de: gibt Kernelmeldungen aus.

source: B<-l, --level >I<list>
de: B<-l, --level >I<Liste>

source: Restrict output to defined (comma separated) list of levels. For example
de: beschränkt die Ausgabe auf die (durch Kommata getrennte) Liste der Ebenen. Zum Beispiel gibt

source: will print error and warning messages only. For all supported levels see B<dmesg --help> output.
de: nur Fehlermeldungen und Warnungen aus. Rufen Sie B<dmesg --help> auf, um eine Liste aller unterstützten Ebenen zu sehen.

source: B<-n, --console-level >I<level>
de: B<-n, --console-level >I<Ebene>

source: Set the I<level> at which logging of messages is done to the console. The I<level> is a level number or abbreviation of the level name. For all supported levels see B<dmesg --help> output.
de: setzt die I<Ebene> (die Protokollierstufe) für die Ausgabe der Meldungen in der Konsole. I<Ebene> ist dabei als Nummer oder Abkürzung des Namens der Ebene anzugeben. Rufen Sie B<dmesg --help> auf, um eine Liste der unterstützten Ebenen anzeigen zu lassen.

source: For example, B<-n 1> or B<-n alert> prevents all messages, except emergency (panic) messages, from appearing on the console. All levels of messages are still written to I</proc/kmsg>, so B<syslogd>(8) can still be used to control exactly where kernel messages appear. When the B<-n> option is used, B<dmesg> will I<not> print or clear the kernel ring buffer.
de: Zum Beispiel unterdrücken B<-n 1> oder B<-n alert> alle Meldungen außer Notfallmeldungen (»panic«). Sämtliche Nachrichtenebenen werden noch nach I</proc/kmsg> geschrieben, so dass Sie mit B<syslogd>(8) steuern können, wo Kernelmeldungen erscheinen. Mit der Option B<-n> gibt B<dmesg> I<keine> Meldungen aus und löscht den Ringpuffer nicht.

source: Print the raw message buffer, i.e., don't strip the log level prefixes.
de: zeigt den unverarbeiteten Meldungspuffer an. Die Präfixe der Ebenen (Protokollierstufen) werden nicht entfernt.

source: B<-s, --buffer-size >I<size>
de: B<-s, --buffer-size >I<Größe>

source: Use a buffer of I<size> to query the kernel ring buffer. This is 16392 by default. (The default kernel syslog buffer size was 4096 at first, 8192 since 1.3.54, 16384 since 2.1.113.) If you have set the kernel buffer to be larger than the default then this option can be used to view the entire buffer.
de: verwendet einen Puffer der angegebenen I<Größe> zur Abfrage des Kernel-Ringpuffers. Die vorgegebene Größe ist 16392. (Die Vorgabegröße war in der Vergangenheit zunächst 4096, dann 8192 seit Kernel 1.3.54 und 16384 seit Kernel 2.1.113) Falls Sie den Kernelpuffer größer gewählt haben als die Vorgabe, kann diese Option zur Anzeige des gesamten Puffers verwendet werden.

source: Print human readable timestamps. The timestamp could be inaccurate!
de: gibt menschenlesbare Zeitstempel aus. Der Zeitstempel könnte allerdings ungenau sein!

source: B<The time source used for the logs is not updated after system SUSPEND/RESUME.>
de: B<Die für die Protokollierung verwendete Zeit wird nach SUSPEND- und RESUME-Vorgängen nicht erneut abgeglichen.>

source: Don't print kernel's timestampts.
de: verhindert die Ausgabe von Zeitstempeln des Kernels.

source: Print userspace messages.
de: gibt Meldungen der Anwendungsebene aus.

source: Output version information and exit.
de: gibt Versionsinformationen aus und beendet das Programm.

source: Decode facility and level (priority) number to human readable prefixes.
de: dekodiert die Nummern von Leistungen und Ebenen (Priorität) in menschenlesbare Präfixe.

source: SEE ALSO
de: SIEHE AUCH

source: AUTHORS
de: AUTOREN

source: AVAILABILITY
de: VERFÜGBARKEIT

source: The dmesg command is part of the util-linux package and is available from ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl dmesg ist Teil des Pakets util-linux und kann von ftp://ftp.kernel.org/pub/linux/utils/util-linux/ heruntergeladen werden.
