Repository: krisfremen/manpages-l10n
Catalog: po/man1/pg.1.po
Languages: de

source: July 2014
de: Juli 2014

source: User Commands
de: Dienstprogramme für Benutzer

source: NAME
de: BEZEICHNUNG

source: pg - browse pagewise through text files
de: pg - Textdateien seitenweise durchsuchen

source: SYNOPSIS
de: ÜBERSICHT

source: B<pg> [B<->I<amount>] [B<-p> I<prompt>] [B<-cefnrs>] [B<+>I<line>] [B<+/>I<pattern>B</>] [I<file>...]
de: B<pg> [B<->I<Anzahl>] [B<-p> I<Eingabeaufforderung>] [B<-cefnrs>] [B<+>I<Zeile>] [B<+/>I<Muster>B</>] [I<Datei> …]

source: DESCRIPTION
de: BESCHREIBUNG

source: B<pg> displays a text file on a E<.SM CRT> one screenful at once. After each page, a prompt is displayed. The user may then either press the newline key to view the next page or one of the keys described below.
de: B<pg> zeigt eine Textdatei auf einem E<.SM CRT> seitenweise an. Nach jeder Seite wird eine Eingabeaufforderung angezeigt. Dann kann der Benutzer entweder eine neue Zeile auslösen (Eingabetaste), um die nächste Seite anzuzeigen oder eine der nachfolgend beschriebenen Tasten drücken.

source: If no filename is given on the command line, B<pg> reads from standard input. If standard output is not a terminal, B<pg> acts like B<cat>(1) but precedes each file with its name if there is more than one.
de: Falls in der Befehlszeile kein Dateiname angegeben wird, liest B<pg> aus der Standardeingabe. Wenn die Standardausgabe kein Terminal ist, arbeitet B<pg> wie B<cat>(1), aber stellt jeder Datei deren Namen voran, sofern es mehrere Dateien gibt.

source: If input comes from a pipe, B<pg> stores the data in a buffer file while reading, to make navigation possible.
de: Falls die Eingabe aus einer Weiterleitung (Pipe) stammt, speichert B<pg> die Daten während des Lesens in einem Puffer, um trotzdem die Navigation zu ermöglichen.

source: OPTIONS
de: OPTIONEN

source: B<pg> accepts the following options:
de: B<pg> akzeptiert die folgenden Optionen:

source: B<+>I<number>
de: B<+>I<Nummer>

source: Start at the given line number.
de: beginnt in der angegebenen Zeile.

source: B<+/>I<pattern>B</>
de: B<+/>I<Muster>B</>

source: Start at the line containing the Basic Regular Expression I<pattern> given.
de: beginnt in der Zeile, die durch den regulären Ausdruck in I<Muster> angegeben wird.

source: B<->I<number>
de: B<->I<Anzahl>

source: The number of lines per page. By default, this is the number of E<.SM CRT> lines minus one.
de: legt die Zeilenanzahl pro Seite fest. Üblicherweise ist dies die Anzahl der Zeilen in E<.SM CRT> minus eins.

source: Clear the screen before a page is displayed, if the terminfo entry for the terminal provides this capability.
de: leert den Bildschirm, bevor eine Seite angezeigt wird, sofern der terminfo-Eintrag für dieses Terminal diese Fähigkeit bereitstellt.

source: Do not pause and display E<.SM (EOF)> at the end of a file.
de: pausiert nicht und zeigt E<.SM (EOF)> am Ende der Datei an.

source: Do not split long lines.
de: verhindert das Umbrechen langer Zeilen.

source: Without this option, commands must be terminated by a newline character. With this option, B<pg> advances once a command letter is entered.
de: Ohne diese Option müssen Befehle stets mit einem Zeichen für eine neue Zeile abgeschlossen werden. Mit dieser Option wird B<pg> unmittelbar aufgerufen, sobald ein Befehlsbuchstabe eingegeben wird.

source: B<-p>I<\ string>
de: B<-p>I<\ Zeichenkette>

source: Instead of the normal prompt I<:>, I<string> is displayed. If I<string> contains B<%d>, its first occurrence is replaced by the number of the current page.
de: Anstelle der normalen Eingabeaufforderung I<:> wird eine I<Zeichenkette> angezeigt. Falls die I<Zeichenkette> I<%d> enthält, wird dessen erstes Vorkommen durch die Nummer der aktuellen Seite ersetzt.

source: Disallow the shell escape.
de: deaktiviert die Escape-Sequenzen der Shell.

source: Print messages in I<standout> mode, if the terminfo entry for the terminal provides this capability.
de: gibt Meldungen im I<standout>-Modus aus, sofern der terminfo-Eintrag für dieses Terminal diese Fähigkeit bereitstellt.

source: Display version information and exit.
de: zeigt Versionsinformationen an und beendet das Programm.

source: Display help text and exit.
de: zeigt diese Hilfe an und beendet das Programm.

source: COMMANDS
de: BEFEHLE

source: The following commands may be entered at the prompt. Commands preceded by I<i> in this document accept a number as argument, positive or negative. If this argument starts with B<+> or B<->, it is interpreted relative to the current position in the input file, otherwise relative to the beginning.
de: Die folgenden Befehle können in der Eingabeaufforderung angegeben werden. Die Befehle, denen in diesem Dokument ein I<i> vorangestellt ist, akzeptieren eine positive oder negative Zahl als Argument. Wenn das Argument mit B<+> oder B<-> beginnt, dann wird es relativ zur aktuellen Position in der Eingabedatei interpretiert, anderenfalls relativ zum Anfang.

source: I<i>B<E<lt>EnterE<gt>>
de: I<i>B<E<lt>EingabetasteE<gt>>

source: Display the next or the indicated page.
de: zeigt die nächste oder angegebene Seite an.

source: Display the next halfpage. If I<i> is given, it is always interpreted relative to the current position.
de: zeigt die nächste Halbseite an. Wenn I<i> angegeben ist, wird dies immer als relativ zur aktuellen Position interpretiert.

source: Display the next or the indicated line.
de: zeigt die nächste oder angegebene Zeile an.

source: Skip a page forward. I<i> must be a positive number and is always interpreted relative to the current position.
de: springt eine Seite vor. I<i> muss eine positive Zahl sein und wird immer als relativ zur aktuellen Position interpretiert.

source: I<i>B<w> or I<i>B<z>
de: I<i>B<w> oder I<i>B<z>

source: As B<E<lt>EnterE<gt>> except that I<i> becomes the new page size.
de: verhält sich wie B<E<lt>neue ZeileE<gt>>, außer dass I<i> als neue Seitengröße gewählt wird.

source: B<.> or B<^L>
de: B<.> oder B<^L>

source: Redraw the screen.
de: aktualisiert den Bilschirminhalt.

source: Advance to the last line of the input file.
de: springt zur letzten Zeile der Eingabedatei.

source: I<i>B</>I<pattern>B</>
de: I<i>B</>I<Muster>B</>

source: Search forward until the first or the I<i>-th occurrence of the Basic Regular Expression I<pattern> is found. The search starts after the current page and stops at the end of the file. No wrap-around is performed. I<i> must be a positive number.
de: sucht vorwärts, bis zum ersten Vorkommen des im I<Muster> angegebenen regulären Ausdrucks. Die Suche beginnt nach der aktuellen Seite und stoppt am Ende der Datei. Die Suche wird nicht am Anfang fortgesetzt. I<i> muss eine positive Zahl sein.

source: I<i>B<?>I<pattern>B<?> or I<i>B<^>I<pattern>B<^>
de: I<i>B<?>I<Muster>B<?> or I<i>B<^>I<Muster>B<^>

source: Search backward until the first or the I<i>-th occurrence of the Basic Regular Expression I<pattern> is found. The search starts before the current page and stops at the beginning of the file. No wrap-around is performed. I<i> must be a positive number.
de: sucht rückwärts, bis zum I<i>-ten Vorkommen des im I<Muster> angegebenen regulären Ausdrucks. Die Suche beginnt vor der aktuellen Seite und stoppt am Anfang der Datei. Die Suche wird nicht am Ende fortgesetzt. I<i> muss eine positive Zahl sein.

source: The search commands accept an added letter. If B<t> is given, the line containing the pattern is displayed at the top of the screen, which is the default. B<m> selects the middle and B<b> the bottom of the screen. The selected position is used in following searches, too.
de: Der Suchbefehl akzeptiert einen weiteren Buchstaben. Wenn B<t> angegeben wird, dann wird die Zeile, die das Muster enthält, am oberen Rand des Bildschirms angezeigt (Vorgabe). B<m> wählt die Mitte und B<b> den unteren Rand des Bildschirms für die Anzeige. Die ausgewählte Position wird auch in folgenden Suchvorgängen verwendet.

source: Advance to the next file or I<i> files forward.
de: springt zur nächsten Datei oder I<i> Dateien vor.

source: Reread the previous file or I<i> files backward.
de: springt zur vorherigen Datei oder I<i> Dateien zurück.

source: B<s>I<\ filename>
de: B<s>I<\ Dateiname>

source: Save the current file to the given I<filename.>
de: speichert die aktuellen Datei unter dem angegebenen I<Dateinamen>.

source: Display a command summary.
de: zeigt eine Zusammenfassung zum Befehlsaufruf an.

source: B<!>I<command>
de: B<!>I<Befehl>

source: Execute I<command> using the shell.
de: führt den I<Befehl> in der Shell aus.

source: B<q> or B<Q>
de: B<q> oder B<Q>

source: Quit.
de: Beenden.

source: If the user presses the interrupt or quit key while B<pg> reads from the input file or writes on the terminal, B<pg> will immediately display the prompt. In all other situations these keys will terminate B<pg>.
de: Sobald der Benutzer die Abbruch- oder Beenden-Taste drückt, während B<pg> aus der Eingabedatei liest oder in das Terminal schreibt, zeigt B<pg> unmittelbar eine Eingabeaufforderung an. In allen anderen Situationen führen die genannten Tastendrücke direkt zum Beenden von B<pg>.

source: ENVIRONMENT VARIABLES
de: UMGEBUNGSVARIABLEN

source: The following environment variables affect the behavior of B<pg>:
de: Die folgenden Umgebungsvariablen beeinflussen das Verhalten von B<pg>:

source: Overrides the system-supplied number of columns if set.
de: überschreibt die vom System vorgegebene Spaltenanzahl, falls gesetzt.

source: See B<locale>(7).
de: Siehe B<locale>(7).

source: Overrides the system-supplied number of lines if set.
de: überschreibt die vom System vorgegebene Zeilenanzahl, falls gesetzt.

source: Used by the B<!> command.
de: wird vom B<!>-Befehl verwendet.

source: Determines the terminal type.
de: bestimmt den Typ des Terminals.

source: SEE ALSO
de: SIEHE AUCH

source: NOTES
de: ANMERKUNGEN

source: B<pg> expects the terminal tabulators to be set every eight positions.
de: B<pg> erwartet eine Tabulatorbreite des Terminals von acht Zeichen.

source: Files that include E<.SM NUL> characters cannot be displayed by B<pg>.
de: Dateien, die das Zeichen E<.SM NUL> enthalten, können durch B<pg> nicht dargestellt werden.

source: AVAILABILITY
de: VERFÜGBARKEIT

source: The pg command is part of the util-linux package and is available from ftp://ftp.kernel.org/pub/linux/utils/util-linux/.
de: Der Befehl pg ist Teil des Pakets util-linux und kann von ftp://ftp.kernel.org/pub/linux/utils/util-linux/ heruntergeladen werden.
