Repository: krisfremen/manpages-l10n
Catalog: po/man1/sha512sum.1.po
Languages: de

source: User Commands
de: Dienstprogramme für Benutzer

source: NAME
de: BEZEICHNUNG

source: sha512sum - compute and check SHA512 message digest
de: sha512sum - SHA512-Prüfsummen berechnen und überprüfen

source: SYNOPSIS
de: ÜBERSICHT

source: B<sha512sum> [I<OPTION>]... [I<FILE>]...
de: B<sha512sum> [I<OPTION>]... [I<DATEI>]...

source: DESCRIPTION
de: BESCHREIBUNG

source: Print or check SHA512 (512-bit) checksums. With no FILE, or when FILE is -, read standard input.
de: SHA512‐Prüfsummen (512 Bit) ausgeben oder überprüfen. Ohne DATEI oder wenn DATEI »-« ist, Standardeingabe lesen.

source: read in binary mode
de: Im Binärmodus lesen

source: read SHA512 sums from the FILEs and check them
de: SHA512‐Prüfsummen aus DATEIen lesen und überprüfen

source: read in text mode (default)
de: Im Textmodus lesen (Voreinstellung)

source: The following three options are useful only when verifying checksums:
de: Die folgenden drei Optionen sind nur beim Überprüfen sinnvoll:

source: don't print OK for each successfully verified file
de: Nicht für jede erfolgreich geprüfte Datei OK ausgeben

source: don't output anything, status code shows success
de: Nichts ausgeben, der Statuscode zeigt Erfolg an

source: warn about improperly formatted checksum lines
de: Bei ungeeignet formatierten Prüfsummenzeilen warnen

source: with B<--check>, exit non-zero for any invalid input
de: In Kombination mit B<--check> wird das Programm bei jeder ungültigen Eingabe mit einem Fehler beendet.

source: display this help and exit
de: Diese Hilfe anzeigen und beenden

source: output version information and exit
de: Versionsinformation anzeigen und beenden

source: The sums are computed as described in FIPS-180-2. When checking, the input should be a former output of this program. The default mode is to print a line with checksum, a character indicating type (`*' for binary, ` ' for text), and name for each FILE.
de: Die Summen werden wie in FIPS-180-2 beschrieben berechnet. Beim Überprüfen sollte die Eingabe eine frühere Ausgabe dieses Programms sein. Die normale Arbeitsweise ist es, eine Zeile mit Prüfsumme, einem Zeichen, das den Typ anzeigt (»*« für binär, » « für Text), und dem Namen jeder DATEI auszugeben.

source: AUTHOR
de: AUTOR

source: Written by Ulrich Drepper, Scott Miller, and David Madore.
de: Geschrieben von Ulrich Drepper, Scott Miller und David Madore.

source: REPORTING BUGS
de: FEHLER BERICHTEN

source: Report sha512sum bugs to bug-coreutils@gnu.org
de: Berichten Sie Fehler in sha512sum (auf Englisch) an bug-coreutils@gnu.org

source: GNU coreutils home page: E<lt>http://www.gnu.org/software/coreutils/E<gt>
de: Homepage der GNU coreutils: E<lt>http://www.gnu.org/software/coreutils/E<gt>

source: General help using GNU software: E<lt>http://www.gnu.org/gethelp/E<gt>
de: Allgemeine Hilfe zur Benutzung von GNU-Software: E<lt>http://www.gnu.org/gethelp/E<gt>

source: Report sha512sum translation bugs to E<lt>http://translationproject.org/team/E<gt>
de: Berichten Sie Fehler in der Übersetzung von sha512sum an E<lt>http://translationproject.org/team/de.htmlE<gt>

source: Copyright \(co 2011 Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later E<lt>http://gnu.org/licenses/gpl.htmlE<gt>.
de: Copyright \(co 2011 Free Software Foundation, Inc. Lizenz GPLv3+: GNU GPL Version 3 oder neuer E<lt>http://gnu.org/licenses/gpl.htmlE<gt>.

source: This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
de: Dies ist freie Software: Sie können sie verändern und weitergeben. Es gibt KEINE GARANTIE, soweit gesetzlich zulässig.

source: SEE ALSO
de: SIEHE AUCH

source: The full documentation for B<sha512sum> is maintained as a Texinfo manual. If the B<info> and B<sha512sum> programs are properly installed at your site, the command
de: Die vollständige Dokumentation für B<sha512sum> wird als Texinfo-Handbuch gepflegt. Wenn die Programme B<info> und B<sha512sum> auf Ihrem Rechner ordnungsgemäß installiert sind, können Sie mit dem Befehl

source: should give you access to the complete manual.
de: auf das vollständige Handbuch zugreifen.
